{"": [" \"Joy Week\" - \"World's Greatest Female Impersonators\"", "\"12th week at Club Picadilly, Baltimore\"", "\"3 Complete Floor Shows Nightly\"", "\"About September 15, Barnett Hyman will open another pansy show in the basement of the Christie Hotel in Hollywood. Club will be called the New Yorker and Jean Malin is being brought here from New York to head the floor show. Hyman, until recently, was a partner of B.B.B.'s. in the cellar enterprise.\"", "\"Another 'drage' ball scheduled for the Alabam next week . . . They don't allow them any more in Hollywood where morals are always thought to be looser . . . Nor do they allow those strange folk, who like to be called 'queer,' to parade their shame at the cafe as entertainers, either as female or male impersonators.\"", "\"B.B.B.'s cellar does not feature any one performer, there's a line of 10 boys in a review\" (added as \"unnamed\" here)", "\"Beautiful Girls - Gorgeous Costumes - Sensational Dancers\" \"Hot-Cha All-Girl Show\"", "\"Big Floor Show\", \"Positively the Funniest Show that ever appeared in Akron\"", "\"Billie Davies Atlantic City Revue\" - promises 50 female impersonators and 18 fan dancers.", "\"Billy Davies Atlantic City Revue\"; promises 50 female impersonators and 18 fan dancers.", "\"Constant—Continuous—Convulsive Entertainment! Tantalizing—'Toe-Tickling Dance Melodies\"", "\"Dazzling New York Revue\", \"Bobby LaRue and Female Impersonators\"", "\"Direct from 10 Weeks of Tremendous Success at Club Paradise\"", "\"Direct from 62 weeks at Spinning Wheel\"", "\"Direct from K-9 Club, Chicago\"", "\"Exhibition of 8—Gorgeous Boys—8\" (added as \"unnamed\" here) - \"See exquisite wedding scene\" and \"oriental Chinese fiesta\"", "\"Fay Elliot and King, in an indifferent sketch . . . present the double kick of revealing a female and a male impersonator in the same number. However, there was never a moment's doubt about the female impersonator what with angular elbows and knees.\"", "\"Featuring Three Stellar Female Impersonators\" (added as \"unnamed\" here) - \"Also Line of Girls, 'The Rhythmettes'.\"", "\"Featuring Three Stellar Female Impersonators\" (added as \"unnamed\" here) - \"Line of Girls, 'The Rhythmettes'.\" \"4 Shows Nightly\"", "\"Female Impersonator Revue\"", "\"Female Impersonators\" \"Only show like it in the county\", \"It's Gay—Swishy—Ducky\"", "\"Female Impersonators\", \"Starting Tuesday\"", "\"Female impersonators, 4 shows. Heartiest Season's Greetings.\"", "\"Gala Floor Show (Female Impersonators)\" \"The first fete of its kind to be staged in Hammonton.\"", "\"Gala Floor Show\"", "\"HELD OVER BY POPULAR DEMAND!\", \"Gay . . . Daring . . . Glamorous. NEW ACTS NEW SHOW\" \"THREE DIFFERENT SHOWS NIGHTLY\"", "\"Here a corking good floor show is presented, interspersed with some comedy by a half dozen female impersonators.\"", "\"Line of Girls, 'The Four Rhythmettes'\"", "\"Maier and his plain-clothes men watched the floor show in Oscar's Cafe . . . until they said they found the performance of two female impersonators 'lewd and indecent.' They let the 'singing waiters' warble, then sent the customers home at midnight and took the impersonators to the station, along with the proprietor, Oscar Gensler, 37, of Memphis st. near Berks, and the bartender, John Lenker, 33, of Huntingdon st. near Front . . . the impersonators, Anthony DiMeo, 27, of 11th st. near Ontario, and Martin Wynne, 33, of Wallace st. near 16th, charged with disorderly conduct.\"", "\"Opening Wednesday Nite, July 3rd\", \"Presents Nightly Asbury Park's Most Unique Floor Show. . . . . Featuring an Array of Beautiful Female Impersonators Direct From Club Richman.\"", "\"Performances will be given continuously every day except Sunday. There will be midnight shows on Wednesday and Saturday.\"", "\"San Francisco's Sensational Show\"", "\"Sensational Floor Show\"", "\"Star Studded Revue of Nationally Famed FEMALE IMPERSONATORS\"; \"Thousands in wardrobe, beautiful gowns, beautiful 'women'\"", "\"The '31' Club at 31st st. and Girard, recently badly damaged by fire, is reopening tomorrow . . . In the floor show are Osborne and de Marco, female impersonators; Nick Gallucci, Giggles Craig and Melvin Evans, M. C.\"", "\"The affair turned out to be most elaborate\"", "\"The company includes 35 female impersonators, who will be appear [sic] in a program of song and dance numbers seen for the first time in Brooklyn following a long run in Atlantic City.\"", "\"Under the direction of . . . founders of the Spanish School of Beauty Culture, a 'Night in Spain' was given Thursday . . . for the benefit of the church school.\"", "\"Wednesday night is a gay night . . . with songs and acts aplenty, because it is carnival night. A new addition to the large floor show is a female impersonator, Leon Fredrick\"", "\"Wesley Davis and his associates, reputed as America's most versatile female impersonators will be presented in the Olympic Cafe floor show tomorrow evening. In forty-five minutes of extraordinary entertainment, the troop will give a novelty sketch entitled, 'Boys Will Be Girls.'\"", "\"Where Boys Will Be Girls\" \"8 Big Acts\" ", "\"a burlesque on female impersonation\"", "\"ensembles of fan dancers and serpentine performers and Whirlwind Johnson's Harlem Hotcha Band.\" Total of 35 performers!", "\"floor show extraordinary for one week only\", \"Direct from finest eastern clubs.\"", "\"for another week . . . Supporting him are two clever dancers, Mack and Ray, Bob Andrews, golden-voiced master of ceremonies . . .\"", "*Unnamed company* (ex-service men)", "An \"intimate revue\" together with Marilyn Lowe, also from cast of \"Diamond Lil\"", "An \"intimate revue\" with many costumes, including the costume from \"Catherine\" and a \"satin and bejeweled madam,\" and a \"Queen of the Ballet\" outfit.", "Barrows is the producer of the unique revue, which is titled 'Ladies By Request.' It is a lovely fantasy which features six truly beautiful female impersonators whose professional names are Valda Gray, Carol Lee, Petite Swanson, Lady Doris, Bobbie Macklin and Dixie Lee. The 'chorus' actually rivals Gladys Bentley's Harlem crew in beauty.\"", "Billy Davies from another page in the same paper is here referred to as Billie Davis. \"35 female impersonators, will come into the Majestic Theater, Brooklyn, for one week beginning tomorrow.\"", "Direct to The Blue Room from Club Richman", "Paris-Harlem Nite club and ball room, \"six female impersonators.\"", "Touring circus, LaTour was with them last season", "[a new musical in New York]", "benefit show . . . for Rae Bourbon, one of the biggest names in the field of female impersonization.", "featuring \"Several Female Impersonators\" (inferred here as _at least_ three, who have been added as \"unknown\")", "return engagement (also last summer)", "show closed down \"shortly after it opened\"", "show is a direct fight against inflation and smaller shows, along with the fact that I am sincerely interested in keeping this art form (female impersonation) at a high level.", "touring circus"], "(Benefit show for Rae Bourbon)": ["benefit show . . . for Rae Bourbon, one of the biggest names in the field of female impersonization."], "A Cruise Around the World": ["Inferring revue name from starr-jackie-11-14-37.jpg; \"A new Peppy Floor Show starring Geo. Hayes and his orchestra — Female Impersonators — Flo Arden, sensational vocalist — An outstanding Revue — in a cruise around the world\" + amateur night on Friday"], "A Fantasty of Fun": [], "A Galaxy of Stars": [], "A Little Mazel": [], "A Parade of Broadway Celebrities": [], "A Red Hot Floor Show": [], "A Reversed Revue": [], "All Girl Glamorous Revue": [], "All Star Revue": [], "All-Girlie Revue": [], "All-Star Floor Show": ["\"The Biggest and Peppiest Floor Show in the Region\""], "All-Star Revue": [], "Allentown Automobile Dealers Show": [], "America's Foremost Female Impersonators": [], "Ann's Log Cabin's Boys Will Be Girls Revue": ["\"Direct from K-9 Club, Chicago\""], "Arizona to Broadway": [], "Art Sizer's Boys Will Be Girls": [], "Artist and Model Costume Ball": [], "At the Jazz Band Ball": [], "Autumn Revels": [], "B.B.B.'s Boys Will Be Girls Revue": [], "Babe Baker Revue": [], "Babe Baker's Ha Ha Revue": [], "Baby Jan Ray and Her Female Impersonators": [], "Band Box's All Boy-Girl Revue": [], "Belvedere Club's unnamed revue": ["\"For additional entertainment, four men of repute, impersonating the gay and bashful young lady of pre-war history, who gave their yawns behind a fan and who never exposed the calf or the knee, keep the crowds bowling in mirth with their antics in the audience.\""], "Berkey's Boys Will Be Girls Revue": [], "Bert Sherry and His Parade of Stars": [], "Bert Smith's Girly-Go-Round": ["10-act vaudeville show, Jan 7–9, Wilbur Cushman unit known as the \"Girlie-Go-Round Revue\""], "Big Gala Sepia Floor Show": ["\"A show that is clean and full of good songs, and jokes, and dancing\""], "Billy Herrero's Playboy Revue": ["\"held over for five weeks\""], "Billy Joy's All-Male Show \"Boys Will Be Girls\": A Collegiate Revue": [], "Bob Allen's All Boy Review": [], "Bob Smith's All Male Revue": ["\"5 Female Impersonators—5 Complete Acts . . . it's hilarious!—it's a riot!\" (added as \"unnamed\" here)", "5th week"], "Bobbie La Marr and his \"sophisticated playboys\"": [], "Bobbie La Rue's Boys Will Be Girls Revue": ["\"GORGEOUS COSTUMES, IMPERSONATIONS OF FAMOUS STARS\""], "Bobby Brennan and his Gay Boy Revue": [], "Bobby Clark's All Male Review": [], "Bobby Dean's Scan-Dolls Revue": [], "Bobby La Rue's Playboy Show": ["\"Any democrats in the audience.\""], "Boys Will Be Boys All Female Impersonator Revue": [], "Boys Will Be Girls": ["\"continues its novel floor revue, entitled Boys Will Be Girls, only 'nance' show in town.\""], "Boys Will Be Girls: A Miniature Revue": ["\"Billie Davies Atlantic City Revue\" - promises 50 female impersonators and 18 fan dancers.", "\"Billy Davies Atlantic City Revue\"", "\"Performances will be given continuously every day except Sunday. There will be midnight shows on Wednesday and Saturday.\"", "\"THE Brooklyn Majestic Theater hasn't died of shame as a result of the showing there two weeks ago of the little gem called 'Boys Will Be Girls.' It raises its head again. Having been throughly [sic] renovated, it presents next Friday and Saturday no less a person than Ruth Draper, in her impersonations, quite different from the impersonations of the club girls from Atlantic City who preceded her. . . . Probably her coming will bring back to the Majestic many of the friends it has been forced by circumstances to neglect in recent seasons.\"", "\"The company includes 35 female impersonators, who will be appear [sic] in a program of song and dance numbers seen for the first time in Brooklyn following a long run in Atlantic City.\"", "\"ensembles of fan dancers and serpentine performers and Whirlwind Johnson's Harlem Hotcha Band.\" Total of 35 performers!", "Billy Davies from another page in the same paper is here referred to as Billie Davis. \"35 female impersonators, will come into the Majestic Theater, Brooklyn, for one week beginning tomorrow.\"", "Review: \"The good old Brooklyn Majestic Theater has let into its doors this week something peculiar. It is called an entertainment, but is instead a sad and incomparably stupid demonstrationo f [sic] the fact that nature cannot always call her shots. There are three movies on the program, two short, one long and all bad, and a revue called brazenly 'Boys Will Be Girls.' The billboards scream the statement that its cast is composed of 50 female impersonators, but there are hardly that number, though too many by far. A woman is their shepherd, an obese cutie who begins proceedings by deploring the fact that female impersonaators [sic] are too easily thought of as effeminate, whereas instead they are merely artists exhibiting their art. The madam apologizes further saying that there were illustrious gentlemen of the type in the dramas of the ancient Greeks and in the good Shakespeare's day, indicating that the profession is one of the oldest, if not the most venerable. Chatty and something of a historian, the fat woman goes on the e5/8ect [sic] that once New Jersey and New York had a Governor who governed both States at the same time, dressed as a woman, this, presumably, being proof that her own swarm of ungentlemanly androgynes are not accidents, but artists. Further, to substantiate her belief, she announces that they are all members of a club in Atlantic City, a club called by the name of an otherwise ino5/8emsove little 3/8ower that long since bowed its head in shame. The little name is exposed with hopeful prominence on the billboards in order to persuade the more imbecile part of the public to come in and view the art exhibit. Well, the madame introduces her boys one by one and it developes [sic], as was to be expected, that there isn't the faintest hint of talent in the whole crestfallen lot of them. They can do nothnig [sic] but wear girls' clothes, poor neuters, and they look as if they needed a bath, They dance and sing, limp and pathetic, conscious of their incompetence and in1/8rmities [sic], and are accompanied by a disinterested Negro orchestra. One of them is described by the pulpy madame as the Lily Pons of the club, another as the Ethel Waters and still another hopes to be a fair imitation of Gertrude Lawrence. Two of the little mother's indistinguishable bipeds are cast as comedians and when one asks, 'Weren't you embarrassed?' the other responds, 'No, I was in Hoboken.' The same two try later to be a little dirty, but they fall far short of almost any Broadway revue comedian you can think of. The whole thing, unless there is something cryptic about the goings on that only the initiated can understand, is a goax. Just a madame trying to make money selling 3/8owers [sic]. I am afraid her worshipped Shakespeare would call her a pander. He was a blunt man. Approximately enough, the long movie . . . has most of its scenes laid in Capri, not a stranger to evidences of nature's indecision. In one of the short 1/8lms the late Hal Skelly is the star. It is not funnier than anything the madame's loyal club fellow's [sic] have to say.\"", "Review: \"[The films fill in] the time between performances of Billie Davies' Atlantic City Revue, 'Boys Will Be Girls,' which occupies the Majestic Theatre stage. The revue is composed of 50 female impersonators. Like all revues, the presentation includes dance and song specialties, ensembles, black-outs and a band. A major features [sic] of the production is a fan fdance, in which a baker's dozen of the cast wave ostrich plumes a la Sally Rand. . . . In addition to the fan dancers, 'Boys Will Be Girls' is featured by such numbers as an Oriental Dance, by Eugene Casali; an interpretation of the Carioca by Arica Wild, and Whirlwind Johnson's Harlem Hotcha Band.\""], "Boys' and Girls' Impersonation Show": [], "Broadway Entertainers": ["\"Rhythm! Yes They Have It.\""], "Broadway Playboy Revue": [], "Broadway Scan-Dolls": [], "Broadway on Parade All-Male Revue": ["\"New All-Male Revue\" - \"6 Female Impersonators\" (added as \"unnamed\" here)"], "Burma Slave Market": [], "Buster Brown's Brownies": [], "Cabaret Star Revue": [], "Camp Upton Military Revue": ["\"When the soldier boys of Camp Upton present their military revue, written by Sergeant Irving Berlin, at the Century Theatre the week of August 19, they propose to have everything done strictly according to Hoyle. Fifty of the boys will be \"show girls\" and \"flappers\" in the new revue, and in order to get correct atmosphere and see that the \"girls\" learn to dance according to the best rules of stage management, Sergeant Berlin came to town yesterday from Camp Upton, called at the Century Theatre and persuaded Morris Gest to promise to \"lend\" him twelve of the best dancers in the Century Grove midnight revue to go to Camp Upton and teach dancing steps to the 'rookies.'\""], "Catherine Was Great": ["Mae West's play with plenty drag"], "Celebrity Concert": [], "Central Opera House's Drag": [], "Charley's Aunt": [], "Chicago's K9 Playboy Revue": [], "City of Hope Show": [], "Cliftonn Argue and His Own Intimate Broadway Review: A Gay Playboy Review": ["Unknown number of performers"], "Club Zombie's Boys Will Be Girls": ["7th week"], "College Capers": [], "Convertibles: Boys Will Be Girls": [], "Cotton Club Revue": ["\"A real Harlem flavor is to be found at the new Cotton Club Revue at Cleveland's warmest hot spot.\""], "Daddy Was a Lady": [], "Dainty June and her Newsboy Act": [], "Dance of the Fairies": ["Four unnamed performers (added as \"unnamed\" here)."], "Danny Brown and His All Male Revue \"Glorifying the American Boy\"": [], "Danny Brown and His All-Male Collegiate Revue": ["\"10th Big Week\"", "\"6th BIG WEEK\"; \"America's most beautiful MEN and most talented Impersonators\" — \"Whoops! You Must See\"", "\"8th BIG WEEK\"", "\"Female Impersonators and Beautiful Girls\"", "\"Held Over 2nd Week\"", "\"The all-male Collegiate Revue now in its fourth week at the Club Frontenac is headed by Lyle Mack. All members of the cast are college graduates, and have appeared the country over in their impersonations.\"; revue name corroborated by advertisement in Detroit Free Press, January 22, 1937, 10.", "\"The new show at the Club Frontenac offers an all-male collegiate revue, including several impersonators.\"; revue name corroborated by advertisement in Detroit Free Press, January 22, 1937, 10."], "Darktown Follies": [], "Dee Liddell's Gay Boy Revue": [], "Depression Club's Amazing Cast of Female Impersonators": ["\"Constant—Continuous—Convulsive Entertainment! Tantalizing—'Toe-Tickling Dance Melodies\""], "Detroit's Original All Male Revue": ["\"11th Big Week!\" Now noting that it's the \"original\" in the face of Club Chateau's attempt to take audiences.", "\"20th BIG WEEK\"", "\"NINETEENTH BIG WEEK\"", "\"now in its twelfth week\""], "Dewey and Dewey and Their Honolulu Coons": [], "Dion and Marion and Their Boys on Parade": [], "Down Argentine Way": [], "Dreamland's Boys Will Be Girls Revue": [], "Dunbar Palace's Christmas Glee Benefit": [], "Durr's Tavern's International Revue": [], "E. Russell's Playboy Revue": [], "Eddie Lee's Glamour Boys": ["\"Held Over for 4th . . . Week!\""], "Elm Lodge's Fashion Boy Revue": ["\"Opening Next Week\""], "Elm Lodge's Playboy Revue": ["\"The Show Supreme\""], "Fantasy Frolics": ["\"a New MINIATURE MUSICAL COMEDY\""], "Fay Norman's Gay Boy Revue": ["\"11 People\" (added as \"unnamed\" here)", "\"12 People\" (added as \"unnamed\" here); \"Direct from 42 Weeks Run in New York City\"", "\"12 artists . . . 40 minutes of the fastest, most sensational show ever on a night club floor\"", "\"14 Clever Female Impersonators In a Musical Extravaganza Featuring Jessie Lane and America's Fastest Stepping MALE CHORUS.\" (added as \"unnamed\" here)", "\"14 Clever Female Impersonators\" (added as \"unnamed\" here); \"It's Smart! It's Sophisticated! It's Different! It's Clean!\"", "\"14 Clever Female Impersonators\" (added as unnamed here); \"It's Unusual! It's Sensational! It's Clean. It's Decent!\"", "\"14 Clever Female Impersonators\" (the ones missing added as \"unnamed\" here)", "\"14 Clever Female Impersonators—Something New! Never Seen Before in Nashville\" (added as \"unnamed\" here)", "\"14 Company\" (added as \"unnamed\" here)", "\"14 Talented Female Impersonators\" (added as \"unnamed\" here)", "\"15 Clever Female Impersonators\" ; \"'The Feather Parade'—A dazzling spectacle—and by popular demand\"", "\"15 Female Impersonators\" (added as \"unnamed\" here)", "\"40 Minutes of Mirth\"; \"25,000 Have Seen and Enjoyed\"\n", "\"8 Stars\" (added as \"unnamed\" here)", "\"A gala array of gorgeously costumed, charming voiced boys, impersonating women. A clean, wholesome and modern show.\"", "\"AND 12 artists, acclaimed the finest female impersonators in America today\"", "\"As Ziegfeld Glorified the American Girl—Miss Norman Glorifies the AMERICAN BOY in The Feather Parade . . . The triumphant return of Jackie Lane and his regal but saucy impersonations, who last week captivated the hearts of Southwestern Michigan.\"", "\"Bigger! Better! Greater than ever!\"", "\"Don't fail to see this unusual MALE CHORUS acclaimed the greatest traveling group of Female Impersonators in America. This cast of 18 artists will amaze and entertain you with their accurate stepping and appearance in their gorgeous costumes.\"", "\"Fay Norman and His 'Boys Will Be Girls Review'\"", "\"It's Fun—It's Different\"", "\"It's Fun—It's Different\"; \"It's Vivacious, It's Gay\"", "\"Lima's Greatest Floor Show Sensation\"; \"THIRD and LAST — BIG WEEK\"", "\"See It—Live It—Dance It\"", "\"Stupendous and Bizarre\"", "\"Superb entertainment by 12 stars\" (added as \"unnamed\" here)", "\"The Boy in Gold\"", "\"The Largest Traveling Floor Show in America\"", "\"These 12 Artists, Appearing in Gorgeous Costumed and Beautiful Gowns Will Amaze You. Come and Be Gay.\"", "\"This whole program comes to the Plantation direct from a 42 week stand in New York\"", "\"Thousands of people have seen them, many of them have come back time and again. The time is short, if you haven't seen them, do it now.\"", "\"Trial of the members of the 'Gay Boy Revue,' Miss Fay Forman, director, and Robert Andrews, proprietor of La Ville, Cold Springs road house, twice postponed, is now scheduled before Justice Charles H. Hall at Balwinsville tomorrow (Wednesday). Eight female impersonators were arrested by deputy sheriffs during a raid on La Ville and were charged with indecent exposure. City police over the week end gave floor shows using female impersonators the double-o, but made no arrests.\"", "\"company composed of 14 female impersonators. A complete song and dance review is presented twice each night\"\n", "(mentions 14 people but no names)", "(mentions 14 people+ some names)", "(no names, but mentions 14 people)", "12 people (unknown names added as \"unnamed\" here)", "15 Female Impersonators (added as \"unnamed\" here)", "15 performers, one (Connie Walsh) named, the others added here as \"unknown\". \"'The Feather Parade': A dazzling spectacle—and by popular demand\"", "18 artists; 13 unnamed (added as \"unnamed\" here)", "Circuit court testing vulgar", "For the past nine weeks", "Revue name corroborated by The News-Palladium,  10 Jul 1936, 2. This article: \"There are 12 performers in the show, all featured in female impersonations.\" (added as \"unnamed\" here)", "Show in legal trouble, but injunction issued. What happened next, we don't know - the newspaper didn't report on it", "Two units touring here!\n\nThis is the second company, coming Monday Night. \"Return Engagement By Special Request Last Times Tonight Union No. 1 'Gay Boy Revue'\"", "banned some weeks earlier", "no other names, but mentions 14 people"], "Female Impersonators Supreme": [], "Finnie Ball": ["\"show . . . consisted of a host of celebraties [sic] from various clubs throughout the city\""], "Finnies Club's Halloween Ball": [], "Finocchio's Revue": [], "Florence King's All-Male Revue": [], "Florence King's Boys Will Be Girls Revue": ["\"It's sensational!!! THE NEW FLORENCE KING Revue of Female Impersonators\" featuring Bobby La Rue \"Opening Tomorrow Night\"", "Miss Florence King and her 'Boys Will Be Girls' revue will open their second week at Club Washington tonight. The show features Bobbie LaRue, direct from Frolic Inn, Hollywood, Calif.; Vern Valdez and Ken King, also of the same company; Merry Pickford, who, though deaf, does his dancing act to vibration of the drums; Leonard Jans and Johnny Kay. A complete change of routine and costumes will be offered. Chickie Mears has been added to the revue for this week's performances."], "Francis Renault's All-Fem Impersonator Revue": [], "Francis Renault's Slave of Fashion Revue": [], "Frankie Quinn and his Playboy Revue": [], "French Box Revue": ["Foremost Female Impersonators"], "Funny Fanny and His Gay Boy Parade Female Impersonators": [], "Gals, Girls, Molls, Dolls": [], "Garden of Allah's All-Boy Revue": ["\"5 Female Impersonators Beginning their 2nd big week to a record-breaking attendance! 2 Big 40 Minute Shows Nightly\""], "Gay 90's Revue": [], "Gay Boy Revels of 1939": [], "Gay Girl Impersonators' Revue": ["\"Revue, Hollywood's Big Thrill Better 'n 'The Follies,' Yes, 'n' Funnier Than Bryant's 'Show Boat'\"", "\"The revue originated in Hollywood and comes from a run at the Club Picardy, Chicago.\"", "\"kept at the new Lookout House for a second and final week starting Saturday night\""], "Gay New Yorker Revue": [], "Gene Dana's Playboy Revue": [], "Gene Ford's Playboy Revue": ["4th week - \"engaged for an indefinite period\""], "Giddy's Playboy Revue": [], "Girl Hollywood Revue": [], "Glamorous Female Impersonators": ["\"10th week of Glamorous Female Impersonators\""], "Glamour On Parade": [], "Gloria's Follies": [], "Glorified Playboy Revue": [], "Glorifying the American Boy": [], "Golddiggers of 1933": [], "Grand View Park's Grand National Treasure Hunt": [], "Greenwich Village Follies": [], "Harvey Lee Revue": [], "Heart of Chinatown": [], "Hello Dixieland": [], "Hello Francis!": ["\"Principals [in nightclub floorshow] are mainly from in [sic] the musical, 'Hello Francis,' which Equity stopped when no bond was posted for the chorus. Renault, subsequently, was suspended by Equity for refusing to quit the show.\""], "Hello, Francis": [], "Henri St. Charles and His All Boy Revue": ["\"New Boys—Bigger Show—Gorgeous Gowns\""], "Herbert Crowley's Different Revue": [], "Here Come the Clowns": [], "Hi-Boy Revue": [], "Hillcrest Cafe's All-Boy Revue": [], "His All-Girl Hollywood Revue": [], "His Easter Parade": ["\"Something Very Gay\""], "Holiday Revels": [], "Hot Rhythm": [], "Hot-Cha Hinton's Playboy Revue": [], "Hotel Dauphin's Playboy-Gayboy Revue": [], "Hotsy Totsy Revue": [], "How Come Company": [], "Howard House and His All-Boy Revue": [], "Impressions": [], "International Varieties": [], "Jack Cione's Lavish Revue": ["\"Cast of 14\""], "Jack Leystan's All Boy Revue": ["\"set for the summer at the El Casino Club\"", "14 acts", "revue with company \"have played night clubs for past three years\"; \"the first All Boy Revue to appear on any midway under canvas . . . hope to open a new field of work for female impersonators thru this endeavor\""], "Jack Mason's Drag Ball": ["\"on October 17\""], "Jack Mason's Fashion Revue": [], "Jack Mason's Masonettes": [], "Jack Mason's Play Boy Revue": [], "Jack Mason's Playboy Revue": ["\"Jack Mason's new revue at the Club Richman has a potpourri of everything you want. From a fashion parade they vault you over into a program of palm-tree music from an aggregation known as 'The South Sea Islanders and from them into a session with Jack Mayo's 'Blasters.' The 'Blasters,' despite the name, are not road workers let loose in the mutnitions plant but musicians, each with an idea all his own on how to run an orchestra.\"", "\"New York's funniest laff parade. . . . different! Startling! Darling!\"", "6th month of 2nd edition", "First presented Thursday evening", "In rehearsal", "Incorrect date - but adjacent to this according to evidence", "Notes that it is the second year they perform here", "Opening tonight", "Spelled Jackie Mason - \"Something new, daring\"", "held over indefinitely", "in rehearsal", "rehearsals for Fall edition", "soon to have premiere", "such success that a Vitaphone short is underway (contracts signed)\n", "such success that a theatre production is being planned"], "Jay Colby and His All Male Mannequin Revue": ["\""], "Jean Evol's Boys Will Be Girls Revue": [], "Jean Evol's International Troup": [], "Jerry Clayton and His Boys on Parade": ["\"Beauty—Grace—Charm—Comedy\"", "\"Complete new show\", \"NEW ACTS! Gowns! Songs!\", \"Beautiful Gowns [of] All Styles\""], "Jewel Box Revue": ["\"35 of America's Foremost Femme Mimics\"", "\"AMERICA'S FOREMOST IMPERSONATORS\"", "\"featuring costumes from the nation's ranking accouteriers.\"", "second appearance at Apollo this year", "second appearance at Apollo this year\n"], "Jimmie Holmes' Famous Female Impersonators": ["\"The show that's been thrilling Corpus Christi people for the past 8 weeks\", \"New Numbers... New Costumes. You owe it to yourself to see this show before it's too late.\" Later known under Phil Craig and His Playboy Revue? See The Corpus Christi, TX Caller-Times, July 16, 1937, 12B.", "Revue name from The Corpus Christi Caller-Times, August 28, 1936, 16. Later known under Phil Craig and His Playboy Revue? See The Corpus Christi, TX Caller-Times, July 16, 1937, 12B."], "Joe Canary and His Playboy Continental Revue": ["later indications that this might not have been drag"], "Johnny Kaye and His Playboy Revue": ["\"10 Beautiful, Glamorous and Talented\" (added as \"unnamed\" here)", "\"10 Female Impersonators\"", "\"5 Performers\"; \"Sensational! Scintillating!\"; \"The show that took Buffalo by Storm last year comes to town again, after a successful engagement at the Club Perrie, New York City.\"", "\"A Bevy of Beautiful Boys\" Inferring 8 (here added as \"unnamed\") from Syracuse Journal, April 2, 1935, 23", "\"Gay — Gorgeous — Glamorous\"", "\"It's a Broadway Sensation\"", "\"That Scintillating Girl-Boy Revue\"", "\"a Bevy of 8 BEAUTIFUL BOYS . . . 2 SHOWS NIGHTLY\" (added as \"unnamed\" here)"], "Jonas and Francis' Playboy Revue": [], "Jungle Inn's Gay Boy Revue": [], "Karyl Norman's Male Mannequins": ["\"2 BIG SHOWS NIGHTLY\" \"30 DIFFERENT ACTS\" \"20 ENTERTAINERS\"", "\"20-entertainer, 30-act nightly show\" \"present the baritone singing of Norman himself, in addition to his emceeing chores\"", "\"A Mexican fiesta, including the spectacular 'Jarabe' or hat dance, is one of the outstanding features of the thirty-act shows at the Club Frontenac this week. Staged and produced by Karyl Norman and his male revue . . .\"", "\"The Club Frontenac this week offers another of the Karyl Nomran presentations which have kept this popular master of ceremonies on hand every night for 28 weeks. His summer revue is featuring the soprano singing of Nicki Gallucci and the comedy numbers of Don Wise, both of whom are well-known to Club Frontenac patrons.\"", "\"fourth season . . . 22-man show, according to Manager Vic Nestor\"", "\"the only show of its type now/surviving in this area. Unit utilizes 10 female impersonators, plus a line of six girls.\" (added as \"unnamed\" here)"], "Kenn King and His Hollywood Playboys": [], "Kilpatrick's Old Time Minstrels": [], "King Kong's Lair's Boys Will Be Girls Revue": [], "Knox and Mack": ["both white female impersonators; \"fooled everybody as to sex, but as far as art went, didn't FOOL anyone. Sartorially and artistically the boys were there. The playing of a violin and their dancing evoked undoubted approbation.\""], "Ladies by Request": ["Barrows is the producer of the unique revue, which is titled 'Ladies By Request.' It is a lovely fantasy which features six truly beautiful female impersonators whose professional names are Valda Gray, Carol Lee, Petite Swanson, Lady Doris, Bobbie Macklin and Dixie Lee. The 'chorus' actually rivals Gladys Bentley's Harlem crew in beauty.\""], "Lady of the Evening": [], "Lambs Gambol": [], "Lanny Brice and His Gay Boy Parade": [], "Latin Quarter Revue": [], "Latin Villa Revue": [], "Leon LaVerde and his Parade of Stars": [], "Leon and Eddie's unnamed revue": [], "Lessons in Swing": [], "Lloyd Woods and Boys Will Be Girls and Girls Will Be Boys Revue": ["\"Broadway's Greatest NIGHT CLUB Entertainers\"; \"Look!—FLASH—FLASH—FLASH\""], "Lloyd Woods and His International Playboys": ["\"The Greatest and Smartest Show of Its Kind in the East\"", "\"The Most Widely Publicized Troupe of Versatile Female Impersonators Ever Witnessed in Any Revue Outside of New York.\"; \"DANCERS—SINGERS—IMPERSONATORS\"; \"Magnificent Costumes...Dazzling Scenes\"; \"Special Lighting Effects\""], "Lucian's Playboy Review": ["\"Sheriff Malley ordered Michaels to stop the show after last Saturday on the ground that it was an 'affront to public decency.' The show has not been given since. Michael today gathered his forces in an effort to prevent closing of the show. He said that he was willing to have a committee of citizens view the show and that he would abide by their decision as to whether the production is indecent. 'If I let Sheriff Malley get away with this,' he said, 'I might as well close up my club, because everyone will think the show actually is indecent. There is absolutely nothing wrong with it.' Sheriff Maley [sic] clountered [sic] with 'I am the sole judge and jury in this matter and I've already made my decision. Monroe County will be much better off morally without the 'Playboys' and the show must go.' Malley warned Michaels that the review must stop or the club would be closed. Michael intimated today that he 'might start injunction proceedings' to stop the Sheriff from closing his place pending some sort of a hearing.\"", "\"Tonight will mark the end of the engagement of a troupe of female impersonators at the Chateau, Monroe Avenue and Winton Road, through order of Sheriff James E. Malley. The show, billed as 'Lucian's Playboy Review,\" was scored as \"an affront to public decency\" by the sheriff, who said he had received many complaints about the troupe. Malley has ordered Al Michaels, propritor [sic] of the Chateau, to end the show, on threat of closing the establishment.\"", "Lucian's name is inferred here.", "Lucian's name is inferred here; New show that will be named \"The Playboy Revue\" with a \"bunch of entertainers.\""], "Lyle Page's All Boy Revue": ["\"7 Beautiful Boys\" (added as \"unnamed\" here)", "\"Beautiful Boys—Scintillating, Gorgeous Gowns\" + \"Essence of Feminine Sophistication\"", "\"Don't Fail to See the Flower Parade and the Funny Hillbilly Finale\"", "\"Presenting a Beautiful Japanese Fantasy\"", "\"See the Beautiful Continental Dance By All the Boys\""], "Lynn Carter and the Four Cartiers": [], "Madison Square Garden's Drag": ["\"Mason ran the affair at Madison Square Garden last winter.\""], "Mae West's Catherine Was Great": [], "Mae West's Diamond Lil": [], "Mae West's Ladies by Request": [], "Mae West's Pleasure Man": [], "Mae West's Reputation": [], "Male Manikins on Parade": [], "Marty's Tavern's Playboy Revue": [], "Mask and Gown": [], "Masquerade": [], "Maxie Lengel and His Greenwich Village Fashion Boy Revue": ["Revue inferred from Times Union, July 22, 1935, 5"], "Maxie Lengel and His Playboy Revue": [], "Miami Torch Club's Playboy Revue": [], "Mickey Nelson's Sensational All Boy Revue": [], "Mickey Strauss and His Playboy Revue": [], "Mima": [], "Moon Madness": [], "New Look Club's Gay Boy Revue": ["\"The Fall Edition of the 'Gay Boy Revue' is now being presented by the New Look Club . . . headlines Billie Herraro, the Brazilian Gypsy Rose Lee, a sensational mimic of the female impersonator school, and Titanic, handsomest and tallest of the New York showboys. Others who appear...\"", "9th week"], "Nite Spot's All Star Revue": [], "Odd Fellows' Masquerade Ball": ["Attended by 7,000"], "Orchid and Scallion Revue": [], "Peppy Carman and His All-Boy Revue": [], "Perry and Company": [], "Phil Craig's Playboy Revue": [], "Pioneer Club's Fall Revue": [], "Playboy Revue of Female Impersonators (Spring Edition)": [], "Ramon Strobeck's Drag": [], "Ramon Strobeck's Drag Ball": ["\"A fiasco through rigid police regulations.\""], "Reversed Revue": ["\"ninth week at the Club Frontenac\"", "\"now in its eleventh week\""], "Revue of the Year": [], "Riverside Grille's Gay Boy Revue": [], "Riviera's Gay Boy Revue": [], "Romance in Rhythm": [], "Roni Warren's Gay Boy Revue": ["\"go into their fifth edition at the Club Paree\"", "\"third edition . . . opened for another 10 weeks at the Club Paree\""], "Sammy Grand's Playboy Revue": [], "Shangri-La's All Boy Revue": [], "Sisters of the Chorus": [], "Soni Sinclair's Playboy Revue": [], "Spinning Wheel's Playboy Revue": [], "Springtime Revels": ["Premiere tonight"], "Super Duper Revue": [], "Swingy Platinum Playboy Revue": [], "Ted Brown's All Star Revue": [], "Thanksgiving Ball": ["\"One of the rules that promoter Phil Black set for his Thanksgiving night female impersonator's ball at Harlem's Rockland Palace is that no contestants for the $500 grand prize weigh over 150 pounds or wear falsies that measure more than 42 inches around the bust.\""], "The Bandbox's Gay Boy Revue": [], "The Drag": [], "The Gay Boy Revue": ["\"8th BIG WEEK\"", "\"Exsensuating the unusual\"", "\"Male Mannequins in Female Fashion\"; \"Accentuating the Unusual\"", "\"Now 10th BIG WEEK!\" - \"3 Shows Nitely—9:30, 11:30, 1:30\"", "\"Three shows tonight\"", "\"Two Shows Every Night\"", "\"Two Shows Nightly\"", "\"will open . . . Friday\""], "The Gay Boy Revue (Boys Will Be Girls)": ["\"It's Gay—It's Unique—It's Sensational!\"; \"Grant Opening March 20\""], "The Glade's Boys Will Be Girls Revue": [], "The Glamorous Carroll Revue": [], "The Hollywood Playboy Revue": ["\"Featuring Female Impersonator\" in singular: \"Roar with mirth to the impersonation of Fanny Brice and Mae West of Harlem.\"", "\"Female Impersonators, Gorgeous Costumes, Songs, Dances, and Comedy\"", "\"the Hollywood Playboy Revue of Female Impersonators.\"; \"Also a Feminine Style Show by All the Lads.\"", "MC"], "The Tempters": [], "Unnamed All Boy Revue at Wonder Bar": ["\"A whirlwind presentation of glamorous glorious female impersonators. Clean, different, unique\"", "\"A whirlwind presentation, unique and novel.\""], "Unnamed revue": ["show is a direct fight against inflation and smaller shows, along with the fact that I am sincerely interested in keeping this art form (female impersonation) at a high level."], "Vera Walters and Her Playboy Revue": [], "Victory Revue": [], "Wine, Women and Song": [], "Wonder Bar's unnamed revue": ["\"Six female impersonators were arrested and charged with being fugitives from justice from Chicago and with disturbing the peace, following a police raid on the Wonder Bar, Monday (17). The were in the floor show.\"", "Potentially same artists as the ones who were at The Stables (St. Paul) on 1935-03-20?"], "World Famous Finocchio's All New Revue": [], "World's Famous Female Impersonator Revue": [], "Yacht Club's Boys Will Be Girls Revue": [], "Ziegfeld Follies": []}