{"": ["\"Court attendants, principals at the hearing and a handful of spectators were treated to a miniature floor show after the defense had started to present its case. A female impersonator, part of the Lighthouse Tavern floor show . . . took the stand and at the request of District Attorney H. F. Laub, on cross examination, recited the words of songs and told stories which the commonwealth contends are suggestive. The entertainers as well as waiters and bartenders and the priorietress, testifying for the defense denied in general the commonwealth's charges asserting that at no time was liquor sold after the regulation closing hours nor was liquor sold for consumption off the premises. Miss Johnson said the place was conducted 'cleanly, morally and actually.'\"", "\"Female Impersonator Direct from DANTE'S INFERNO\"", "\"The Torch Goes Gay\"", "\"dance trio\"", "Inferring that Lyle Mack was present since he was there on the 9th and the 22nd.", "One of the sepia female impersonators in that Fullerton street hot spot, who step faster than the chorines, boasts that she (he) has 72 gowns!"], "Adrian Ames": ["\"The Fabulous Male Impersonator . . . Hollywood's Glamorous Delineator of Song and Fashion\"", "From Club Richman", "The Birmingham News, October 4, 1925, 6 corroborates Lionel Mike Ames's name as Adrian Ames", "Variety, Sept. 10, 1930, 17, and \nSept. 24, 1930, 68 corroborates that Mike Ames = Adrian Ames", "Variety, Sept. 10, 1930, 17, and \rSept. 24, 1930, 68 corroborates that Mike Ames = Adrian Ames"], "Adrian Norris": ["\"Oriental Dancer\""], "Adrienne": [], "Agnes Roberts": ["exotic"], "Aimee Joye": [], "Al Benson": [], "Al De Lage": [], "Al DeMarco": ["\"Al De Marco and Ned Lynn, a swell ballroom team, are one of the highlights of the show.\"", "\"Another outstanding specialty is that of Jean Osborne and Al De Marco, who do a 'Blue Danube' waltz in the manner of a Ramon and Rosita.\"", "As part of DeMarco & Osborne", "Names corroborated by Billboard, December 28, 1935, 42", "Part of \"Osborne and de Marco\", \"female impersonators\""], "Al Garbell": [], "Al Lucas": ["\"Night Club Nightingale\""], "Al Ray": ["\"general master of ceremonies\"; unclear whether in drag?"], "Al St. Clair": [], "Al Sterling": ["MC; \"America's Newest Singing Sensation\""], "Alan Gray": [], "Albert Henry Cook": ["Stole jewels, pawned them for $1,200, \"and used the money to travel, finally hooking up with a carnival in which, with the aid of some artificial attachments, he starred as a can-can dancer. In Chicago, police said, he attended a fancy dress ball in an evening gown, first taking the precaution to hire a private detective for $30 plus expenses to protect him.\""], "Albert Hogue": [], "Alberta Vaughn": ["\"Exotic Personality Songs and Taps\"", "\"Exotic Personality\"", "\"former screen actress\"", "\"well known for her screen and stage work\"", "Exotic Personality"], "Alden Garrison": ["\"The glamorous boy, who for the past twelve years has been an entertainer in both colored and white clubs and hotels, and has won many cups, prizes and trophies as the best dressed female impersonator in the pansy balls of Baltimore, Atlantic City, and New York, died forgotten and practically alone.\"", "\"another female impersonator, of Washington, has won at least a score of prizes as the 'best dressed' at many of the pansy balls in Baltimore and Washington. He goes in for squirrel and mink wraps and all of the accompanying accessories which put him in line with the debutantes of the wealthy.\"; \"female impersonator, who makes some of the weaker sex take a back seat for dress.\"", "\"well known in night club circles in the east for the part he played as a female impersonator . . . buried last week\"", "Here described as \"dressed in a white fur-trimmed creation with a shoulder cape attached. His girlish-bobbed hair was slicked back, making his female impersonation almost perfect.\""], "Alfred Carmen": [], "Alice E. Murphy": [], "Alice Rydner": [], "Alice White": ["\"talented female impersonator, has surpassed 'her' previous record as a producer.\"", "Only called White here but Alice White is corroborated in The Chicago Defender 26 Aug 1939, 21."], "Allan Cook": [], "Allen Carl": ["Part of the group of \"World's Famous Female Impersonators\""], "Andrew Tribble": [], "Andy Cliff": ["\"impersonating Sally Rand\"", "\"impersonation of Sally Rand\""], "Anita James": [], "Anthony DiMeo": ["\"of 11th st. near Ontario\""], "Arica Wild": ["\"Female Impersonator — Popular Singer and Dancer Also FAN DANCER - ACROBATIC and TAP DANCER - SPECIALTY NUMBERS - SONGS and A BIG SHOW\"", "\"in a unique interpretation of the Carioca\"", "\"in a unique interpretation of the carioca\"", "Featured in \"an interpretation of the Carioca by Arica Wild\""], "Art Bernard": [], "Art West": ["\"That Incomparable Comedian\"", "\"pansy comic\" - does a fan dance in long underwear, together with Lena Rivers?"], "Arthur Budd": ["\"Frances Dunn and Arthur Budd are back at Torch Club, Police Commissioner Mulrooney giving them permission—but Jackie Maye hasn't gotten the official okay yet. It seems strange, but Broadway can't boast of one real hot stay-out-late spot where the crowd gathers.\"", "\"Over at the Club Calais there is also a new spring edition featuring Frances Faye's piano thumping and Jackie Maye's new spring gowns.\"", "\"affectionately called 'Rosebud,' does a Jean Malin\"", "\"master of ceremonies\"", "\"was recently entertainer at the defunct Place Without a Name\"", "Also known as Rosebud, according to 1930-09-20 Daily News, 22"], "Arthur G. West": ["\"All laughs for this trio of men rigged as Diamond Lils or dance hall dames of the 90's. Reeks with hokum, but needs nothing else. Offtime dancing of West in the opening trio number is very funny. Doran and Topsy and Eva satire by one West, with a bit more finish would be a new bon mot in vaude burlesque. Could safely omit diva imitation by other Doran, and ought to revise gags used by the Topsy and Eva pair. For strong finish in gaudy Rus sian with a ridiculous dance that panics costumes, and end their song em.\"", "\"Catching Doran, West and Doran for the third or fourth time since they showed at the Englewood strengthens the original impression that these three men who burlesque the female in Florodora costumery will go bigger in better spots.\"", "\"Doran, West and Doran, three med rigged as Diamond Lils (New Acts), were the standout of the evening in the next-to-closing spot, lifting the show away up.\"", "\"The three 'maidens' first come dashing out done up as beauties along the type of Floradora girls. Then two of them do a travesty upon the Margie of Savoy and Brennan. Then a corking red-headed impression of a prima donna going nuts. Then the smash hit of the act, their own impression of the Duncan Sisters. Their get-up, meaning their dresses, are screams, reminding one of an ocean wave. Here is artistry of burlesque done in rare style. Maybe you do not care for this type of broad female impersonations, but these men have real artistry back of all their non-sense. They handed me a terrible comedy wallop. They close their act with a burlesque, the Russian Bat theater. Good costumes and a fine idea is worked out by the three. Here is a female impersonation act that is different, and to me it is a wow. If you laugh along those lines you will have a grand time.\"; Name corroborated by Variety, Jul 23, 1930, 43", "\"Three female impersonators, with loud comedy hoke. Can make the grade on the rasy time, and with better words might improve. Act is 80% costumes. Sight laughs aplenty. But the chatter can never stand competition. Drum mer stuff overdone and better with out it. Follows with burlesque on prima donna; old stuff for the most part, but good enough. Impression of the Duncan Sisters not impres sive. middle. Act starts strong but sags in the middle.\"", "Name corroborated by Variety, Jul 23, 1930, 43"], "Arthur La Delle": ["\"Arthur La Delle uncovers a lot of new stuff this week in his varied juggling program\"", "\"Juggler\"", "One of the best magicians and jugglers every to appear in Reno . . . the big question mark. He does a daredevil fire-eating act that causes all the boys to immediately turn hungry."], "Arthur Verity": [], "Arthur Wilson": [], "Arvin Giese": ["\"Five hundred forty-nine pound Arvin Giese, 17, hula dancer and female impersonator, has taken a vacation from a wintering circus and is visiting his parents here. . . . 'I just want to be a real actor and not just a clown,' Arcin says as he shifts his bulk in his specially re-enforced chair.\""], "Au Sing": ["\"America's only Chinese female impersonator, will present his Saber dance at the opening tomorrow on the new edition of the 'Gay Boy Revue' . . . He was taught the dance by a pupil of Mui Lan Fong, venerated Chinese dancer. Mui Lan, now 75, lives in retirement in Peking where he achieved fame as a female impersonators in the traditional Chinese theater.\"", "\"Female impersonators, somewhat rare in the occidental theater, still are the vogue in the oriental theater, according to Au Sing, now headlining at the 'Gay Boy Revue' . . . Au, himself, was trained in the stylized traditions of the Chinese stage. The dances he presents at the New Look Club are, he says, authentic reproductions of Chinese choreography. The Sword Dance, which Au features, is one of the more popular Chinese dances.\"", "\"exotic\""], "Audri Ann": [], "Bab Garrison": ["From Washington DC; see Washington DC Evening Star, 1940-01-15 for the pconclusion that this is Bab Garrison"], "Babe Allen": ["\"Hot Cha\" boy from Chicago", "\"Torch Singer De Luxe\""], "Babe Baker": ["\"25 of the World's Foremost Female Impersonators\"; \"2nd big week\""], "Babe Gordon": [], "Baby Jan Ray": [], "Baby Scruggs": [], "Barbette": [], "Beale St. Boys": [], "Beatrice Howle": ["she's a \"fem impressionist\" i.e. a female-female drag queen"], "Bee Lockhart": ["\"beauty contest winner from Texas\""], "Bel Ager": ["\"torch singer\""], "Benny Pauly": [], "Bernice Hollenbeck": [], "Bernie Salin": [], "Bert Errol": ["In 1921, Bert Erroll shocked Chicago: \"Before making a change he bared one side of his body almost to the waist to show he really was a man. Spoiled his hit.\""], "Bert Kelley": [], "Bert Savoy": [], "Bert Sherry": ["At the venue for the past seven months", "For legal name, see See 1938-07-30 The Billboard, Jul 30, 1938, 67 [Bert Peaches Buckingham, Baltimore]", "Third year (!) as emsee."], "Bert Wheeler": [], "Bertie Bierman": ["\"veteran entertainer who has been playing feminine parts in this district for years and years\""], "Bessie Brennan": [], "Bette Newmon": ["\"Impersonations\""], "Betty Borgreve": ["from Earl Carroll's \"Vanities\" and George White's \"Scandals\""], "Betty Colton": ["likely a \"pretty girl\" in the ensemble"], "Betty Juhlien": ["\"Rending excellent support . . . comely singing waitresses.\""], "Betty Lee": ["Exotic charmer but no indication that she was a drag performer"], "Betty Munden": ["\"Pretty and Vivacious Soubrette\""], "Beulah Kennedy": [], "Bill Howard": [], "Bill Jones": [], "Bill Kennedy": [], "Bill Nealy": [], "Billie Berke": [], "Billie Beryl": ["\"A new and added attraction in the Broadway Scan-Dolls, now playing at The Oasis, is Billie Beryl, impersonator.\"", "\"America's Foremost Female Impersonator\"; \"The Double Voiced Soprano\"", "\"America's Foremost Female Impersonator\"; \"Third Sensational Week\"", "\"Baltimore's Most Beautiful Boy\"", "\"Fifth Sensational Week\"; \"America's Foremost Female Impersonator\"; \"Featuring His Impressions of SALLY RAND Doing a SENSATIONAL FAN DANCE\"", "\"added attraction\"; \"Billie Beryl, billed as 'The Jean Harlow of Burlesque'\"", "\"added attraction\"; \"pretty Billie Beryl billed as 'The Jean Harlow of Burlesque'\"", "\"will be at Dante's Inferno . . . indefinitely\""], "Billie Brannon": ["\"Characterizations\"", "\"Delineator of Feminine Types\"", "\"Gorgeous Singing Type\"", "\"Late Star of K-9 Club, Chicago\"", "\"Lovely Impersonator\"", "\"Outstanding Female Impersonator\"", "\"The Most Beautiful Boy in Women's Attire\"", "\"Winchell's Choice of Impersonators\"", "Together with Lena Rivers, \"Two of America's Outstanding Female Impersonators\""], "Billie Dale": ["\"Boy With Million Dollar Legs\""], "Billie Davis": ["\"company is headed by Billie Davis\"", "MC?", "Woman leader of this gang, \"'Diamond Lil' of Atlantic City\""], "Billie Dove": [], "Billie Gilbert": [], "Billie Kemp": ["\"singer of sophisticated songs\""], "Billie Marsh": ["Female Impersonator", "Female Impersonator, M.C.", "That Popular Female Impersonator, M. C. Direct from the Variety Club, Baltimore, Md."], "Billie McAllister": [], "Billie Richmond": [], "Billie Russell": [], "Billie Sinclair": [], "Billy": ["a female impersonator who kissed \"Tillman\" - \"however Smallwood (Clark Gable's ears) didn't mind, he went the limit.\")"], "Billy \"Senorita\" Herrera": ["\"\"BILLY HERRERA—The 'Gypsy Rose Lee' of Brazil\"", "\"4 GREAT Vaudeville Acts\" \"35 LOVELY GIRLS ON PARADE\" \"Billy Herrero—Female Impersonator\"", "\"Back Again The Popular Star BILLY HERRERA as Gypsy Rose Lee, Carmen Miranda, Dorothy Lamour\"", "\"Billed as the 'Brazilian Gypsy Rose Lee,' Billie Herrara is the current attraction at the Club Granada.\"", "\"Billie Herraro, the Brazilian Gypsy Rose Lee, headlining at the New Look Club, Newport, Ky., claims a famous teacher and a noted former dancing partner. His dancing teacher was Eduardo Cansino, father of the luscious Rita Hayworth, 'I remember Rita—or Marguerita as she is named—when she was a plump read-headed child in pigtails,' said Herraro. 'She drilled in our same class, but she also got long hours of individual instructions from her parents.' One of Bilie Herraro's first stage partners was the Spanish actress and dancer, Margo . . .\"", "\"Billy Herrero heads the show at the Top Hat Club with female impersonations and Latin songs and dances that reveal wide range.\"", "\"Billy Herrero who is making the town talk with his Gypsy Rose Lee number at the Five O'Clock, will be held over at that club.\"", "\"Brazilian Sensation\"", "\"Brazillian Gypsy Rose Lee, Senorita Herrero, has been signed to headline a new show opening Tuesday at Club 22. The senorita's unique act will top an all-Latin program . . .\"", "\"Cuban Bombshell\"", "\"DON'T MISS Herrero—'The Brazilian Gypsy Rose Lee'—ENTERTAINING—SENSATIONAL—SURPRISING—We think this act is tops—and you will too. Don't say we didn't tell you.\"", "\"EXTRA ADDED ATTRACTION\"", "\"Featured in the stage presentation [in this vaudeville presentation] will be Billy Herrero, who impersonates such female personalities as Gypsy Rose Lee, Carmen Miranda and others.\"", "\"Floor Show With An All Star\" \"BILLY HERRERO—Your chance to see a great artist. Feminine Impersonator without present day equal. Carbon copy of Gypsy Rose Lee, Hedy Lamarr, Carmen Miranda. Kick yourself if you miss it.\"", "\"HERRERO—'The Brazilian Gypsy Rose Lee' offers this week Pulsating Latin Rhythms a la CARMEN MIRANDA\"", "\"He's Packin' Them In! You Should See This Unique Personality.\"", "\"He's well known for impressions of stage, screen and radio notables.\"", "\"Latin America's Glamorous Exponent\"; \"Subtle Sinuous Symbolic\"", "\"OPENING TONITE BILLY HERRERO The Brazilian Sensation\"", "\"Opening Saturday For One Week Only — That Continental Sensation — BILLY HERRERO\" \"The greatest of all FEMALE IMPERSONATORS. You'll marvel at him. Your one and only chance to see this clever artist at the REDWOOD CLUB.\"", "\"Presenting the Brazilian 'Gypsy Rose Lee' BILLY HERRERA Famed Latin Impression Star\"", "\"SMALL WONDER that Billy inspired Life and Look magazine features!\" \"You'd swear you're applauding Gypsy Rose Lee, Hedy LaMarr, Carmen Miranda. And you'll see a finale to startle you out of your seat (mum! if you've seen the show; don't spoil the fun for others.)\"", "\"See the most exciting personality you ever saw! BILLY HERRERO — Vivid Latin impressions. Spitfire of Carman Miranda, piquancy of Hedy laMarr, bombshell of emotion. The rumba, samba, conga like you've never seen before. And the finale, one that marks an artist—well, to be astonished you must see for yourself!\"", "\"Sensational Impersonations Gipsy Rose Lee and Carmen Miranda\"", "\"Sensational Impersonations\"", "\"South American Bombshell\"", "\"THEY WILL NOT LET ME GO SAYS: BILLY HERRERO So This Is Positively His Last Appearance in Salinas\" \"DON'T FAIL TO SEE THIS CLEVER ARTIST\"", "\"TONITE... SURPRISE ??????? with BILLY HERRERA imp ????\"", "\"The Latin American Sensation\"", "\"The South American Bombshell\"", "\"The main attraction, Billy Herrero's impersonations of women, fails to register and Billy leaves the stage with the audience clinging to the impression that he really is a 'she.' His act is slow, and while he is dressed in much the manner Carmen Miranda would garb herself, his voice doesn't sound at all like the popular move actress.\"", "\"The new 'Gay Boy Revue' [edition] will headline Billie Herraro, whoo calls himself the Brazilian Gypsy Rose Lee.\"", "\"Your best friend won't tell you ALL about BILLY HERRERA — Impressionist\" \"The MOST UNUSUAL ACT TO VISIT THE PALM BEACHES\"", "\"being held over another week\"", "\"billed . . . as the 'Brazilian Gypsy Rose Lee,' is rated the best imitator of the Gypsy of any sex. Overcoming language difficulties, Herraro satirizes her singing style and mimics perfectly her diffident strip technique. His makeup as a woman is deceiving even in the intimate confines of the night club. He headlines the Gay Boy Revue now in its 10th week.\"", "\"billed as the 'Brazilian Gypsy Rose Lee.'\"", "\"explosive native dances and Spanish-English songs of Billy Herrero. Herrero, with his colorful Latin costumes, was signed by Norman for the Detroit unit of his male shows, after a trip made to Santiago, Chile, for that specific purpose.\"", "\"left the Ha-Ha Club recently [together with Hot-Cha Hinton]\"", "\"master of ceremony . . . introduces the star of the show, Billy Herrero, the South American bombshell, who surprises patrons with his act of Latin songs and dances.\"", "\"one of the most unique acts to play this section this season, Billie Hererro, the 'Brazilian Gypsy Rose Lee.'\"", "\"opens . . . tomorrow night\"", "\"rated the best imitator of the Gypsy of any sex. Overcoming language difficulties, Herraro satirizes her singing style and mimics perfectly her diffident strip technique. His makeup as a woman is deceiving even in the intimate confines of the night club. He headlines the Gay Boy Revue, now in its 10th week. The Lyndall Dancers, genuine feminine precision dancers will be added to the show beginning Monday, Labor Day. Other acts include...\"; see also https://handeaux.tumblr.com/post/631310750800117760/the-true-story-of-ucs-male-homecoming-queen?is_related_post=1", "\"sensational mimic of the female impersonator school\"", "\"the finale stars the Spanish-English singing star of the club, Billy Herrero. The Li-Kar costume worn by Herrero during the elaborate spectacle is typical of the era which saw the origination of the hat dance, and, according to the Hollywood designer, it is completely authentic.\"", "Billed as \"Senorita Herrero\"", "Billed only as \"BRAZILIAN GYPSY ROSE LEE\"", "Billed only as \"Senorita HERRERA—Brazilian Gypsy Rose Lee\"", "Billed only as \"Senorita HERRERA—The Brazilian Gypsy Rose Lee\" \"BREEZY—TEEZY—SENSATIONAL\" \"BREATHTAKING .... DARING\"", "Image is \"Captivating looker\"", "Part of the floor show.", "Review of the performance; lots of descriptions of Herrera's acts here", "Senorita Herraro: Brazilian Gypsy Rose Lee", "headlining as \"Brazilian Gypsy Rose Lee\"", "only \"HERRERO—The Brazilian Gypsy Rose Lee\"", "only \"HERRERO—The Brazilian Gypsy Rose Lee\" Adding \"DON't MISS THIS SENSATIONAL SURPRISE ACT—?—You've Seen Gypsy—Now See 'Herrero'\""], "Billy Ardelle": [], "Billy Brill": ["\"One and Only Man With Three Voices—Outstanding Female Impersonator in the U. S. A.\"", "\"One and Only Man With Three Voices—Outstanding Female Impersonator in the U.S.A.\"", "\"Outstanding Female Impersonator in the Country\"", "\"Outstanding Singer\"", "\"The boy with the one and only triple voice in America\"", "\"female impersonator and triple-voiced singer\"", "\"female impersonator\"", "\"semiclassical songs give him an opportunity to sing in three voices\"", "\"sings ballads of the past\"", "\"sings in different voices\"", "\"songster\"", "\"triple voice songster in the Black & White Fantasy\"", "\"triple voiced songster\"", "\"triple-voice singer\"", "\"triple-voice, in his impersonations of a Southern mammy\"", "\"triple-voiced singer\""], "Billy Byrne": ["Could this be Billie Beryl?"], "Billy Daye": [], "Billy Earle": [], "Billy Hayes": ["\"Prima Donna\"", "\"male soprano\"", "\"male soprano\"; \"Direct from six months in Cincinnati . . .\"; actually unnamed here, but see 1938-07-17", "\"male soprano\"; \"featured\"", "\"male soprano, described as the boy with a million dollar voice\"", "\"soprano\"", "prima donna"], "Billy Irwin": ["\"male Libby Holman\"", "Not sure whether they were part of the Gay Boy Revue?"], "Billy Joy": ["\"Humor by Billy Joy\"", "comedian", "comedian and \"monolog specialist\""], "Billy Kamp": ["\"of New York, one of the country's best skilled female impersonators, is to join the 'Gay Boy Revue' Friday night . . .\"", "\"singer of sophisticated songs\""], "Billy Kent": ["\"Narrator of Nonsense\"", "MC"], "Billy Lamont": ["\"Comedy Female Impressionist\""], "Billy Lynn": [], "Billy Monti": ["\"Baby beautiful\""], "Billy Nichols": [], "Billy O'Brien": ["\"Inimitable Comic\""], "Billy Pinnell": [], "Billy Reed": [], "Billy Richards": ["\"Billy Richards the gay guy, from Hollywood, a graduate of Northwestern University of Chicago, who designs and makes his own gowns used in the entertainment. He played at Bal Tavern, San Francisco, as a singer for 27 weeks before joining the troup to fulfil [sic] the contract here.\"", "\"billed as 'the second Julian Eltinge' is starred\"", "\"dance principal\"", "\"doffs the clothes and dons the feathery fans this week in the floor revue\"", "\"held over for another week by popular demand\"", "\"starring\"", "Emsee", "Female impersonators", "Outstanding attraction this week . . . doffs the clothes and dons the fans, feathers etc. in presenting the dan dance. Billy is now the only fem impersonator left on the Hoffman House show menu.) + picture", "Together with Francis Blair, \"are ranked as America's two foremost female impersonators. They will amaze, amuse and astound you.\"", "Together with Gene Dana, \"Female impersonators\"", "in Lady of the Fans"], "Billy Rohmer": ["Opener for women's wrestling match!"], "Billy Rosser": [], "Billy Turner": [], "Billy West": [], "Blackie Dennis": [], "Bob Lake": [], "Bob Mack": ["MC"], "Bob Smith": [], "Bobbie Baker": [], "Bobbie Bell": ["\"Bell does an interpretation of a Siamese dance of the era before it became Thai and began militarizing.\"", "\"Character Dancer\"", "\"Dances\"", "\"Exotic Dancer\"", "\"Karyl Norman's All-Male Revue is completing its 30th week at the Club Frontenac, Bowery-type night spot. Four among the veterans, Del Le Roy, Francis David, Gene LaMonte and Bobby Bell, continue.\"", "\"Song Stylist Extraordinary\"", "\"[At Dante's Inferno] Direct from 'K-9 Club', Chicago\"", "\"dance duo [with Francis David]\"", "\"own dance designs\"", "\"premeiere [sic] danseuse\"", "\"premier danseuse\""], "Bobbie Blue": ["\"Pretty and Vivacious Soubrette\""], "Bobbie Chapman": [], "Bobbie Clark": [], "Bobbie Davis": ["\"starring in renditions of up-to-date hit songs, is a songstress worthy of commendation.\"", "Bobbie Davis described as a girl with a \"pleasuing personality\" and \"nimble feet.\"", "Called a \"creole 'songbird',\" using scare quotes, perhaps to point out her queerness."], "Bobbie Grant": ["\"well known female impersonator, best known as the 'Creole Fashion Plate.'\""], "Bobbie Kaye": ["\"Pretty and Vivacious Soubrette\"", "dancer, \"whose dances are in the American manner\""], "Bobbie La Marr": ["\"recently concluded a 10-month engagement at the Ha-Ha Club [with Gene Ford]\"", "\"whose makeup would fool most anybody\"", "Third prize winner at the ball", "identified themselves as Bobbie La Mar in court"], "Bobbie Macklin": [], "Bobbie Marlowe": ["\"The Blonde Venus\""], "Bobbie Ray": [], "Bobbie Rowland": [], "Bobby Allen": ["\"Dance of Death\"", "\"Oriental\"", "\"Premiere Danscanse\"", "\"The Tragedian of Dance\"", "\"The Tragedienne of Dance\"", "\"as Funny Fanny Brice\"", "\"character dancer\"", "Not sure whether they were part of the Gay Boy Revue?", "character dancer; \"Billy Allen\" but guessing that this is the same Bobby Allen that appeared two weeks later.", "premier danseuse"], "Bobby Anderson": ["\"Understudy to the late Jean Malin\""], "Bobby Bell": ["\"Exotic Dancer\""], "Bobby Brennan": ["\"Sophisticated Singer\"", "\"Sophisticated Songster\"", "\"guides the show suavely\"", "\"master of ceremonies\"", "\"master of the ceremonies\"", "MC", "Name inferred from Times Union, July 23, 1935, 15"], "Bobby Brown": [], "Bobby Cummins": ["\"Singer Extraordinary\""], "Bobby D'Castro": [], "Bobby Dean": [], "Bobby Dell": ["\"Starred for 2 Years in New York's Famed Club Richman\"", "\"That Exotic Sophisticate of Risque Song\"", "\"your favorite sophisticated songster\"", "Unclear if it's really Robert Dell. Wounded in leg following a shot to the stomach at a stickup", "singing waiter \"who entertain with female impersonations in addition to their other duties\" arrested and fined \"on charges of selling liquor, but none of the five was able to produce the money and all went to Mineola jail\""], "Bobby Ferguson": ["\"14th week of a return engagement\"", "\"Dances\"", "\"dancer\"", "\"own dance designs\""], "Bobby Gay": [], "Bobby Gordon": [], "Bobby Grant": ["\"sepia femme impersonator will go in . . . in the spot's next revue\""], "Bobby Hayes": ["\"A Dancing Doll\"", "\"Dresden Dancing Doll\"", "\"Featured in His Dance Interpretations\""], "Bobby Johnson": ["\"dancer\"", "\"sensational toe-dancer now in his third week in Karyl Norman's male revue . . . featured to accompany the starred songs of Spanish-singing Billy Herrero.\" \"One of Johnson's outstanding numbers is a swing version of the ever-popular 'Song of India,' done with the clinking finger-cymbals so typical of this British protectorate of the Orient.\"", "Not 100% it is the same Bobby Johnson as the other one in the dataset. \"Nut Club's Captivating Ingenue and M.C.\""], "Bobby Jones": [], "Bobby Kork": ["\"World's Premier Female Impersonator, introducing\""], "Bobby La Rue": ["\"'male prima donna'\"", "\"Bobbe [sic] LaRue has been at the Ballyhoo . . . for the past 12 weeks. Show includes . . .\"", "\"in his sixth month at Frolic Inn, Hollywood.\"", "\"the Fashion Plate of Hollywood\", MC"], "Bobby Lane": [], "Bobby Leonard": ["\"Sensation from New Orleans\"; \"Master of Ceremonies\""], "Bobby Mason": [], "Bobby McNeer": [], "Bobby Mitchell": ["\"Master of Ceremonies (World-Famous Impersonator)\""], "Bobby Morris": [], "Bobby Norman": ["\"See Bobby Norman's Carioca\"", "\"That Talented Boy with the Million Dollar Legs In the Famous Continental and Carioca\"", "\"The Boy With the Million-Dollar Legs\" — \"in the Continental\"", "Bobby Norman is the only Norman who is near Syracuse at this time. Jack Norman might be their real name, like Jack LaMarr is Jacquette La Marr...", "Carioca Dancer", "Named inferred from Warren Times Mirror, June 12, 1935, 2"], "Bobby Roberts": [], "Bobby Royce": [], "Bobby Stevens": ["MC"], "Bobby Sullivan": ["MC"], "Bobby Trent": [], "Bobby Verrill": ["\"The Male [Harriet] Hoctor\""], "Bobby Young": [], "Bohannan": [], "Bonnie": [], "Bonnie Clark": ["\"one of the greatest female impersonators is now with WPA's 'Living Newspaper' at the Biltmore\""], "Bonnie Lee": [], "Boots Lavana": ["\"Baltimore's man of much sex appeal, prides himself on the fact that he designs his own gowns. Female patrons crowd the Lenox Club where he holds forth as much to see his creations as to enjoy the show and the drinks.\"", "\"Rhythm With His Toes\"", "\"The little dancer is a howling success, and I know you will love\"", "\"that female impersonator from the Vendome in Buffalo\"; \"a head of long raven tresses beautifully marcelled.\""], "Bothwell Browne": ["\"Dancing Diana\""], "Brannan Fernandez": [], "Brooks Twins": ["Definitely not in drag"], "Bucky Buckworth": [], "Bud Byron": [], "Bud Hart": [], "Buddy Mayo": [], "Buddy Rokahr": [], "Bunny": [], "Bunny Bates": [], "Bunny Daye": ["\"The Body in a Million\""], "Bunny Dorne": [], "Bunny Thomas": [], "Buster Brant": [], "Buster Hewitt": [], "Candace": [], "Candy Cain": [], "Cardie Woodie": ["\"Cardie Woodie and His Orchestra\""], "Carey Davis": [], "Carl Clewis": ["\"Current show includes\"", "Part of the group of \"World's Famous Female Impersonators\""], "Carl Nixon": ["blackface female impersonation"], "Carll Morgan": ["\"prima donna\""], "Carlo Levins": ["\"Control Dancer\""], "Carlos J. Henderson": ["Washington DC-based"], "Carmen Del Carmen": [], "Carmencita": ["\"Carmencita and Harry Fink, featured dancers\"", "\"specialty dancers\""], "Carol Lee": [], "Carol Mack": ["Coming to Dante's Inferno from Club Richman"], "Carole Le Claire": [], "Carrol Thomas": [], "Carroll": [], "Carroll Davis": ["\"Introducing our New Master of Ceremonies\""], "Carroll Wallace": [], "Cary Davis": [], "Cecil Mason": [], "Ceylon": [], "Champagne": [], "Charles Alexander": ["\"female impersonator\" in \"a new floor show\"", "\"has dropped his red wig and is regaling the ringsiders with a Katharine [sic] Hepburn take-off.\""], "Charles Ander": [], "Charles Bell": [], "Charles Busch": [], "Charles Davis": [], "Charles Hooven": [], "Charles Moore": [], "Charles Pierce": [], "Charles Wilhelm": ["\"His name may be recalled by vaudeville patrons of a score and more years ago. The 76-year-old man once trod the boards as a female impersonator and his name appeared in lights outside the theatres. His body, clad in one of the costumes he wore at the height of his career, was found this morning lying face downward on his bed. Beneath his nostrils was a wad of cotton soaked with chloroform.\" \"Wilhelm was dressed in silken underwear, silk stockings, white, hiehg-heeled pumps and on his head was a blond wig. It was the one costume he cherished.\" \"police opined it was not poverty, but loneliness that caused him to put on his costume and play his last role in life.\""], "Charley Anderson": [], "Charley Brugnone": ["\"working these nights at Ye Old Town Hall in the Fairgrounds Hotel... One of the few impersonators who can get a laugh from the masculine gender.\""], "Charlie Neid": [], "Cherie O'Dea": ["Miami's May West"], "Chick Chandler": ["taking off on a burlesque stripper"], "Chicki Forrest": [], "Chickie Charms": ["\"Blonde Venus\"", "\"Torch Singer\""], "Chickie Mears": [], "Chris Ames": [], "Chris Bailey": ["\"Sophisticated Chatter Box\""], "Christopher Bridgeman": [], "Chubby Smith": ["\"Soubrette Singer\""], "Chuck Marvin": [], "Chunga Ochoa": [], "Clair Carlisle": [], "Claire Ray": ["Claire Ray (not in drag) is added here as an example of the fact that Richman had what could be considered a \"fancier\" version of striptease, that is \"posing in the nude.\""], "Clara Bow": ["\"sepia female impersonator\"", "(The male) Clara Bow"], "Clare St. Clair": ["\"The Personality Boy\""], "Clarence Long": [], "Clarence Spicer": [], "Clarence Thomas": [], "Clarence Weems": ["\"[show is] emceed by Mr. Clarence Weems (who is making his seventh year stand at Joe's [sic] . . .\""], "Clarenz Henderson": ["\"Leroy McDonald, proprietor of the 1-0-1 Club, is peeved at a local (out of town) paper for what it had to say concerning the late Clarenz who has an em-cee at the Harlem 'hot' spot. CLarenz . . . according to McDonald, did not leave any mash notes addressed to anyone before jumping.\""], "Claudetener": [], "Cleo Renee": ["\"Male Prima Donna\"", "\"Prima Donna\"", "\"singer\""], "Cleo Stafford": [], "Cliff LaVerne": [], "Clifford Bell": [], "Cliftonn Argue": [], "Clinton De Forrest": ["Dead"], "Connie": [], "Connie Miller": ["Part of the group of \"World's Famous Female Impersonators\""], "Connie Walsh": ["\"6 ft. 3 of Mirth in 'I'd Rather Be Spanish Than Mannish\"", "\"6 ft. 3 of Mirth\"", "\"Six Foot Three' of Mirth\"", "\"You'll Scream!\""], "Conrad Fitzgerald": [], "Constance Bennett": [], "Craig Russell": [], "Crystal Lane": [], "Daisey Dee": [], "Daisy Devoe": [], "Daisy Navarro": ["\"stopping the show with his version of the famous fan dance. . . . The gal is wow-ing the bunch—trousers, cocktail jacket, 'n' everything.\""], "Dale Roberts": [], "Dan Carson": ["manager"], "Danny Brown": ["\"returns this week as master of ceremonies after being absent the last two weeks due to illness.\"", "MC", "MC?"], "Danny King": ["Not sure whether they were part of the Gay Boy Revue?"], "Danny Lee": ["\"Danny Lee, a Louisiana boy, who was graduated from Loyola University in New Orleans, and is a dancer of note, having danced in bigtime at the Ha-Ha! Club in Florida, has an enviable record as an entertainer of note. He is teamed with this group and is one of the stellar performers.\""], "Darryl? Gilbert?": ["\"Sophistocrats of the Dance\" Not sure whether they were part of the revue?", "Not sure whether they were part of the revue?"], "Dave Davis": ["\"The Male 'Gypsy Rose Lee'\""], "Dave Gold": [], "Dave Rafael": ["\"will be in charge\""], "Dave Shaw": ["Legal name written as \"Dave Shaw\""], "David J. Doyle": ["Legal name written as \"David Doyle\""], "Davy Lee": ["\"The Male Ann Pennington\""], "Dawn Sis": [], "Day Sherry": [], "Deanna Durbin": [], "Dee Liddell": ["the female impersonator whose En Chante\twhatever that is) heads the floor show at Eddie Peyton's, bills himself as 'Dee Liddell'—hoping to keep the customers guessing until the finale.)"], "Del Dreer": [], "Del Le Roy": ["\"30th straight week at the Frontenac\"", "\"A Ziegfeld Follies favorite—\"You Stepped Out of a Dream\"—in the sultry voice of Del LeRoy, is one of the outstanding numbers done by this star of three seasons in Karyl Norman's male revue at the Club Frontenac . . . LeRoy also sing 'Memory of a Rose.'\"", "\"Del LeRoy joins Bell in doing a modernized version of Tschaikowsky's 'First Piano Concerto'—much better known now as the 'Piano Concerto in B-Flat Minor.'\"", "\"His Final Week\"", "\"Karyl Norman's All-Male Revue is completing its 30th week at the Club Frontenac, Bowery-type night spot. Four among the veterans, Del Le Roy, Francis David, Gene LaMonte and Bobby Bell, continue.\"", "\"Southern Aristocrat of the Dance\"", "\"a character singer and dancer\"", "\"offers popular songs\"", "\"returns after a sprained ankle\"", "\"torch singer and tap dancer\"", "identified themselves as Del Le Roy in court?", "unclear who was in drag or not here"], "Del Raye": [], "Dell Day": [], "Delores Del Rio": [], "Delorice De'Fren": ["Glorios Fan Dance - unclear if in drag"], "Dennis Griffin": ["MC"], "Dick Buckley": [], "Dick Hastings": [], "Dick Lane": [], "Dick Ricardo": [], "Dickie Ray": ["Named inferred from Warren Times Mirror, June 12, 1935, 2"], "Dimples": [], "Dixie Day": [], "Dixie DeLane": ["\"The female impersonators yesterday received another setback in their efforts to produce art for art's sake in Camden county drinking spots. The Haddon township police ordered a Black Horse pike cafe to cancel the act of 'Dixie' Delane, an impersonator who, police said, performed a suggestive fan dance. Consulting Prosecutor Samuel P. Orlando on permitting the fan dancing to continue, Polce Chief William Snyder, of Haddon township, was ordered to stop the show at once and arrest the cafe proprietor if he attempted to continue the dance.\""], "Dixie Dixon": ["\"in his second week at the Club Paddock\"", "\"the Beautiful Blonde Venus\"", "MC"], "Dixie Jean": ["\"one of Chicago's leading female impersonators\""], "Dixie Lee": ["\"Singing M. C.\"", "\"sings the songs that make you swoon\""], "Dodi Daniels": [], "Dolly Levins": [], "Dolly O'Day": [], "Dom Tangee": [], "Don Holly": ["\"has been here [at Piccadilly Club] 13 months\""], "Don Kenyard": ["\"Comedian\"", "\"Female Impersonator\""], "Don La Rue": [], "Don Niles": ["MC", "can fool the most skeptic of guests"], "Don Rand": ["\"Aristocrat of Dance\"", "\"Sensational Toe Dancer\"", "\"Singer Extraordinary\"", "\"Vaudeville's Capital Comedian\"", "\"lanky singer\" and comedian", "\"new comedy numbers\"", "Same as Don Rand?", "comedian", "credited as \"Comedy Sensation\"", "unclear who was in drag or not here"], "Donald Grey": ["\"Current show includes\"", "\"Deluxe impersonations of the fair sex\""], "Donna Glover": [], "Donnie Dawn": ["\"Exotic Dancer\""], "Dora Jar": [], "Doris": [], "Doris (Dimples) White": [], "Doris Lorraine": ["Glorious Blues Singer - unclear if in drag"], "Doris White": [], "Dorothy Page": [], "Dottie Johns": [], "Douglas Byng": ["\"At any rate, he'll attract trade, especially from the pencilled eyebrow set.\""], "Doyle Mack": ["\"Comedian\"", "\"[At Dante's Inferno] Direct from 'K-9 Club', Chicago\""], "E. Russell": ["\"Female Impersonator — Popular Singer and Dancer\"", "Legal name, see Drag 3, no. 12, p. 22"], "E. Walter": [], "Earl Partello": [], "Ed-Na Link": [], "Eddie Adams": [], "Eddie Crawford": ["\"Kitty of the 27th Division\"", "Legal name is written here as \"Edward Crawford\""], "Eddie Cushenberry": [], "Eddie Doyle": [], "Eddie Green": ["Washington DC-based"], "Eddie Guertin": [], "Eddie La Rue": ["\"emseeing the revue of 'gentlemen under their skirts,' is also a female impersonator and adds considerable to these Eltinges of Today with a torch number. Particularly engaging too is his monolog. With special permission of Dwight Fiske, he offers several Fiske numbers. Folks liked his 'two girls going for an auto ride.'\""], "Eddie Lee": ["Legal name written as \"Edye Lee\"", "MC"], "Eddie Morton": ["credited as \"Torch Singer\""], "Eddie Rogers": [], "Eddie White": [], "Edith Anderson": [], "Edmund Link": [], "Edna Leonard": [], "Edward Albert Crawford": [], "Edward Allworth": [], "Edward Collins": [], "Edward Delange": [], "Edward F. Dolan": [], "Edward Lerner": ["\"being held on charges of indecent exposure. Both [George Kaye and Edward Lerner] appeared as female impersonators in fan dances, police say.\""], "Edythe Bantos": [], "El-Kay": [], "Eli Madlof": ["\"bills himself as The Mad Russian, is beginning his fourth consecutive year this week as emsee at this spot, one of the brightest of the many of 12th street.\"; \"the whole show is Madlof, snappily attired and fast-talking emsee, whose style has brought him a large following at this location during the 156 straight weeks he has been in charge of programs.\"", "MC"], "Elsie Day": [], "Elsie the Cobra Woman": [], "Elton Paris": [], "Enna Davison": [], "Ernest Davidson": [], "Estelle Thomas": [], "Etailook Hoy": [], "Eugene Ebol": ["serious condition following a shot to the stomach at a stickup"], "Eva Marie Saint": [], "Eve Lynn": [], "Evelyn West": ["Not sure whether they were part of the Gay Boy Revue?"], "Farfariello": [], "Fay Elliot": [], "Fay Norman": [], "Ferne Proctor": ["\"Special Added Attraction\" unclear if in drag"], "Fifi": [], "Fifi Darling": [], "Flo Arden": ["\"Sandusky's Kate Smith\""], "Floradora Sextette": ["\"It's a Scream\""], "Florence King": [], "Florence Marcus": [], "Florence Sanger": ["Karyl Norman is \"assisted by\""], "Floyd Savage": ["\"maintained he was on his way to a Halloween party\" when he got arrested, five days in jail."], "Frances": ["fan dancer direct from World's Fair Chicago"], "Frances David": ["\"Dances\"", "\"Karyl Norman's All-Male Revue is completing its 30th week at the Club Frontenac, Bowery-type night spot. Four among the veterans, Del Le Roy, Francis David, Gene LaMonte and Bobby Bell, continue.\"", "\"dance duo [with Bobby Bell]\"", "\"exotic dancer\"", "\"own dance designs\"", "MC"], "Frances Dee": ["\"that classy female impersonator . . . formerly a feature with Valda Grey's Cabin Inn revue.\""], "Frances Dunn": ["\"Frances Dunn and Arthur Budd are back at Torch Club, Police Commissioner Mulrooney giving them permission—but Jackie Maye hasn't gotten the official okay yet. It seems strange, but Broadway can't boast of one real hot stay-out-late spot where the crowd gathers.\"", "\"When the cops ordered the pansies' names to be taken out of the Torch Club electric sign, Francis Dunn soliloquized: 'Yesterday I had a job, tonight a fuse blows out and I'm a bum again'\"", "\"female impersonator\"", "Incorrect date, but they worked together earlier: \"Francis Dunn, who calls himself Helen Morgan, Jr., through the impersonation he did while appearing with Mallin [sic] at the Club Abbey.\"", "Third place: $25"], "Frances Fay": ["\"Over at the Club Calais there is also a new spring edition featuring Frances Faye's piano thumping and Jackie Maye's new spring gowns.\"", "\"not hard on the eyes, thumps a hot piano\""], "Frances Hall": [], "Frances La Verne": ["\"Exotic Dancer\"", "\"toe dancer\""], "Frances Lee": ["Male Jean Harlow and M. C.", "Not sure whether they were part of the Gay Boy Revue?"], "Francis Blair": ["\"America's foremost female impersonator\"", "\"Blair came to Stockton from six months at the Culyer Club in Hollywood\"", "\"The first female impersonator to visit Stockton in many moons opened a sprightly act this weekend . . . billed as 'America's foremore,' was added to the regular Venice show last night. 'Miss' Blair came to Stockton from six months at the Culyer Club in Hollywood. Other coast engagements included nine months in Seattle's Spinning Wheel and a year at the Nut Club in San Francisco. Blair has appeared on the Orpheum and Fanchon-Marco circuits and is under management of Arthur Butler, owner of Silver King, dog movie star.\"", "\"World Famous Female Impersonator\"", "\"bouncing ball routine\"", "Called \"Francis (Whoops!) Blair.\" Together with Billie Richards, \"are ranked as America's two foremost female impersonators. They will amaze, amuse and astound you.\"", "Earlier (before 1936), \"a year at the Nut Club in San Francisco\"", "Earlier (before 1936), \"appeared on the Orpheum and Fanchon-Marco circuits\"", "Earlier (before 1936), \"coast engagements included nine months in Seattle's Spinning Wheel\""], "Francis Bond": [], "Francis Bouche": ["\"Blues Singer\""], "Francis Davis": [], "Francis Logan": ["Dancer and Singer - unclear if in drag"], "Francis Loite": [], "Francis Lucas": [], "Francis Parker": [], "Francis Renault": ["\"'The Slave of Fashion'\"; \"The International Star\"", "\"A Slave of Fashion\"", "\"A display of fashions designed to thrill the heart and dazzle the eye of every woman is worn by Francis Renault, internationally known star in his stage presentation at the LYRIC this week.\"", "\"A triple headline stage show embracing such sterling vaudeville artists as Francis Renault, ...\"; \"Francis Renault gives the stage show as an act a glittering fashion show, for the well known impersonator wears one beautiful costume after another, all of which are said to represent in money approximately $50,000. Promenading and posing are not the only features of the entertaining routine. Renault sings and dances too and through all of his work there is a bright beam of fun.\"", "\"Accompanied by a $20,000 wardrobe, Francis Renault, star female impersonator, now is appearing at the Palais Royal, a mile east of Benton Harbor on Territorial road. Renault, a Keith circuit vaudeville headliner, said to be the highest paid night club entertainer, comes here today from the State Lake theater in Chicago. He has appeared before many of the notables of Europe.\"", "\"An impersonation of the queen of Rumania on her recent American visit is the highlight of the performance of Francis Renault, who headlines the bill at the Pantages this week. Renault is one of the best known of the present day female impersonators. He also appears as Madame Butterfly.\"", "\"FRANCIS RENAULT WILL DISPLAY HIS $50,000 WARDROBE. LADIES, DON'T MISS IT!\"", "\"Francis Renault who calls himself 'A Slave to Fashion,' will display his $50,000 worth of finery and offer his bits of character acting.\"", "\"Francis Renault, 'The Slave of Fashion' with a wardrobe representing $50,000 expenditure for gorgeous clothes tops the stage entertainment at the Hollywood. Renault is a clever entertainer whose sartorial splendor is made a fitting complement to his act.\"", "\"Francis Renault, female impersonator, shares the spotlight in his humorous skit, in which are seen a number of lavish costumes.\"", "\"Francis Renault, international star, presents 'Slaves of Fashion,' . . .\"", "\"GOWNS representing expenditure of more than $4,000 within the last year, are worn by Francis Renault, vaudeville's foremost impersonator of women characters, headlining the Pantages vaudeville program this week. Each gown and head dress worn in the act is the creation of Renault himself, and his entire wardrobe is valued at more than $25,000. Unlike many impersonators of female performers, Renault does not depend upon his attire to carry him over. True, he wears gowns and headdress creations equal of which are seldom seen upon a vaudeville stage, but it is ability to sing in a soprano voice, his ability to pitch his voice into an effeminite [sic] key, and his grace of figure and carriage which combine to score his stage triumphs.\"", "\"Getting back to the stage show and its headliner, Francis Renault. Renault is a female impersonator of international repute. He has made himself the talk of the fashionable set of every capital in Europe and America.\"", "\"Gowns, representing an expenditure of more than $4,000 within the last year, are worn by Francis Renault, the stage's foremost impersonator of women characters who is headlining the Pantages vaudeville program this week and each gown and head-dress worn in the course of the act, is the creation of Mr. Renault, his manager explained. Unlike many impersonators of female performers, Renault does not depend upon his attire to carry him over. True, he wears gowns and headdress creations equal of which are seldom seen upon a vaudeville stage, but it is ability to sing in a soprano voice, his ability to pitch his voice into an effeminite [sic] key, and his grace of figure and carriage which combine to score his stage triumphs. In his dressing rooms back stage at Pantages, Mr. Renault has 11 trunks and each contains many gowns, each representing hours and days of study in designing. This work of designing occupies much of his time and so successful has he been in this work, that often times he is asked to assist in the designing work of gowns for the featured women of the bigger New York stage productions. Renault was the first vaudeville star to introduce the radium gown and in the 'Passing Show' in which he was featured with Willie and Eugene Howard, his display of gowns and head pieces was featured. In his Pantages appearance, Mr. Renault sings, dances and gives a comedy monologue.\"", "\"Headed by the International Star\"; \"'The Slave of Fashion' With a Wardrobe Valued at $50,000\"", "\"Headlining the vaudeville bill is Francis Renault, presenting 'The Slave of Fashion.'\"", "\"Headlining the vaudeville program is Francis Renault, 'The Slave of Fashion,' whose wardrobe of finery is said to represent an investment of $50,000.\"", "\"Headlining the vaudeville program is Francis Renault, presenting the 'Slave of Fashion.'\"", "\"Next comes 'the international star,' Francis Renault, in 'The Slave of Fashion,' known the world over as the foremost impersonator of the fair sex. The Renault act is a glittering fashion show, with a gorgeous array of costly gowns, millinery, shoes, hosiery, lingerie and jewelry. Promenading and posing are not the only features of the entertaining routine, as this star sings and dances as well.\"", "\"Renault, it transpires, is a 'former Ziegfeld Follies star, who has been named as correspondent in three divorce actions, wooed by the emperor, assaulted by enraged wives and has been dubbed 'the mystery of science and sex.' His tricks run from an imitation of Mae West to Mary Pickford.\"", "\"Returning From European Triumphs\"", "\"Slave of Fashion Revue\"", "\"Slave of Fashion\"", "\"Slave of Fashion\"; \"Extra—Thursday Matinee—$50,000 Fashion DIsplay of Latest Gowns and Wraps by FRANCIS RENAULT In Addition to Regular Show! LADIES—Don't Miss This!\"", "\"THE FASHION PLATE OF THE STAGE DISPLAYING ELABORATELY GORGEOUS GOWNS\"' \"LADIES Francis P. Renault The Slave of Fashion will give a SPECIAL FASHION SHOW THURSDAY At the 3 o'clock show $50,000 Worth of Gorgeous Gowns! DON'T MISS THIS\"", "\"THE FASHION PLATE OF THE STAGE DISPLAYING ELABORATELY GORGEOUS GOWNS\"' \"LADIES! FRANCIS RENAULT The Slave of Fashion Will Give a SPECIAL FASHION SHOW THURSDAY At the 3 O'clock Show Displaying $50,000.00 WORTH OF GORGEOUS GOWNS. DON'T MISS THIS\"", "\"THE FASHION PLATE OF THE STAGE DISPLAYING ELABORATELY GORGEOUS GOWNS\"' \"LADIES, 'FRANCIS RENAULT' The Slave of Fashion will give a SPECIAL FASHION SHOW At the 3 o'clock show DISPLAYING $50,000 Worth of Gowns and Wraps\"", "\"THE SLAVE OF FASHION\"; \"International Star\"", "\"THe feature of Frances Renault's presentation, 'The Slave of Fashion' is the wardrobe of brilliant gowns and headdresses. Renault wears these gowns gracefully in his impersonations of various feminine stars of the stage. The impersonations are international in their scope.\"", "\"The International Star\"", "\"The Internationally Famous Celebrity\"; \"'The Slave of Fashion' (IN PERSON)\"; \"A Gorgeous Bevel of Fun, Frills, Song and Dance\"", "\"The One and Only\", \"America's Foremost Female Impersonator\"", "\"The Slave of Fashion\"", "\"The Slave of Fashion\"; \"LADIES! FRANCIS RENAULT The Slave of Fashion Will Give a SPECIAL FASHION SHOW THURSDAY At the 3 o'Clock Show Displaying $50,000.00 WORTH OF GORGEOUS GOWNS DON'T MISS THIS\"", "\"The Slave of Fashion\"; \"LADIES—FRANCIS RENAULT The Slave of Fashion Will Give a SPECIAL FASHION SHOW THURSDAY At the 3 o'Clock Show Displaying $50,000.00 WORTH OF GORGEOUS GOWNS DON'T MISS THIS\"", "\"The Slave of Fashion\"; \"LADIES—FRANCIS RENAULT The Slave of Fashion Will Give a SPECIAL FASHION SHOW THURSDAY At the 3 o'Clock Show Displaying $50,000.00 WORTH OF GORGEOUS GOWNS DON'T MISS THIS\"\n", "\"The Slave of Fashion\"; \"Wearing Gowns Valued at $50,000\"", "\"The Star of All Female Impersonators\", \"Never Before Has A Nite Club Offered Such A High Paid Star\"", "\"The international star, Francis Renault, known as 'The Slave of Fashion' will display a wardrobe that is said to represent $50,000 worth of finery. Renault is an impersonator of international repute and his offering is the gorgeous display of magnificant gowns which he wears with the grace and dignity of a queen.\"", "\"The world's premier and incomparable female impersonator . . . In His SLAVE OF FASHION REVUE\"", "\"We came out of this performance with a smile from ear to ear. By all means time yourself so that you can leave at the close of this act. Don't let anything spoil the excellent taste it leaves. Now, just a minute—don't get us all wrong. There wasn't a whole lot of applause, but we believe there was more than for any act in the last three weeks. Personally, we haven't enjoyed ourself [sic] so much since away back in November when a pair of superb Spanish dancers performed. This man is superior. He has a high class of humor so seldom found that it is delicious. We would enjoy seeing him again. He is said to have a $50,000 wardrobe and we believe it. He's going to display it at Friday's matinee and it'll be worth the time of the style-minded ladies to take a look at it, we think. What does he do? He's a female impersonator and just about perfect at it. There's Queen Marie as big as life and nineteen times as entertaining. There's the 'Red Book cover' lady. There's Madame Butterfly, and an opera singer. If you are one of those who is discriminating and hard to please, here's your act. We don't know how it strikes the average theater goer, but to the particular it is splendid.\"", "\"With his wardrobe costing $50,000 including new gowns, millinery, shoes, hosiery, lingerie, and jewelry, Francis Renault, famous female impersonator will headline the RKO vaudeville bill. Promenading and posing are said to be only a part of his routine which consists of new songs and dances.\"", "\"a female impersonator with a sense of humor, is the featured performer on the four-act vaudeville bill. his array of feminine finery, together with his refusal to take his impersonations too seriously, makes Mr. Renault's offering a pleasant one.\"", "\"called 'The Slave of Fashion,' offers the headline presentation. His act is said to feature impersonations of various sorts.\"", "\"female impersonator, heads the revue which opens this week\"", "\"female impersonator, with a load of fancy clothes\"", "\"internationally famous female impersonator and fashion plate, is the second act on the stage bill. The wardrobe he displays is said to be worth $50,000, while his impersonations of femininityhave won him wide acclaim.\"", "\"main attraction Francis Renault, who is bringing intact his $20,000 wardrobe.\"", "\"the banana-throwing, rose-giving female impersonator\"", "\"the masculine fashion show\"; \"headliner of the stage bill, is one of our prominent female impersonators, and his display of gorgeous costumes will delight feminine eyes. His act is brightened with music and amusing chatter.\"; \"Slave of Fashion\"; \"Extra—Thursday Matinee—$50,000 Fashion DIsplay of Latest Gowns and Wraps by FRANCIS RENAULT In Addition to Regular Show! LADIES—Don't Miss This!\"", "\"veteran female impersonator, with his celebrated wardrobe valued at $50,000, labored, successfully through his headline act Sunday night, burdened by sorrow over the death of his mother early Sunday.\"", "Allegedly running a rooming house in Toledo", "Our day in Youngstown was well spent. Attended the shows and met in person Francis Rennult [sic], a female impersonator. He took the gang up to his room and, dressed in his costume, we could hardly tell the difference, whether it was a man or woman. He is working in a night club outside of Youngstown. He told us he would make a trip to Hawaii in the near future.", "dropped out after two performances", "feature act"], "Francis Ritz": [], "Francis Russell": ["\"Francis Russel of Philadelphia, Pa., is another of the entertainers, who appeared in Olson & Johnson's 'Hellzapoppin',' the Wonder Bar Club and in the 'Mack and Wig Shows.' He is a graduate of the University of Pennsylvania.\""], "Francis Stillman": ["\"[with Lena Rivers,] female impersonators\"; \"Stillman and Rivers are the best of their kind in Kansas City. They received their usual good hand\"", "\"imitations\"", "\"singer\""], "Francis Strom": ["\"ORIENTAL FANTASY\", \"TORCH SONG\""], "Francois Densmore": ["Unsure whether it's Densmore, but likely\n"], "Frank Barrett Carman": [], "Frank Burns": [], "Frank Doran": ["\"All laughs for this trio of men rigged as Diamond Lils or dance hall dames of the 90's. Reeks with hokum, but needs nothing else. Offtime dancing of West in the opening trio number is very funny. Doran and Topsy and Eva satire by one West, with a bit more finish would be a new bon mot in vaude burlesque. Could safely omit diva imitation by other Doran, and ought to revise gags used by the Topsy and Eva pair. For strong finish in gaudy Rus sian with a ridiculous dance that panics costumes, and end their song em.\"", "\"Catching Doran, West and Doran for the third or fourth time since they showed at the Englewood strengthens the original impression that these three men who burlesque the female in Florodora costumery will go bigger in better spots.\"", "\"Doran, West and Doran, three med rigged as Diamond Lils (New Acts), were the standout of the evening in the next-to-closing spot, lifting the show away up.\"", "\"The Belle of the Barbary Coast\"", "\"The Dorans, two 'gals' from the gay '90s, are featured in the current hit show at the HA-HA CLUB. These two comedians are old timers in the entertainment business and give good account of their twenty-two years' experience. They are the newset additions to the show . . .\"", "\"The three 'maidens' first come dashing out done up as beauties along the type of Floradora girls. Then two of them do a travesty upon the Margie of Savoy and Brennan. Then a corking red-headed impression of a prima donna going nuts. Then the smash hit of the act, their own impression of the Duncan Sisters. Their get-up, meaning their dresses, are screams, reminding one of an ocean wave. Here is artistry of burlesque done in rare style. Maybe you do not care for this type of broad female impersonations, but these men have real artistry back of all their non-sense. They handed me a terrible comedy wallop. They close their act with a burlesque, the Russian Bat theater. Good costumes and a fine idea is worked out by the three. Here is a female impersonation act that is different, and to me it is a wow. If you laugh along those lines you will have a grand time.\"' Name corroborated by dataset (F & G Doran were staple acts at K9 Club in Chicago a few years later)", "\"Three female impersonators, with loud comedy hoke. Can make the grade on the rasy time, and with better words might improve. Act is 80% costumes. Sight laughs aplenty. But the chatter can never stand competition. Drum mer stuff overdone and better with out it. Follows with burlesque on prima donna; old stuff for the most part, but good enough. Impression of the Duncan Sisters not impres sive. middle. Act starts strong but sags in the middle.\"", "\"Two Gals from the Gay '90s\"", "Name corroborated by dataset (F & G Doran were staple acts at K9 Club in Chicago a few years later)"], "Frank E. Carroll": ["Producer?"], "Frank Gaines": [], "Frank Keith": [], "Frank Perry": ["\"as Fanny Brice\""], "Frank Quinn": ["Master of Ceremonies"], "Frank Tymm": [], "Frankie": ["\"The Boy with the Silver Voice\""], "Frankie Davis": ["\"The Male Dagmar—Smart Singer of Songs\""], "Frankie Gondone": [], "Frankie Huntsinger": ["\"'Mistress of Ceremonies' Specialty Singing and Violin Arrangements\""], "Frankie Quinn": [], "Frankie Stroud": ["\"[At Dante's Inferno] Direct from 'K-9 Club', Chicago\""], "Fred Berrens": [], "Fred Moore": [], "Fred Munroe": [], "Fred Noll": [], "Fred Van/Freda Van": [], "Freddie Barlow": [], "Freddie Monroe": ["\"in tux thruout, does grand impersonations, especially that Helen Morgan take-off. He's a likeable chap.\""], "Freddie Phillips": [], "Freddie Renault": ["\"Producer-Actor in Finocchio Show\"", "\"The Bombshell of Rhythm\"", "\"ace impersonator, is overpacking Finocchio's these nights, with a takeoff from a number done by Judy Canova in a recent picture. 'Barrel House Bessie from Basin Street,' earns Freddy a big hand at this popular Broadway spot.\"", "\"costumes by Li Kar and ideas by Freddy Renault.\"", "\"show producer at Finochio's, is doing a fine job in doubling in emcee role.\"", "\"will be inducted into the Army this month.\"", "\"will do the emcee chores at Finocchio's panding signing of a big name Eastern femme impersonator\""], "Freddie Wheeler": [], "Freddy Wheeler": [], "Fredricka": [], "Fritz Cantz": ["Inferring that he was there, corroborated by The Vineland, NJ Daily Journal, May 9, 1934, 8; The Vineland, NJ Daily Journal, May 11, 1934, 8"], "Fritzie Feltz": [], "Funny Fanny": ["\"Cavalcade of Laughs\"", "mc + comedienne"], "G. Doran": ["\"All laughs for this trio of men rigged as Diamond Lils or dance hall dames of the 90's. Reeks with hokum, but needs nothing else. Offtime dancing of West in the opening trio number is very funny. Doran and Topsy and Eva satire by one West, with a bit more finish would be a new bon mot in vaude burlesque. Could safely omit diva imitation by other Doran, and ought to revise gags used by the Topsy and Eva pair. For strong finish in gaudy Rus sian with a ridiculous dance that panics costumes, and end their song em.\"", "\"Catching Doran, West and Doran for the third or fourth time since they showed at the Englewood strengthens the original impression that these three men who burlesque the female in Florodora costumery will go bigger in better spots.\"", "\"Doran, West and Doran, three med rigged as Diamond Lils (New Acts), were the standout of the evening in the next-to-closing spot, lifting the show away up.\"", "\"The Dorans, two 'gals' from the gay '90s, are featured in the current hit show at the HA-HA CLUB. These two comedians are old timers in the entertainment business and give good account of their twenty-two years' experience. They are the newset additions to the show . . .\"", "\"The three 'maidens' first come dashing out done up as beauties along the type of Floradora girls. Then two of them do a travesty upon the Margie of Savoy and Brennan. Then a corking red-headed impression of a prima donna going nuts. Then the smash hit of the act, their own impression of the Duncan Sisters. Their get-up, meaning their dresses, are screams, reminding one of an ocean wave. Here is artistry of burlesque done in rare style. Maybe you do not care for this type of broad female impersonations, but these men have real artistry back of all their non-sense. They handed me a terrible comedy wallop. They close their act with a burlesque, the Russian Bat theater. Good costumes and a fine idea is worked out by the three. Here is a female impersonation act that is different, and to me it is a wow. If you laugh along those lines you will have a grand time.\"; Name corroborated by dataset (F & G Doran were staple acts at K9 Club in Chicago a few years later)", "\"Three female impersonators, with loud comedy hoke. Can make the grade on the rasy time, and with better words might improve. Act is 80% costumes. Sight laughs aplenty. But the chatter can never stand competition. Drum mer stuff overdone and better with out it. Follows with burlesque on prima donna; old stuff for the most part, but good enough. Impression of the Duncan Sisters not impres sive. middle. Act starts strong but sags in the middle.\"", "\"Two Gals from the Gay '90s\"", "Name corroborated by dataset (F & G Doran were staple acts at K9 Club in Chicago a few years later)"], "G. G. Allen": [], "Gabby Lee": [], "Gale Page": [], "Garbo": [], "Garry Teasdale": ["\"Singer of Modern Melodies\""], "Gary Edwards": [], "Gay Byerd": ["\"Acrobatics Supreme\""], "Geane Ray": ["First prize winner. \"wore no costume at all. He was attired in the simplest of street dresses, orchid in color. He wore a corsage of gardenias, plain black shoes, flesh colored silk hose, and no hat. His naturally grown wavy titian hair, cut in page boy length, was 'beautiful,' in the words of his admirers.\" \"Ray did not march sedately across the floor while the winner was being picked. He executed a half dance back and forth, holding his arms gracefully aloft. To ordinary eyes, here was a slim young girl in an orchid dress, 5 feet 4 inches tall, weight about 108, waist about 24 and hips 28.\""], "Gene Abbott": ["\"Last, but not least, Gene Abbott, a newcomer with the group makes his debut with the group this weekend. He hails from the Oklahoma territory, being of CHerokee blood . . . and American . . . he has a real 'warhoop' of his own. A master entertainer and a singer of note.\""], "Gene Baye": ["\"Female Impersonators\"; \"Also Other Big Acts\"; \"4—Shows Nightly—4\"; Name corroborated since they appeared together at the Elm Lodge the day before.", "\"The Male Lily Pons\"", "\"The Nightingale Singer", "\"Uproarious Comedian\""], "Gene Casali": ["\"After a Triumphant Stage Tour—See His Famous Original 'COBRA DANCE.'\"", "\"That Boy Cleopatra in the Dance of the Cobra\"", "\"The Exotic Creator of Dance\"", "\"Toe and Oriental Dancer\"", "\"in an Oriental Balad Dance\"", "\"in an oriental dance\"", "Featured in \"an Oriental Dance\""], "Gene Dana": ["\"Character Artist of Songs\"", "Opener for women's wrestling match!", "Together with Billy Richards, \"Female impersonators\"", "the Aristocrat of Female Impersonators", "warbled Shanghai Flo and seemed to be well liked by the customers"], "Gene Darling": [], "Gene Ford": ["\"Gene Ford and his Playboy Revue, now in their fourth week at the Rex Bar . . . have been engaged for an indefinite period.\"", "\"recently concluded a 10-month engagement at the Ha-Ha Club [with Bobby La Marr]\""], "Gene Gordon": ["\"[At Dante's Inferno] Direct from 'K-9 Club', Chicago\""], "Gene Jeanette": [], "Gene Kauffyn": ["\"Modernistic Dancer\""], "Gene Lewis": [], "Gene Mason": ["\"character dancer\""], "Gene Mosely": [], "Gene Pearson": ["master of ceremonies until his untimely death at 34"], "Gene Renee": ["\"Baltimore's Beauty Boy\"", "\"The Boy With the Million Dollar Personality\"", "\"The Continental Favorite With the Voice That Has Charmed Millions\"", "\"celebrated European mimic\" - recently at Kit Kat Club in London", "\"mimic\"", "Coming to Dante's Inferno from Club Richman"], "Gene Russell": [], "George Charles": [], "George Daniels": [], "George Denny": ["Runner-up: $35"], "George Hayes": ["\"Impersonating Ethel Waters\"", "\"Personator of Fanny Brice's Seashore Skit, Mae West of Harlem\"", "MC"], "George Kelly": ["MC", "Part of \"Jean & George\" act, described as \"something very gay.\"", "Part of \"Jean & George\" act.", "The Male Texas Guinan"], "George Levin": ["The proprietor?"], "George Mason": ["Described as \"a young man who does a delightful turn of mimicking in draggy fashion to offstage recordings. His clever mouth routine is especially effective while raking Yma Sumac over the glissandos.\"\n"], "George McDowell": ["\"'soprano' soloist\""], "George Oliver": [], "George Page": ["\"Karyl Norman presents his protege George Paige, M.C.\"", "MC"], "George Parker": [], "George Spelikos": [], "Georgie Burns": ["Producer?"], "Georgie Kaye": ["\"being held on charges of indecent exposure. Both [George Kaye and Edward Lerner] appeared as female impersonators in fan dances, police say.\"", "MC"], "Gerry Carroll": [], "Giggles Craig": [], "Gilda Gray": [], "Gina Seyllor": [], "Ginger": ["\"exotic sex Interpeter [sic] Dancers\""], "Ginger Dunn": [], "Ginger Rudell": [], "Gita Gilmore": ["\"Comedian\"", "\"Comedian, 'Rollin' Down the Mountain'\"", "\"Male Mae West\"", "\"comic\"", "\"doing a Shirley Temple number\"", "\"king of comedy\"", "Unclear if it's actually Gita Gilmore. Article only refers to Gita. But no other Gita is known as a female impersonator. \"When You See GITA The Comedian in 'Them Thar Hills,' you will split your sides with laughter\""], "Gloria Armour": ["Egyptian, Oriental and Hawaiian Dancer - unclear if in drag"], "Gloria Jean": [], "Gloria Stoddard": [], "Gorda Davies": ["\"What a Singer\""], "Gordon Lohman": ["Only called \"impersonator,\" unclear if in drag"], "Gordon Stafford": ["\"Oriental Dancer\""], "Grace Barrie": [], "Greta Gardner": [], "Guilda": ["Is Guilda the Gilda that was charged of \"indecent performance\" in Ottawa, see Strip 'Gilda' of Gender in Hull Obscenity Ran Variety 225, no. 3, December 13, 1961, 51?", "billed as French Marlene Dietrich, keeps illusion going until finale when he doffs blond wig for added mitts.\n"], "Gus Dreyfus": ["Washington DC-based"], "Gypsy Dolan": ["\"Female Impersonators [together with Jean La Monte]\"; \"They're Clever and Very Funny\"", "\"[At Dante's Inferno] Direct from 'K-9 Club', Chicago\""], "Half-Pint Jaxon": [], "Harild Ishem": ["operator (not really a performer?)"], "Harold Hesse": [], "Harold L. Brow": ["m.c. - likely not in drag"], "Harold Ruwin": [], "Harri Henri": [], "Harry Bernie": ["\"Harry Bernie, also in tux, does neat tapping.\""], "Harry Brown": ["\"Described as an habitual female impersonator with five previous convictions for masquerading in women's clothes, Harry Brown . . . was sentenced to an indeterminate term in the workhouse . . . arrested by Detective Johnson . . . in front of Johnson's home.\""], "Harry Davis": [], "Harry Dowling": [], "Harry E. Brewster": ["MC"], "Harry Fink": ["\"Carmencita and Harry Fink, featured dancers\"", "\"specialty dancers\""], "Harry Kelly": ["Tenor singer"], "Harry McGhee": [], "Harry Mick": [], "Harry Pepper": [], "Harry Watson, Jr.": [], "Harvey Lee": ["\"Direct from the Flamingo Club in Hollywood\"; \"Alluring and Beautiful\"", "\"The Most Beautiful Boy in the World\"", "\"The Only Female Impersonator who has Appeared in Earl Carroll Vanities\"", "Harvey Lee left San Antonio, TX"], "Hedy Jo Star": [], "Helen Humes": ["\"Melody Singer\""], "Helen Lee": ["likely a \"pretty girl\" in the ensemble"], "Helen Mack": [], "Helen Tustin": ["\"Torch Singer\""], "Hemsley Winfield": [], "Henri Borrell": [], "Henri St. Charles": [], "Herbert Clifton": [], "Herbert Faye": [], "Herman Ferdinand": ["\"the able master of ceremonies\""], "Herslean Roberts": ["1st prize winner"], "Hot-Cha Hinton": ["\"left the Ha-Ha Club recently [together with Billy 'Senorita' Herrera]\""], "Howard Blair": [], "Howard Parsons": ["\"Soloist\""], "Huberta Beeson": [], "Ina Gaskill": ["\"America's Most Beautiful Chorus Boy\""], "Iola Goodman": [], "Irene Dunn": [], "Irvin Mazzie": ["M.C.", "MC"], "Ivey \"Caldonia\" Anderson": ["\"does a dance you like to see\""], "J. John Howard": [], "J. Sellers": [], "Jabby Caruso": ["Name corroborated by 1935-07 Times Union,  23 Jul 1935, p. 15. Legal name here is written as \"Jack Carno\"", "Name inferred from Times Union, July 23, 1935, 15"], "Jack Calahan": [], "Jack Carr": [], "Jack Craig": ["\"comedian\"", "unclear who was in drag or not here"], "Jack Hughes": [], "Jack Jewell": [], "Jack King": ["\"Comedian\""], "Jack Leystan": ["No indication whether he was present but adding to make clear connections"], "Jack Mason": ["\"Jack Mason will produce revues at the Club Richman for the next three years\"", "\"Jack Mayo\"", "MC", "Producer?"], "Jack Polle": ["singing waiter \"who entertain with female impersonations in addition to their other duties\" arrested and fined \"on charges of selling liquor, but none of the five was able to produce the money and all went to Mineola jail\""], "Jack Steiner": ["\"silhouettist\""], "Jackie Adams": ["\"prima donna . . . a rather clever female-looking trick, who rates as a close double for the late Jean Malin, a pillar of this spot in the old days. Adams does a number Malin featured here.\"", "International Nightingale", "Together with Lena Rivers, \"Two of America's Foremost Female Impersonators\""], "Jackie Bennett": ["\"Comedienne\""], "Jackie Collier": ["An imitator of Barbette. Returning to America."], "Jackie Dayton": ["\"Male Gilda Gray\"", "\"The five, some with wigs and others with naturally curly hair, were herded into the jail Tuesday night by deputy sheriffs who said they learned some bubble and strip tease dances were being staged at the night club. They all pleaded not guilty to charges of outraging public decency when arraigned before Charles W. Conner, common pleas judge. W. J. Stander, manager of the club also pleaded not guilty to the charge and was placed in jail in lieu of $1,000 bond. The other five charged are Frances Lee, 206 South Robinson avenue, Joe LaMar, Cincinnati, Ohio; Gene Marlee, Cincinnati; Jackie Dayton, Detroit, Mich., and Paul Gilvre, Terre Haute, Ind.\"", "Name corroborated by The Daily Oklahoman, February 10, 1938, 21"], "Jackie Giggles": ["\"High spot of the show is Eagels, who sings.\"", "\"Late Star of Club Richman\"", "\"that Sophisticated Torch Singer\"", "Making a bit of a leap here — not 100% sure this is Jackie Giggles"], "Jackie Gordon": [], "Jackie Hughes": ["From Club Richman"], "Jackie Jackson": [], "Jackie King": [], "Jackie Lane": ["\"Prima Donna\"", "\"Russian Whirlwind\"", "\"Starring\"; \"Formerly with Eddie Jackson of Clayton-Jackson-Durante Trio of Broadway\"", "Genders Fay Norman \"HIS\" = \"Fay Norman and His 'Boys Will Be Girls Review'\"", "MC", "MC; \"Formerly Starred Clayton-Jackson-Durante Trio of B'way Fame\"", "Named inferred from Warren Times Mirror, June 12, 1935, 2"], "Jackie Law": [], "Jackie Lee": ["\"Sophisticated Song Styles\""], "Jackie Lopez": ["\"Star of the Hula Dance\""], "Jackie Lorraine": ["\"a blues singer who's going to come along\""], "Jackie Lynch": ["\"Sensational Irish Flame\""], "Jackie Maye": ["\"(both of 'em [Jean Malin and Jackie Maye] flaming femme impersonators), we can't help but wonder whatever happened to that police edict barring female impersonators from the local nite clubs—you know, the edict that got so much publicity immediately after the Club Abbey shooting.\"", "\"At the Club Calais . . . 'I like that one very much,' he said pointing to Jackie Maye. 'That isn't a girl, that's a fellow,' I told him. 'Stop trying to kid me, Sid,' he said. 'I think I know a girl when I see one.' I tried to convince him that Jackie was a male wearing female clothing, but he wouldn't believe me. 'I'll bet it's really a girl,' he went on, 'and she tells you columnists she's a fellow so you'll think she's a good female impersonator.\"", "\"At the Club Calais, Jackie Maye, the boy performer, told of a bitter experience he had with a friend. 'I loaned him $50 to buy a tuxedo. I didn't mind the money so much, but the guy doesn't come here any more.' Jackie was very sad. 'I'll never believe another man as long as I live,' he declared.\"", "\"Because one night at the Club Calais while Jackie Maye was doing his female impersonation, a certain newspaperman who wasn't wise to it proposed to Jackie.\"", "\"Frances Dunn and Arthur Budd are back at Torch Club, Police Commissioner Mulrooney giving them permission—but Jackie Maye hasn't gotten the official okay yet. It seems strange, but Broadway can't boast of one real hot stay-out-late spot where the crowd gathers.\"", "\"Jackie Maye and Show Place Revue, headline the program [at the Bay Ridge Theatre]\"", "\"Mulrooney okayed Jackie Maye for the Lido Club on condition Jackie wears a Dietrich tuxedo.\"", "\"Only Female Impersonator to play in MOTION PICTURES . . . Heading a new ALL-STAR cast of the leading Female Impersonators in the business.\"", "\"Over at the Club Calais there is also a new spring edition featuring Frances Faye's piano thumping and Jackie Maye's new spring gowns.\"", "\"Seen for the first time in Philadelphia . . . reputed 'tops' as a female impersonator\"", "\"The main novelty here is a lad named Jackie Maye, who is dressed in girl's clothing and looks better than many a lass. His favorite ditty is, 'I Must Have That Man.'\"", "\"The practical joke at the Club Calais is to get a chump to dance with 'Jackie' Maye, the femme impersonator\"", "\"The success of Mallin [sic; Jean Malin] may or may not be responsible for the presence at the Club Calais of one Jackie Maye. As one who never went in for female impersonators with any great degree of applause still and all this Jackie Maye appears the most incredible of them all. I have yet to note a person who, without advance knowledge, saw through Maye's disguise.\"", "\"a female impersonator\"; \"scores a personal triumph for excellence in his particular field. In a well-modulated falsetto, he does Gone With the Wind, ending the number in a surprisingly clear high note. In a more mannish vein, he offers Copper-Colored Gal, capping it with a bit of Suzi-Q\"", "\"female impersonator, has a good singing voice\"", "\"has let his hair grow and now has a girlish bob . . . He's still better looking than any of the chorines there.\"", "\"later I hear that Jackie Maye plans to appear at the Club Lido, 52d St., despite Mulrooney's ban upon sissy performers... Maye is taking a hint from Marlene Dietrich and will work in trousers, hoping that he will evade the Mulrooney edict.\"", "\"now singing 'straight'\"", "\"receives orchids almost nightly from a society lad.\"", "\"who reigns supreme at the Club Calais, has just acquired a black velvet evening gown that looks like the money, and taking a tip from those who know, the girls around town would do well to go up and see how to wear dresses to bteter advantage than the season's leading debutantes.\"", "Club Abbey's chorus girls, under the \"master (?) of ceremonies\" Jackie Maye.", "Star billing", "female impersonator from Club Ha-Ha, \"wearing his $10,000 gown\""], "Jackie Phillips": ["\"The riotous redhead\""], "Jackie Sawyer": [], "Jackie Small": [], "Jackie Starr": ["\"Male Gypsy Rose Lee\"", "\"The Male Gypsy Rose Lee\"", "\"The original male impersonator of the world famous Gypsie [sic] Rose Lee\"", "\"singer\""], "Jackie Thomas": ["\"Blues Singer—and How!\""], "Jackie Woods": [], "Jacquette La Marr": ["\"Singer of Popular Songs\"", "\"that explosive bit of personality\"", "Crooner", "MC", "Named inferred from Warren Times Mirror, June 12, 1935, 2", "Personality Singer"], "Jakie Polee": [], "Jamaica James": [], "James Carberry": [], "James Casalino": [], "James Costa": [], "James E. Myers": ["Legal name written as \"James E. Mayer\""], "James Ernest Allen": [], "James Lyons": [], "James Riley": ["Guessing that this is James Riley based on other sources that mention him in 1920, 1921, 1927, etc.", "partner of Johnny Hudgins; dead; survived by wife and three kids"], "James Tai": [], "James Watts": [], "Jamie Greeney": [], "Jan Britton": [], "Jan Lee": [], "Jarahal": ["\"Jarahal, female impersonator, opens many eyes wider in his artful transition, and gains great favor.\"", "\"clever freak-voiced impersonator\"", "\"exotic sex Interpeter [sic] Dancers\" Unsure whether this is Jarahal but at least it seems like it could be...?", "Could name be Jarvis Hall?", "No longer in drag, likely. Here called \"Prince Jara Hall,\" a \"specialist in two vocal registers\"."], "Jay Albert": ["Second prize winner at the ball"], "Jay Colby": [], "Jay Wolfe": [], "Jayette": ["\"Sensational Dance Stylist\""], "Jean Allen": [], "Jean Arnold": ["\"Male Betty Boop\""], "Jean Barrios": ["\"Dean of Female Impersonators\"; \"Sings in Three Voices\"", "\"Jean Barrios, female impersonator, carries his dresses well.\""], "Jean Cook": [], "Jean Darling": [], "Jean Demeaux": [], "Jean Evol": [], "Jean Farrelly": ["\"Elissa Landi of Nite Life\"", "Identified themselves as Jean Farrelly in court", "Legal name erroneously written as Laurence LaBarger (23)"], "Jean Francis": [], "Jean Jennings": ["Impersonations", "Part of \"Jean & George\" act, described as \"something very gay.\"", "Part of \"Jean & George\" act."], "Jean La Monte": ["\"Dancer Extraordinary\"", "\"Female Impersonators [together with Gypsy Dolan]\"; \"They're Clever and Very Funny\"", "\"Gene LaMonte is featured in Karyl Norman's all-male revue at the Club Frontenac this week and leads off the twenty-act show with a dance version of the song that made Vincent Lopez famous, the lilting 'Nola.' LaMonte also performs his impression of the dances done Betty Hutton, Detroit's number-one jitterbug. He first became well known to Detroiters through his orchestra, Gene LaMonte's Syncopators, before he studied dancing under Ned Wayburn, and began making interpretative and comedy dances his forte.\"", "\"In His Famous Fan Dance and the Continental\"", "\"In His Famous STAIR DANCE\"", "\"Karyl Norman's All-Male Revue is completing its 30th week at the Club Frontenac, Bowery-type night spot. Four among the veterans, Del Le Roy, Francis David, Gene LaMonte and Bobby Bell, continue.\"", "\"Marvelous Toe Dancer and Singer\"", "\"Sensational Tap Artist\"", "\"Sensational Toe Dancer\"", "\"Sensational Toe Dancer—Direct from Club Florida, New York—Also Starred with Fachon & Marco\"", "\"Singing M.C.\"", "\"clever toe dancer who, besides doing his own specialty, leads the boys of the ensemble in routines.\"", "\"formerly . . . a member of the international dance team of Corday and La Monte, which appeared at the World's Fair in Chicago.\"", "MC?", "Named inferred from Warren Times Mirror, June 12, 1935, 2"], "Jean La Rae": ["\"Added Attraction: Vaudeville's outstanding Female Impersonator\"", "\"World's Famous Female Impersonator\"", "\"World's Famous Impersonator\"", "\"the male Texas Guinan\""], "Jean La Rue": [], "Jean LaMarr": ["First prize winner at the ball"], "Jean Lorraine": [], "Jean Lures": ["\"plays comedy as a girl\""], "Jean Malin": ["\"(both of 'em [Jean Malin and Jackie Maye] flaming femme impersonators), we can't help but wonder whatever happened to that police edict barring female impersonators from the local nite clubs—you know, the edict that got so much publicity immediately after the Club Abbey shooting.\"", "\". . . Jean Malin is the chief attraction for the naughtic clan.\"", "\"After watching Jean Malin work for a while Saul said: 'I don't understand why you columnists call him 'Man or Myth?' He's just a performer.\"; \"'Just wait until we hear the 'Love for Sale' number. Then we leave and go to the Calais club.'\"", "\"At the Club Argonaut, Jean Malin still continues to be the big attraction of Broadway's night life. Now a swell floor show has been built around Mr. Malin (am I getting personal?) and I especially recommend the 'Love for Sale' number.", "\"Backstage mixed with the underworld . . . a pansy who 'never resists police.' It's a lingering drama that should not hang around long. . . . Jean Malin's the pansy. The m.c. of the Club Abbey does his usual violet routine, and in an experienced manner doesn't act like a man for some laughs and more curiousity from a motley array of cut-raters who will come here when they do. That's no break for the club that screams credit for itself for Malin in the program. . . . Malin's job is wrist slapping once or twice through each act dropping a wisecrack and a gesture.\"", "\"Billy Bryant, who came to town as a legendary show-boat figure of the Ohio and Mississippi, winds up in night club—and in the same show, at the Club Richman, is that wise cracking effeminate master-of-ceremonies, Jean Malin . . . Yes, Broadway makes strange floorshow fellows.\"", "\"Healy will leave the Club New York in two weeks to be replaced by Jean Malin.\"", "\"Jean Malin and his floor show return to that spot.\"", "\"Jean Malin is returning to his cinema city night club . . . at the request of the flicker stars who miss him . . . Jean is trying to get Jackie Maye and Francis Dunn out there to work with him.\"", "\"Jean Malin keeps on climbing! In the tryout of 'Sisters of the Chorus,' he had a small part, having previously been a dancer in ensembles. Since them he attracted throngs to the now defunct Robaiyat, and became the star attraction at the Abbey. Having made a hit with his distinctive personality, he returns to 'Sisters of the Chorus' for the New York engagement, this time . . . . doubling at the Abbey. Texas Guinan returns to the Abbey shortly, Jean will move to the Chateau Madrid.\"", "\"Jean Malin's burlesque radio number is one of the high spots of the new show at the Club Richman\"", "\"Malin gives all the acts a break, builds them up well and allows them to work without interference, something local club m. c.'s should learn. In his own work, he's still the town's hot boy as far as wisecracking is concerned but the local wisecrackers are laying off him. Took the count too often, No small aid to Malin is his piano player, Charlie Russell.\"", "\"Most of his spare time in the [Belasco] theatre was utilized by him to sew dresses for the soirees at Rockland Palace, the Harlem Casino and other spots of that type. Dressed as a woman, Malin was a consistent winner of first prizes in these contests.\"", "\"Tex Guinan accepted a hurry-up booking for Fanchon & Marco . . . Tex has left her nite club. Jean Mallin [sic] replaces her as hostess.\"", "\"The common or garden variety of chorus boy is played by the well-known Jean Malin with his own inimitable floruishes.\"", "\"Were you at the Club New Yorker the other eve when Jean Malin announced that he 'was all fagged out'? Whoops!\"", "\"a female impersonator of no small ability who acts as master of ceremonies and who, just a few years ago, was just another shrinking violet. Mallin [sic] has been a 'wow' as a box office attraction and is mentioned almost daily by the out-and-out Broadway paragraphers.\"", "\"booked by Jack Bertell into the New Yorker Club . . . . has ignored the agent's claim for commissions, according to . . . Bertell's lawyer. Agent is also contemplating suit for commissions on a movie contract which was the result of the club showing.\" He was also, according to Variety, Mar 21, 1933, 50, sued for rent that he did not pay. Also see Variety, Jun 20, 1933, 32 for follow up and Variety, Jul 11, 1933, 47 for the dropping of the suit.", "\"fem impersonator and featured at the club since its opening last fall, is filling in with picture work [when Club New Yorker is closed for the summer.\"", "\"filed a suit for divorce\" in Mexico!", "\"has returned as master of ceremonies and is supervising a star-studded show\"", "\"heading the floor show\"", "\"held over for another two weeks at the Ship Cafe in Venice\"", "\"is doing Queen Victoria [at Club New Yorker] these nights\"", "\"very New York, landed solidly both with those who knew him from the east and with the local filmites. His wise cracks and flip remarks, especially to noisy guests, had the home girls and boys wondering what it was all about.\"; \"Malin takes up about half of the floor show time with his femme impersonations. A class entertainer, he shows most of the local cafe performers how it should be done. He's at his best when being fed by Jack Oakie, Polly Moran, William Haines or some of the other picture names who are nightly patrons.\"", "\"will impersonate Mae West\"", "His age corroborated from http://sfbaytimes.com/jean-malin-broadways-queen-of-queens-2/", "Winner: $50", "giving an impersonation of Aimee Semple McPherson that is something", "misspelled as \"Jean Mallin\""], "Jean Marlow": ["\"Sophisticated Songster\"", "\"That Beautiful Platinum Blonde Songstress\""], "Jean Miller": [], "Jean Mitchell": ["Exotic dancer but no indication of drag"], "Jean Osborne": ["\"Another outstanding specialty is that of Jean Osborne and Al De Marco, who do a 'Blue Danube' waltz in the manner of a Ramon and Rosita.\"", "As part of DeMarco & Osborne", "Part of \"Osborne and de Marco\", \"female impersonators\""], "Jean Russell": ["\"dancer\""], "Jean Taylor": [], "Jean Val Jean": [], "Jean —": [], "Jene Cortez": ["\"The Rhythm Whirlwind In The Lavish and Distinctive Spectacle\""], "Jerrie Kay": [], "Jerry Clark": [], "Jerry Clayton": ["\"M. C.\"", "\"Master of Ceremonies\"", "\"Sensation New M. C.\"", "MC"], "Jerry Faye": ["\"the 'male Martha Raye'\"; \"in his 10th week at the Ballyhoo Club\""], "Jerry Francis": ["\"Male Peggy Hopkins Joyce\"", "\"The Male Peggy Hopkins Joyce\"", "Appeared there last summer as well."], "Jerry King": [], "Jerry Kreuger": [], "Jerry Le Roy": ["Not sure whether they were part of the Gay Boy Revue?"], "Jerry Lee": [], "Jerry Nelson": ["Named inferred from Warren Times Mirror, June 12, 1935, 2"], "Jerry Podinsky": [], "Jerry Powell": ["\"brand new singer has joined the Hoffman House Stock Company. . . . who renders the good old vocal backgrounds in fine fashion.\""], "Jerry Ruzell": ["\"A Dream Come Wiggling\""], "Jerry Sullivan": [], "Jerry Trevor": [], "Jerry Vaughn": ["\"Acrobatic Dancer\"", "\"acrobatic dancer\""], "Jessie Lee": [], "Jessie Rogers": ["\"Bubble Dancer\""], "Jewel": ["\"That Million Dollar Smile Girl\""], "Jill Christie": [], "Jim Bailey": [], "Jimmie Bernard": ["Could this be Joe Renard?"], "Jimmie Gleen": [], "Jimmie Sheri": [], "Jimmy Carrigan": [], "Jimmy Travis": ["\"After a 15-week run at the Club Piccadilly, Baltimore, Jimmie Travis is current at the Club Wonder, New Orleans\""], "Jo-Jo": ["World-famous Clown"], "Joan Andrews": ["From Club Richman"], "Joan Mitchell": [], "Joan Morrow": ["\"Holdovers . . . Joan Morrow of the a la classic fans\"", "\"Lady of the Fans\"", "Fan Dance - unclear if in drag"], "Joan Rogers": [], "Joann O'Brien": ["\"Male Strip Tease\""], "Joanne": [], "Joanne Crawford": ["Arrested.", "Artist alter ego name corroborated by The Chicago Defender 15 July 1939, 24"], "Joe Canary": [], "Joe Cook": [], "Joe Daley": ["\"Broadway King of Jesters\""], "Joe Dare": [], "Joe Hart": ["\"the newest lyric tenor who thrills with a swell repertoire of popular songs\""], "Joe Johnson": ["Second prize winner", "Washington DC-based"], "Joe Lewis": [], "Joe Renard": [], "Joe Robinson": ["\"Joe Robinson as a mammy tearfully sings 'When a Woman Loves a Man.' He steals the revue.\""], "Joe Rogers": ["\"Bubble dancer\" + from Leon and Eddie's, NYC?"], "John Berry": [], "John D. May": [], "John Dooley": ["\"befurbellowed with a wig and skirt and a falsetto voice, flounces around as a female impersonator in what they call a comic skit.\""], "John Gravet": [], "John Koss": ["singing waiter \"who entertain with female impersonations in addition to their other duties\" arrested and fined \"on charges of selling liquor, but none of the five was able to produce the money and all went to Mineola jail\""], "John Lonas": [], "John Maxwell": ["\"Mystery voice\""], "John St. Leon": [], "John Wilton": [], "Johnnie Helder": [], "Johnnie Langstone": ["\"Dancer\""], "Johnny Blease": ["\"Sophia Tucker\"", "\"Sophie Tucker\"", "\"emcee\"", "\"master of ceremonies\"; \"'Second Sophie Tucker'\"", "\"the second Sophie Tucker\"; \"master of ceremonies\"", "Johnny (Sophie Tucker) Blease"], "Johnny David": ["\"Current show includes\"", "\"Female Impersonator\"", "\"One of the World's Foremost Female Impersonators\""], "Johnny Hudgins": [], "Johnny Kaye": ["\"Female Impersonators\"; \"Also Other Big Acts\"; \"4—Shows Nightly—4\"; Name corroborated since they appeared together at the Elm Lodge the day before.", "\"International Star—Outstanding Fashion Plate\"", "\"The Boy Who Has Completely Captivated Syracuse\"", "\"emsee\"", "\"recently closed ten weeks at the Echo Tavern in Troy and was featured third on a bill in New York last week given for the benefit of tubercular patients.\"", "20 week engagement closed - \"Will head for Broadway\"", "Johnny Kaye wants to book his six female impersonators into some Reno night club. They're marking time in Kansas City, awaiting reply.", "MC; \"Hot-Cha Singer\""], "Johnny Mangum": ["\"Also\"", "\"America's Outstanding Female Impersonator\"", "\"Chanteuse Modern\"", "\"Foremost Female Impersonator\"; \"The Smartest Show Yet\"", "\"Singer of Sophisticated Songs\"", "\"Special Attraction for a Limited Time Only\"; \"Foremost Female Impersonator\"", "\"female impersonator of New York, today was awarded $240 damages by a jury in the Civil Court of Record after hearing his suit for $1,500 damages from Albert Bouche of Chicago, proprietor of a night club at Miami Beach. The suit alleged breach of verbal contract. Mangum asserted Bouche hired him in New York but discharged him several weeks later. Bouche declared there was no agreement.\"", "\"song parodist\"", "Together with Leon Frederick, \"Two of America's Outstanding Female Impersonator\"", "credited as \"M. C. and Prima Donna\"", "female impersonator from Club Ha-Ha", "unclear who was in drag or not here"], "Johnny Rose": [], "Jose": [], "Jose Ayala": [], "Jose Del Rio": ["newcomer and \"Cuban dance impressionist\""], "Joseph Bart": [], "Joseph Gant": [], "Juan Rose": [], "Juanita B. Talmadge": ["\"returned from an extensive tour of the British Guiana, West Indian Islands, and other South American ports where he won many laurels. Owing to his charming personality and perfect make-up he is regarded as America's premier female impersonator.\""], "Jud King": ["\"Fast Tap Dancer\""], "Jules Diamond": ["\"Broadway Musical Star — The Male Gypsy Rose Lee\""], "Julia Stevens": ["\"Exotic Dancer\""], "Julian Eltinge": [], "Julie Dees": [], "June Beal": ["\"Songs, Dances\""], "Karen Parker": [], "Kari Daniels": [], "Karlon Owens": ["\"Current show includes\"; \"emsee\""], "Karyl Norman": ["\"'Creole Fashion Plate' . . . Keith and vaudeville headliner for 14 years, and who was starred on Broadway in 'Greenwich Village Follies,' 'That's My Boy,' and 'Lady Do,' will bring his revue to New lookout House for a brief engagement beginning THursday night. 'The Creole Fashion Plate' makes 20 complete changes and carries a $20,000 wardrobe. This will be his first time in Greater Cincinnati in eight years. The resent floor show . . . will continue until Wednesday night. There will be another amateur contest tomorrow night.\"", "\". . . about to start on a tour of the Fox Houses around New York. For many seasons Keith-Albee and the Orpheum circuits have utilized Norman as a headliner. Seeing no farther benefit to himself in clinging to three-a-day time at two-a-day salary, Norman has taken the jump.\"", "\"Heading the stage end of the delightful program that has been arranged . . . is none other than Karyl Norman, one of the world's foremost female impersonators. Assisting this versatile stars in his offering which he calls 'In Rehearsal', is Bob Hamil. He was a big hit at all of yesterday's performances with his voice and immaculate female attire.\"", "\"Headliner of the bill is Karyl Norman. He trips buxomly to the microphone in the last trappings of femininity with all the aplomb of the night club divas, and in a clear soprano head-voice sings sweetly of love and laughter. The payoff comes when he sweeps off the wig and unleashes a mighty baritone. His impersonation of Mae West was also received in gasping admiration. Mr. Norman parodies all the flutterings of the night club entertainers with biting irony and through it all succeeds in keeping the game clean.\"", "\"Karyl Norman is again making his stand at the Club Frontenac, Detroit, and will be there for the season.\"", "\"Karyl Norman next proved himself the king of female impersonators, or should we have said queen? It's so hard to get your genders straight in a case like this. He wears dazzling gowns most fetchingly and we don't think it amiss to add naturally. He also sings in a very feminine voice when he wills and in a very masculine voice as well. Quite an accomplishment. He got a rousing reception.\"", "\"Karyl Norman's All-Male Revue is completing its 30th week at the Club Frontenac, Bowery-type night spot. Four among the veterans, Del Le Roy, Francis David, Gene LaMonte and Bobby Bell, continue.\"", "\"Karyl Norman, female impersonator, who headlined vaudeville a decade ago, returned to Des Moines via burlesque to obtain thorough approval of the President theater audience Friday night. Billed as 'The Creole Fashion plate,' his impersonation of the 'strip tease act' proved a fitting mimic to the number of like acts offered by the fair ladies of the east.\"", "\"New Yorkers just learning of the death in California of Caryl [sic] Norman, onetime headliner at the Palace as a female impersonators. He was completely broke.\"", "\"The Creole Fashion Plate\", \"The World's Greatest Female Impersonator\"", "\"The chef who mixed up the concoction for the Majestic patrons, is a past master in the art of serving real food for tired people. . . . The meat of the bill is Karyl Norman, 'the creole fashion plate', and one of America's foremost female impersonators. He is ably aided and abetted in his delectable offering 'In Rehearsal' by Bob Hamil who tickles the ivories for his many delightful vocal numbers.\"", "\"The veteran Karly [sic] Norman, a female impersonator, won the plaudits of the crowd in the 'Creole Fashion Plate,' billed as the top act.\"", "\"Twenty-one years in show business have given Karyl Norman, master of ceremonies and producer and singing star of Club Frontenac's revues, ample experience for any job. Norman joined a minstrel show in Baltimore when he was 15 years old. Since that time he has appeared as a headliner in vaudeville, starred in musical comedy and for the last five years has been in the cabaret field.\"", "\"Under the leadership of Karyl Norman, master of ceremonies, the members of the cast will offer new songs, dances and comedy\"", "\"Vet impersonator recuping from serious illness in Ft. Lauderdale\" = Jewel Box had a benefit performance", "\"billed as 'The Creole Fashion Plate,' is the best known member of the company. He has played big time vaudeville in New York and elsewhere for years.\"", "\"continues to be featured\"", "\"following a contract with the [Keith] vaudeville people for a period of five years, has walked out on them and is now playing motion picture house dates. That he will not return to vaudeville seems to be definite, inasmuch as he has signed with Abe Carlos for a series of feature pictures and will make personal appearances in conjunction with these productions when they are released.\"", "\"has been handed his notice at the Club New Yorker and washes up with the club when Ted Healy and his gang arrive here from New York to replace him.\"", "\"known as 'The Creole Fashion Plate,' opens a brief engagement Thursday night in Terrace Garden, New Lookout House. 'The Creole Fashion Plate' is coming from New York, bringing his extensive wardribe with which to make 20 complete costume changes. This female impersonator imitates Mae West, Anna Mae Wong and other notables, and will be seen here with his own revue.\"", "\"reverts to a bygone vaudeville program . . . Norman appears to depreciate the old type turn to the extent that he is not a 'female impersonator,' but rather a 'character delineator.'\"", "\"seen at the Columbia for the past several years, has evidently quit the vaudeville stage for the present . . . signd with Abe Carlos, husband of Gilda Gray to do a number of feature pictures.\"", "\"the 'Creole Fashion Plate,' female impersonator extraordinary, is featured at the Bradford Cascades atop the Hotel Bradford this week with a scintillating floor show. Norman, now the tops in his art, dons the latest creations and many 18th century gowns, and fools even the ladies with his perfect impersonations.\"", "\"the Creole Fashion Plate, headlines the stage show at the Fox. . . . The world-famous female impersonator carries 35 beautiful gowns for his act and wears a different creation at every performance.\"", "3 year contract", "Norman is not doing any dress numbers; he is doing vocals in a rich baritone", "Unclear whether he appeared in drag.", "has discarded wigs for Tux and straight baritone singing", "likely not performing but managing", "originally scheduled to appear but was \"pulled out yesterday\"", "stopped his act halfway because he was not receiving enough applause - he was later rebuked for his action and the head of the Keith Circuit wrote \"informing him in part he would never again be afforded an opportunity to criticize any audience in any of the houses on the Keith Circuit.\""], "Kay Marshall": [], "Keane Waters": [], "Keith Hall": ["\"Billy Rose's Dancing Partner\""], "Kenn King": ["Not mentioned by name but put here for connection's sake"], "Kenneth D. Custance": [], "Kenneth Hawkins": ["Member of \"Krazy Katz\""], "Kenny Sacha": [], "Kerri Mario": ["\"dancer\""], "Kerri Marlowe": ["\"dancer\""], "Kiki Hall": ["\"Something Different\""], "Kim August": [], "Kitty King": ["\"Rending excellent support . . . comely singing waitresses.\""], "Kitty May": ["\"Marvel at . . . The Sensational Hula Dancer\"", "\"Sensational Hula Dancer\"", "Here described as singing \"Just a Shanty in Old Shanty Town,\" and then \"pulled up his dress waist high and revealing the daintiest of women's unmentionables.\""], "Kitty Saxon": [], "Klare Kenney": ["advertisement: \"I know that life begins at forty but still Glamorously Gay\""], "La Belle Rose": ["\"And, as all Manhattan rounders know, La Belle Rose starts his third season at the Nut Club, with other concerns looking about for runners-up.\"", "Scotch performer alleged to be back in November", "called Scotch female impersonator -- is this the person who Rae Bourbon used to be in a vaudeville team with under the name Scotch and Bourbon? (see Literati: Femme Impersonator's 'Hookers' Variety 107, no. 11, August 23, 1932, 40.)"], "La Carmentita": [], "La Rue Sis": [], "La Verne": ["\"The Girl in Gold. A glittering display of beauty unadorned.\"", "\"the girl in gold\""], "LaVerne Cummings": ["\"Early in his career . . . starring in the Jewel Box Revue in Miami, Florida\"", "arrested \"after being detected as an entry in a 'Miss National Boat Race of 1952' contest at the film house. He dressed in a woman's bathing suit and wore a hair ribbon, makeup, and high-heeled shoes which lace up the leg.\""], "LaVerne and Bauers": [], "Lady Baltimore": [], "Lady Doris": [], "Lanny Brice": ["\"at Terrace Gardens . . . after finishing 12 weeks in Detroit for the Pete Iodice office\"", "\"finished a summer's run at Benton Harbor . . . now at the Moonlight Gardens, Springfield, Ill.\"", "\"former impersonator, . . . now producing the shows at Gamble Inn\"", "\"no longer associated with Lyle Page's Playboys\"", "comedian"], "Larry Turner": ["Named inferred from Warren Times Mirror, June 12, 1935, 2"], "Larry West": ["\"Burlesquing Cleopatra's tortuous dance of death\"", "\"Comedy Ala Carte\"", "\"The Death Dance of Cleopatra\""], "Lee Bailey": [], "Lee Carroll": ["\"Delineator of Song\"", "\"male Jean Harlow\""], "Lee Leonard": [], "Lee Mason": ["a femme-female drag queen - a sign of the vibrant drag culture at this time in the country..."], "Lee Moore": [], "Lee Robert": [], "Lee Shaw": [], "Lena Horne": [], "Lena Rivers": ["\"Pretty\"", "\"Pretty\", \"Incomparable Comedienne\"", "\"Starring\"", "\"[with Francis Stillman,] female impersonators\"; \"Stillman and Rivers are the best of their kind in Kansas City. They received their usual good hand\"", "\"pansy comic\" - does a fan dance in long underwear, together with Art West?", "Together with Billie Brennan, \"Two of America's Outstanding Female Impersonators\"", "Together with Jackie Dams, \"Two of America's Foremost Female Impersonators\""], "Lenny Ross": [], "Leo Crear": [], "Leo Fuchs": [], "Leo the Lion": ["\"A pipsqueak of a fellow . . . gives hilarious froth to the 'Gay Boy Revue' . . . Leo emerges, a shy, unpretty lass, and proceeds to give the mos mischievous twists to the drabest of lyrics. Then he climaxes his bit with a startling exhibition of boogie-woogie music. An outstanding comic of the nervous, athletic school.\"; legal name comes from 1948-07-21 The Cincinnati Enquirer (Cincinnati, Ohio)21 Jul 1948, WedPage 14", "\"The strangest professional name in show business now shines in the foyer marquee of the New Look Club . . . It belongs to Leo the Lion, New York-born female impersonator, comic and boogie-woogie pianist now featured in the Gay Boy Revue. 'Leo the Lion' is not his real name, of course. He signs his contracts and checks 'Leon the Lion.' The latter name was legalized in Federal Court a year ago.\""], "Leon Dubois": [], "Leon Fredericks": ["\"a gent who is the last word in comedy.\"", "\"master of ceremonies\"", "\"the raiders found about forty men . . . and among them a female impersonator, highly powdered, lip-sticked and rouged, who gave his name as Leon Fredericks, 21 years of age of 1617 North Cahuenga avenue. He was booked on a morals charge.\"", "Together with Johnny Mangum, \"Two of America's Outstanding Female Impersonator\""], "Leon La Verde": ["\"America's distinguished star of dance\"", "\"Dynamic Dancing Star\"", "Karyl Norman is \"assisted by\"", "conflict over higher billing than stripper: "], "Leon Mirabeau": [], "Leonard Jans": [], "Leonard Soules": [], "Leslie Lynch": [], "Lester Lamont": ["\"female impersonator\""], "Lester Queen": [], "Li Kar": ["\"costumes by Li Kar and ideas by Freddy Renault.\"", "\"most graceful Oriental dancer\""], "Lila Carmen": [], "Linden": ["\"Milton, Paul, and Dorneay are dancers and singers,\"; \"Nothing out of the ordinary about their work, which has little chance to get anywhere in this spot, where noise is cultivated.\""], "Little Egypt": ["\"a female impersonator\""], "Lloyd Woods": ["\"M. C.\"", "\"Master of Ceremonies\"", "\"Wittiest of M.C.'s\"; \"Phillie's Favorite Entertainer\""], "Loraine Humphrey": [], "Lori La Rue": [], "Lou Lorraine": [], "Louis Diggs": ["\"A group of female impersonators, featuring Louis Diggs, gave a boatride on the Robert E. Lee the other night.\"", "\"Queen of Female Impersonators\"", "\"the female impersonator, is a Dee Cee sensaytion.\"", "\"well known and popular Washington cabaret entertainer and female impersonator, who has been able to fool thousands of night club patrons on his sexual identity, but could not fool Uncle Sam who called him in the draft. Louis will have to trim his locks and discard his powder puff for a rifle.:\""], "Louis Edelstein": ["unclear if pansy performer/in drag"], "Louis Strong": [], "Loyce Trent": ["\"Revue is headed by Loyce Trent . . . the 'prima donna'\"; \"Nothing out of the ordinary about their work, which has little chance to get anywhere in this spot, where noise is cultivated.\""], "Luana Lahua": [], "Lucian": ["\"Lucian, who refuses to disclose his real name, today said he and his 'boys' were waiting final word from Michaels as to whether it would be possible to continue their show at the nightclub. Michaels, however, has apparently abandoned his fight against Sheriff Malley, who ordered the show closed. The Chateau maestro has not talked with Lucian since Tuesday. Asked if he had settled terms of his contract with Michaels, which is said to run to July 1, Lucian replied: 'He'll take care of that, all right, he is a fine man.' 'I'm not interested in the contract at all,' he said, 'I'm more concerned at leaving town with a clean record. If I don't hear from Michaels today, I'm going to take my boys to New York tomorrow, where we have an engagement.' Sheriff Malley, who ordered the show to stop after last Saturday's performance, today said the case was closed as far as he was concerned. Public Safety Commissioner Walter P. Cox today again stated he had received no complaints about the playboys who are staying at a downtown hotel. He said he was 'not looking for trouble' and that no steps would be taken unless complaints are received about the troupe.\"", "\"The Male Sophie Tucker\"; \"Last of the Red Hot Papas\"", "\"The Voice In a Million\"", "\"wry quips with ringsiders\"; \"male Sophie Tucker\"; ", "From Club Richman"], "Luis Valencia": [], "Lunch Twins": [], "Luring female impersonator(s)": ["a \"flashily-dressed man who police say was lured up an alley . . . by female impersonators,\" was then \"beated to death by a gang of youths seeking to rob him.\""], "Luzetta Hall": [], "Lyle Mack": ["\"America's Most Beautiful Boy\"", "\"Impersonating Shanghai Flo\"", "\"Most beautiful boy in America. —Walter Winchell\"", "Inferring that Lyle Mack was present since he was there on the 9th and the 22nd."], "Lyle Page": ["\"Legerdemain\"??", "\"Lyle Page and his Broadway Playboys closed at the Cat and Fiddle and are due to open at the Lakeview . . . January 18.\"", "\"Mystery Boy Soprano.\" While Lyle Page is not used in the ad, Syracuse Journal, April 19, 1935, 37 (b)  corroborates Lyle Page's name.", "\"in His Passion and Thrilling Persian Dance\"", "For legal name, see See Syracuse Journal, November 5, 1935, 18", "MC", "Not 100% it is the same Lyle Page", "While Lyle Page is not used in the ad, Syracuse Journal, April 19, 1935, 37 (b) corroborates Lyle Page's name"], "Lynn & Johnson": [], "Lynn Carter": [], "Lynn Castle": [], "Lynn Overman": [], "Lynne Carter": [], "Mack Youge": [], "Madam Dubarry 1": ["The evidence presents two performers who went under the same name (which was not uncommon), see Baltimore Afro-American, January 12, 1935, 9"], "Madam Dubarry 2": ["\"creating a sensation with his song-and-dance routine.\" \"new-comer here, is breaking into the clubs via the guest route.\"; the evidence presents two performers who went under the same name (which was not uncommon), see Baltimore Afro-American, April 6, 1935, 8"], "Mae Arthur": [], "Mae Kelly": ["\"Master of Ceremonies\""], "Magda Andre": ["Not sure whether they were part of the Gay Boy Revue?"], "Maile Ricati": ["\"Native Hawaiian Dancer\""], "Maisie La France": ["Fan and Muff Dancer - unclear if in drag"], "Male Libby Holman": [], "Manhattan Pearl": ["\"A new entertainer from the East . . . a versatile female impersonator from New York City and Pittsburgh. This artist who has already been introduced in a four week's engagement at the Chocolate Bar, sings in Russian, Jewish, and features toe-dancing, and has already won much generous local applause.\"", "\"Manhattan Pearl, vivacious female impersonator, with a 'ready' chorus of keen little chicks . . .\"", "\"a clever female impersonator, who has a way with her. 'She tips like rip and gets off something awful,' does Manhattan Pearl, and we know of certain individuals who've spent a goodly portuon of their pay envelopes to see her perform. She's one of the marvels of the age, and she's a swinger.\"", "\"one of the greatest female impersonators in the country . . . where the best of both races go for diversion and 'different' amusement. Svelte, full of personality, and charming withal, this 'ace' performer is being sought by a number of Eastern night clubs.\"", "\"wears his gowns on the street half the time.\" at a \"Little Harlem\" spot..."], "Manuel DeMonte": [], "Marcelle": ["\"Acrobatic Dancer Supreme\""], "Marcia Lloyd": ["\"On the same floor Marcia Lloyd, . . . for the male hearts.\""], "Margaret Cook": ["Margaret Cook and Ted Cook together perhaps?"], "Marge Brown": [], "Margie Mansell": ["\"singer\""], "Marie Shaffer": ["Blues Singer Of All the Latest Hits - unclear if in drag"], "Marilyn Monroe": [], "Marion Reilly": [], "Marjoram": ["Fan Dance - unclear if in drag", "Sensational Hula and Fan Dancer - unclear if in drag"], "Marjorie Jaune": ["\"Rhythm and Tap\""], "Marsha Michaels": [], "Martha Rogers": [], "Martin F. May": [], "Martin Wynne": ["\"of Wallace st. near 16th\""], "Marty Deem": [], "Marvene Nelson": [], "Mary Brennen": [], "Mary McLaughlan": [], "Marylin Thomas": [], "Matt Berger": ["\"Matt Berger Presents\"", "\"Matt Berger presents\"", "\"presented by\" = may be only producer and not on stage", "\"producer of the novelty\""], "Maurice —": [], "Max Bellow": [], "Max Lengel": ["Producer?"], "Max Thorman": [], "Maxine": ["\"Comedian\"", "\"comedian\""], "May West of the East": ["\"a female impersonator\""], "Mei Lan-Fang": [], "Melba": ["Becomes a father"], "Melvin Evans": ["\"Very Gay\" - yet no indication of drag\n", "MC"], "Merry Pickford": ["\"Male Sally Rand Fan Dancer\"", "\"THE MALE SALLY RAND Dancing Her FAN and BUBBLE Dance\"", "\"The Male Sally Rand Fan Dancer in New and Original Dance Creations\"", "\"after eight weeks at Washington Club, East Liverpool, O., is heading east.\"", "\"male Sally Rand\"; \"featuring\"", "\"the Male Sally Rand\"", "from Canada?!", "male Sally Rand"], "Michal Michalesko": ["\"the only female impersonator on the Yiddish stage\""], "Mickey Arnold": ["(I accidentally removed the comment here...)"], "Mickey Comforte": [], "Mickey Dell": [], "Mickey Marlow": ["fan dance"], "Mickey Mercer": ["M.C. \"The only girl in the company\""], "Mickey Nelson": ["\"Classical Tap Dance\"", "\"Classical Tap Dancer\"", "\"Personality Boy\"", "Named inferred from Warren Times Mirror, June 12, 1935, 2"], "Mickey Siegmund": ["\"Dance of Veils\""], "Mickey Standley": [], "Mickey Strauss": [], "Mildred Martin": ["\"The Second Sophie Tucker\""], "Mildred Zohler": [], "Mildred —": [], "Miller & Martin": ["\"International Dance Team\""], "Milton": ["\"Milton, Paul, and Dorneay are dancers and singers,\"; \"Nothing out of the ordinary about their work, which has little chance to get anywhere in this spot, where noise is cultivated.\""], "Milton LaMaire": ["\"in top billing, is slender, dark and delicate. Gets a great big hand for his well-costumed impersonation skit, as well as for straight numbers, being the only one of the group furnishing the 'out of impersonation' specialties. Especially pleasing is the gazelle-eyed Milt in his tap dance in top hat and tails and his striking Indian war dance colorfully performed.\""], "Miss Broadway Rose": [], "Miss Whitie": [], "Mitzi": ["Could not be Mitzi Mantis who had been murdered already."], "Mitzi Fellows": ["\"Direct from Harlem In Songs and Dances\""], "Mitzi Mantis": ["\"He had been the torch singer of the resort [Rhythm Club], wearing a dazzling gown that revealed his powdered shoulders, and a wig of dainty curls. A chorus of other female impersonators had minced around him during his numbers. But Mitzy had far outshone the others.\" — \"Mitzy, also known as Agnes, had come of respectable parents and had received a fairly good education. When jobs became hard to find, during the depression, he had drifted into Pittsburgh night life. At the Rhythm Club, the town's most notorious resort, he had found his level as a singing female impersonator.\"", "This article describes him as George (Mitzi) Mantis, 19 years old...?"], "Mona La Fountaine": ["\"has the 'freak soprano' voice\""], "Monica Rey": [], "Morris Kinney": [], "Mother Smother/Sepia Marlene Dietrich": ["\"Joe is a well-seasoned performer. Besides singing and dancing very well, he has youth and loads of personality.\"", "\"One of the larger of the New York nite spots was going to offer 'Mother Smothers,' of Baltimore fame, a juicy amount of what it takes for coffee and cakes, but no can do now because of the police warning to all New York nite spot owners about hiring female impersonators. One of the funniest cartoons in the current edition of Esquire is by E. Simms Campbell, with the caption: 'And remember, none of that hi-de- do stuff.\"", "\"inimitable female impersonator and dancing parody-singer, Joe Smothers, who had the throng in a snappy mood during his renditions.\""], "Murray Lenen": ["singing waiter \"who entertain with female impersonations in addition to their other duties\" arrested and fined \"on charges of selling liquor, but none of the five was able to produce the money and all went to Mineola jail\""], "Murray Swanson": ["From Club Richman"], "Mystery Dancer": [], "Nada Bryant": ["in the chorus. uncertain whether she was in drag. Here, it's written that she \"never cease to amaze the customers\""], "Nadine Norman": ["\"Pretty and Vivacious Soubrette\""], "Nadja": [], "Najean Loy": [], "Nan O'Rourke": [], "Nancy Cauel": [], "Nancy Kelly": [], "Nankee Low": [], "Naomi Davis": ["\"female impersonator\""], "Nazi Mova": [], "Ned Lynn": ["\"Al De Marco and Ned Lynn, a swell ballroom team, are one of the highlights of the show.\"", "Names corroborated by Billboard, December 28, 1935, 42"], "Neil Dornay": ["\"a dancer\"; \"Nothing out of the ordinary about their work, which has little chance to get anywhere in this spot, where noise is cultivated.\"", "Opener for women's wrestling match!", "credited as \"exotic dancer\""], "Nellie Durkin": ["likely a \"pretty girl\" in the ensemble"], "Nicki Gallucci": ["\"ADDED ATTRACTION . . . OUR MALE LILY PONS\"", "\"Catch Nicki Gallucci's turn at the one and only Finocchio's. In fact, catch the whole revue. Then you'll have some idea of why this spot draws 'em in week and week, come rain or shine, neon or blackout\"", "\"Golden Voice Soprano\"", "\"Handsome master of ceremonies\"", "\"Later Gallucci states that his gowns are those worn by Constance Bennett in her latest picture\"", "\"Nicholas Galouchie is a recent addition to the show. Since his debut at the Club Richman he has received the praise of both the diversion seekers and the local press.\""], "Niki Nash": [], "Niles Marsh": ["\"America's Foremost Female Impersonator—Direct From the Hollywood Bowl\"", "\"America's Foremost Female Impersonator—Direct [to Sun Shade Inn in Phoenix (AZ)] From the Hollywood Bowl\"", "\"Direct From Sensational Engagement at Mexico's Smartest Night Clubs\"; \"America's Foremost Female Impersonator, Presenting His Famous Impressions in Dazzling Gowns\"", "\"Female Impersonator\"", "\"He's Back Again!\"; \"Scintillating Singing Star\"", "\"the country's leading female impersonator\"", "unclear who was in drag or not here"], "Nina Mae McKinney": ["\"World's Great Female Impersonator\"", "\"World's Greatest Female Impersonator and Dancer\", \"Direct from Cabin Inn, Chicago\"", "Nina Mae McKinney is the correct name as per The Chicago Defender 14 Aug 1937, 9.", "a female impersonator and one of the best I've seen... contact me Nina!"], "Nina Montez": [], "Nina Rae": ["\"hostess, keeps everybody happy\""], "Nine Collegians": [], "Nita Velez": ["\"Spanish and Mexican Dances\" but no indiciation of drag", "\"Spanish and Rhumba Dancer\"; Not in drag", "\"is a newcomer on the bill, coming direct from Mexico City. She rhumbas the way the rhumba should be rhumba'd. She also does the Spanish the way the Spanish should be properly Spanished.\"", "Spanish and Mexican Dances"], "Nora Corona Hancock": [], "Norm Priest": [], "Norma Jean": [], "Norman Lewis": ["\"acrobatic dancer, who has just finished an extended engagement with Sally Rand\""], "Oasa Jaane": ["\"Venus of Gold Repeats Her New Sensational Dance\"", "I don't think this was a drag act.... Here it appears that she appeared in conjunction with the Gay Boy Revue..."], "Olyn Landick": ["\"noted female impersonator, as he will appear in the comedy, 'Personal Appearance,' to be given by a professional cast at Avery Memorial . . .\"", "\"would be better if he cut out the salacious material\"", "femme imp monologist"], "Ora Monte": ["\"With\", \"Exotic Dancer\""], "Oscar Widmann": [], "Ozie Anderson": [], "Page & Hudeck": ["\"Sensational Dance Team\""], "Palafox": [], "Paris Delaire": [], "Pat Clayton": [], "Pat Paree": [], "Patricia Van Dyke": [], "Patsy Campbell": [], "Patsy Keller": [], "Patty Baker": [], "Patty Lyons": [], "Paul": ["\"Milton, Paul, and Dorneay are dancers and singers,\"; \"Nothing out of the ordinary about their work, which has little chance to get anywhere in this spot, where noise is cultivated.\""], "Paul Coleman": [], "Paul Gilrey": ["\"Singer of Sweet Songs\"", "\"The five, some with wigs and others with naturally curly hair, were herded into the jail Tuesday night by deputy sheriffs who said they learned some bubble and strip tease dances were being staged at the night club. They all pleaded not guilty to charges of outraging public decency when arraigned before Charles W. Conner, common pleas judge. W. J. Stander, manager of the club also pleaded not guilty to the charge and was placed in jail in lieu of $1,000 bond. The other five charged are Frances Lee, 206 South Robinson avenue, Joe LaMar, Cincinnati, Ohio; Gene Marlee, Cincinnati; Jackie Dayton, Detroit, Mich., and Paul Gilvre, Terre Haute, Ind.\"", "Name corroborated by The Daily Oklahoman, February 10, 1938, 21"], "Paul La Page": ["\"dance principal\""], "Paul Russell": ["\"King of the Marinettes\"", "\"King of the Marionettes\"", "\"MALE GYPSY ROSE LEE . . . Also the Most Outstanding Female Impersonator in the Country\" -- interesting gendering: \"She's Terrific\"!"], "Paul White": ["Performed with Sophie Tucker"], "Paulette La Pierre": [], "Peaches": [], "Peaches Browning": ["\"featured in a torrid scene, 'Turn On That Red Hot Heat'\""], "Peaches Buckingham": [], "Peggy Joyce": ["\"Peggy Hopkins Joyce\"", "\"did the 'ladies' show off. Everything was all right until 'Peg's shoulder strap broke.\"", "\"latest cafe sensation in St. Louis, appearing at the Golden Lily. The long black tresses which fall loosely about her shoulders, the 'come hither' look in her eyes, the entrancing smile . . .\"", "\"one of the nation's ace female impersonators, is truly creating a sensation here. Joyce's real name is Sam Fouche and a native of Chicago. He is a great attraction here and is appearing nightly at Pop Solomon's 'Golden Lily . . .\"", "\"sensational\"", "\"the female impersonator, week-ended it in Chi and returned to her St. Antoine Tavern in Detroit.\"", "\"the sepia female impersonator\""], "Peggy Malone": ["\"Pretty and Vivacious Soubrette\""], "Pep Murray": ["\"Impersonating Mae Murray\"", "\"Sensational Redhead\"", "\"That Scintillating Redhead\"", "Named inferred from Warren Times Mirror, June 12, 1935, 2"], "Pepe Blaire": ["\"Male Joan Crawford\""], "Pepper Cortez": ["Opener for women's wrestling match!"], "Peppy Carman": ["Could be same as Alfred Carmen?", "MC"], "Peter Joray": ["\"An artist in pantomime and female impersonator . . . held the interest of his audience throughout his performance Thursday night at Scottish Rite Auditorium.\" + many descriptions of the routines...", "\"world-famous impersonator\"; During college, \"he discovered that he could hold his face in such a way as to look like Queen Victoria. Working from the moment of that discovery, he built up a considerable repertoire of moments with 'Her Late Majesty,' ranging from rowdy bits as when she went to concert after, consuming too much grouse, to the exquisitely imagined and deeply touching glimpse of her watching the dedication of the Albert Memorial, presenting all in costume.\""], "Petite Swanson": ["\"sings the blues you like to hear\""], "Phil Black": ["Fourth prize winner at the ball"], "Phil Craig": ["\"'Quicker than You Can Say Jack Robinson\"", "\"Singer of Popular Songs\"", "\"Singing 'Lost'\""], "Poppy Lane": [], "Prince Hanalei": ["\"World's Only Male Exotic Dancer\" + \"Cast of ten Boys will be GIrls\""], "Princess Diane": ["\"in Her Powder Puff Dance\"", "\"in her Powder Puff Dance\""], "Pudgy Roberts": ["\"Bawdy, salty fun is the theme of his impression of a stripper. This stripper has four-inch eyelashes, oversized Clark Gableish ears, a cupid's-bow mouth and a sassy, arrogant manner. He peels down a dozen times or more to panties trimmed with cow bells, bouquets, tiger heads, dead fish, etc.\""], "Queen Robi": ["\"Tap dancer, spanish and popular singer; female impersonator; booking club dates through Vernon Hoff exclusively. Queen Robi\""], "Queenie": [], "Rae Bourbon": ["\"The Gay, Fabulous Ray Bourbon\"", "\"clever female impersonator from the Club Auby Laggon at Miami will also appear [at the Garrick Theatre of St. Louis this Saturday].\"", "\"may have the naughtiest repertoire in town, but he is one of the finest artists to ever hit Miami.\"", "\"new to the Angel and this zany comedian with the soprano hips is better than Jean Malin was in his heyday. Bourbon has a madcap manner and, properly spotted in a production, would be quite a wow. Jacoby's main problem is to keep him under proper constraint, although he's never overboard. It's not his wordage, however, as much as his mien and manner.\"", "\"recently became a female (via surgery), has a 10-karat engagement ring from his September groom-to-be.\"", "\"was added to the show to bring in the night club crowd . . Using double entendre material\"", "8 week contract", "Alongside Rosita, \"Dance of the Hands\"; definitely appearing; in drag", "Appeared in the Mexicana Room, \"with his gay songs and gay stories\"", "Arrested \"wearing the clothes of the opposite sex\"", "Bourbon is top-billed and publicizing the show under same name as in west coast town.", "Called \"Jean Malin's successor\" in promotional material", "Called \"West Coast comic\" - and a \"smooth, fat guy\" who carries the \"laugh load.\" He does female impersonators, unsure whether he was in drag", "Direct from The French Quarter in New Orleans", "His role is called \"a Nance dressmaker . . . He may be the year's discovery.\"", "Name not actually mentioned; \"found . . . guilty of staging an indecent show\"", "Played Bowery Rose, a \"fem Bowery shoplifter,\" reviewed as \"a rich bit\"", "Unclear whether this was in Matawan, NJ?", "also performed under \"Birmingham Berta\"?", "arrested for being \"A male entertainer dressed in woman's clothing doing an alleged lewd dance.\"", "arrested last night . . . in her bow at the Melody Room here on a charge of impersonating a woman.", "came here recently from New York", "first show after sex change", "five years here", "has been associated with local niteries for some time", "holding the spotlight for over a half-hour with a routine of original yrics and take-offs of the fems. . . . reaches way down in gutter for good portion of his material.", "modeling new dresses, ensembles, and coats.", "routines \"Pocahontas,\" \"Tepee for Two\" and \"Fortune Teller\"", "something really worth while in the theater . . . Has no superior at pantomime.", "told Judge . . . that he was a paid performer . . . and had not appeared on the street in female attire.", "unclear if he was in drag", "unclear if he was performing in drag here but his performance is called \"delicate ditties\"", "working in drag"], "Ralph Berkowitz": [], "Ralph Gilbert": ["\"Acrobatic Dancer\"", "\"Ballad Singer\"", "\"International Male Toe Dancer\"", "\"Twisted Rhythm\"", "\"acrobatic dancer\"", "\"dancer\"", "\"toe dancer\"", "credited as \"Sensational Acrobatic Dancer\""], "Ralph Miller": ["operator (likely not in performance, still listed here due to close alignment with culture)"], "Ram'ee": ["\"Sequin Muff Dancer\""], "Ramon Strobeck": ["Producer?", "producer"], "Randi Lete": [], "Rani Dorzi": ["\"Shawl and Veil Dance\"", "\"The venus of blond shawl dancers\""], "Ray Erline Garrison": [], "Ray Foster": [], "Ray Francis": [], "Ray Hall": ["\"Female Impersonator\"", "\"Prima Dona [sic]\""], "Ray James": [], "Ray Murray": ["\"a female impersonator at a night club here [Kansas City], was found shot to cide [sic]. He left no note and friends were unable to advance a reason for death in his apartment today. Authorities said Murray committed sui-his act.[sic]\"", "\"a female impersonator at a night club here [Kansas City], was found shot to death in his apartment today. Authorities said Murray committed suicide.\""], "Ray Saunders": ["\"The Toast of San Francisco\""], "Ray Shannon": ["\"For laughs Shannon goes femme impersonator, but the talk is none too strong.\"", "sub as female impersonator"], "Ray Wray": [], "Raydell": [], "Red Evans": ["\"With them [Jess Hawkins and his Virginians, performing as part of the Kennywood (carneval?)] again returns 'Red' Evans, girl impersonator and male 'boop' singer. His long cirly wig, high hat and all are to come back.\""], "Reeder Richards": [], "Reggie \"Dolly\" Windsor": ["\"Sweet with Personality\""], "Reggie Dahl": [], "Rene De Carlo": [], "Renee Del Rio": [], "Rhodie Kinsella": ["arrested"], "Richard Bach": [], "Richard Carlson": [], "Richard Lansin": [], "Richard McLean": [], "Richard Snooks Davis": [], "Rickey San Juan": [], "Rita Maxwell": [], "Robbi Ross": [], "Robert A. Lyons": [], "Robert Fagan": [], "Robert Long": [], "Robert P. Philip": [], "Roberta Beebe": ["Exotic dancer but no indication of drag"], "Rocky twins": ["dressed as girls, are daintier than any of the back stars."], "Rodney Griffin": ["MC"], "Roger Davis": [], "Rollie Andrews": [], "Roni Warren": ["\"I was poetry-writing madly in love with him [Roni Warren/John K]. Connie had him; I never dig. I wrote a series of verses to him, kissed him passionately in backyards during graduation parties, made wild starstruck love to him in the local Lover's Lane (now massed with apartment houses), and after graduation lost him. I can only fhink that my passion for John K was genuine love—young love, and that is why when he finally wanted to go to bed with me I rebelled—still considering sex a thing apart from love. Years later, we did go to bed, in Connie's room, but it was a disaster at which we both laughed. This happened while John was visiting during one of his appearances at [the Club Richman, bandleder] Harry Richman's drag club. John became, as 'Roni Warren,' a popular drag queen entertainer—New York, Miami, Saratoga. He also worked as a call 'girl.' John introduced me to the drag world, the pickup world, the real underbelly of homosexuality. He introduced me to queer speakeasies. These were in flats on West Seventy-second Street, where males met, more to pick one another up than drink.\"", "\"Something Different\"", "\"The Male Mae West\"", "\"a Mae West type\"", "\"former emsee at Club Paree, Hartford, Conn., heads the show at El Morocco there.\"", "\"second year as emsee at the Club Paree\"", "Later same as Bobby Brennan?", "MC", "not 100% sure this is Roni Warren"], "Roxy": [], "Roxy King": [], "Roy Houk": [], "Roy Whitemore": [], "Ruth Pine": [], "Ruth Roberts": ["\"Toe Tap\" unclear if in drag"], "Sahdji": [], "Sally": [], "Sam Silvers": [], "Sammy Grand": [], "Sammy Lewis": [], "Sandra": ["Washington DC-based"], "Sandra Fields": [], "Sandy Lynch": [], "Sandy McPherson": [], "Satch and Satchell": [], "Sepia Gloria Swanson": ["\"For years Gloria has been one of the outstanding floor show personalities and in his latest role as headliner at the Britwood, the impersonator's work is supreme.\"", "Dead after a year of illness. Born in Atlanta, moved to Chicago at an early age. Said to have started \"the vogue for adopting the names of noted women in the entertainment world. He was also said to have been one of the first to adopt feminine dress entirely, and was often seen in gorgeous evening gowns, costly furs, high heel shoes, etc.\"", "Dead at 33 years old.", "Dead. The column makes it sound like Swanson died in a train wreck but in actuality from disease.", "Legal name here is \"Mr. Winston,\" full legal name corroborated by Afro-American, December 24, 1932, 18.", "appeared with Bobbie Howell, female saxophonist"], "Sepia Greta Garbo": [], "Sepia Mae West": ["\"'Mae' Looks like anything but a member of the puzzle sex.\" \"At present he em-cees for the Cabin Inn and the crowds come nightly. Whether in male clothes or slinky velvet gowns with tinted toenails he offers a tonic for jaded diners and dancers.\"", "\"An important night club note that should have been recorded before now is that Mae West, the creole fashion plate, one of the foremost female impersonators of the present time, is headlining at the 1-0-1 Club in West 139th street. Probably one of the reason [sic] Impresario MacDonald will have to enlarge his emporium to accommodate his overflow patronage.\"", "\"Brown Mae West\"", "\"Had a nice long visit from that clever female impersonator, . . . Dickie is just back from the coast after making a few weeks on the lots of Hollywood, at present is arranging for a hurried return trip only giving his old friends a few days to enjoy his congenial company.\"", "\"He tells me that he has gone into this art purely from an artistic standpoint. Personally, I think that he has made a good job of it.\"", "\"female impersonator who is well-known under his character name of Mae West, opened Friday night at the Cabin Inn, exactly five days after his arrival from Hollywood. Barrows left Chi last year for the film colony, where he was given a part in Al Jolson's and Cab Calloway's 'Singing Kid,' he had a speaking part in 'The Green Pastures,' and a part in Cecil B. DeMille's unreleased film 'Plains,' . . .\", \"Dick Barrows leads a double life in the revue. He acts as both a master of ceremonies and a 'mistress of ceremonies.' His gown in the Mae West characterization is gorgeous blue velvet with ostrich feathers. He dons a platinum wig for a number which climaxes the revue.\"", "\"headline attraction\"", "\"returned to the city last week and will be seen nightly . . . Big Ivy, owner of the place, plans a public welcome for his star who returned with three trunks of the latest creations in gowns.\"", "\"special performance at the Fourth of July dance\"", "\"struck and killed an unidentified man\" \"Barrows was released.\"", "producer!"], "Shirline": ["3rd prize winner"], "Sid Ward": ["\"Hi-de-Ho King and M.C.\"", "\"dancer\""], "Skelly": ["2nd prize winner"], "Skip Arnold": [], "Soni Sinclair": ["\"brilliant wit and comedy\""], "Sonny Clapp": [], "Sonny Dell": [], "Sonny La Rae": ["\"doing a modern interpretation of Ravel's Bolero\""], "Sonny O'Shea": [], "Sonny Teal": ["\"Darling of the Dance\""], "Stacy Stevens": ["\"striptease sensation\""], "Stanley E. Caulfield": ["Legal name written as \"Stanley E. Canfield\""], "Stanley Jabin": ["Operator but likely not performer: \"ran Torch Club in Miami, is starting another one with the same name Wednesday\""], "Stanley Rogers": [], "Steel Smith": ["Washington DC-based"], "Storme Delarvarie": [], "Stuart P. Murphy": ["\"What a Man\""], "Sue Austin": [], "Sunny La Ray": ["\"Table Tap Dancer\""], "Sunny Lane": ["\"Fan Dancer\""], "Sweet Mama Sue": [], "Syd Chaplin": [], "Sylvan Repetti": ["credited as a \"snake dancer\"", "pending Pleasure Man trial"], "Sylvia Rose": ["mistress of ceremonies"], "T. C. Jones": ["TODO: Includes some description"], "Tangara": ["\"Bombshell of Rhythm\"", "\"Exotic Personality of the Dance\"", "\"That Bombshell of Rhythm\""], "Tanya": [], "Tanya Del Ray": [], "Tanya Garth": ["\"mistress of ceremonies\" - unsure if in drag"], "Taps Harris": ["\"Holdovers Taps Harris, of the syncopated feet\"", "\"Sensational Colored Streak of Rhythm\"; Not in drag"], "Ted Cook": ["\"Superlative Dancing Star\""], "Ted Lewis": [], "Ted Richards": [], "Ted Shaw": ["\"Incomparable M. C.\""], "Teddie Stanton": ["\"Pretty and Vivacious Soubrette\""], "Teddy Cappy": [], "Teddy Hayes": [], "Teddy Keller": [], "Teddy LaTour": ["Only called \"impersonator,\" unclear if in drag"], "Teddy —": [], "Termaine de Milleo": ["\"the Original Golden Girl\""], "Terry La Monte": ["\"comedy deluxe as male Jean Harlow\"", "\"male Jean Harlow\"", "\"who closely resembles the late Jean Harlow\"", "MC"], "Terry Lane": ["\"Tease Supreme\""], "Terry Phillips": ["\"impersonations extraordinary\""], "Terry Stone": ["\"The Shore's Favorite Dancer\""], "Terry Tremaine": [], "Tess Russell": [], "Tex Hendricks": ["\"Tex Hendricks is emsee of the 41 minute show, and the swishies are on the floor often, either as a chorus or for specialties. Tex is a nice emsee, with a pair of shoulders that would put most footballers to shame.\"", "Appeared as \"sepia dame\"", "Dead at age 51 (?).", "Likely him anyway... Referred to as Francis Hendricks in the article. \"Another addition to the Club Richman show [Jack Mason's Playboy Revue] is Francis Hendricks who is acting as master of ceremonies for the Playboy unit.\"", "MC", "one of them is a \"femme impersonator, in blackface\""], "Texas Plant": [], "The Duchess": [], "The Great Melba": [], "The Mystery Dancer": ["\"daring and diverting dances\""], "Thelma Lee": ["headliner"], "Thelma Trail": ["Exotic dancer but no indication of drag"], "Thelma the Great": [], "Theodore Coppi": ["Legal name written as \"Theodore Cappi\""], "Thetis Storey": [], "Thomas Martin": ["Name inferred from Times Union, July 23, 1935, 15"], "Thompson Twin 1": [], "Thompson Twin 2": [], "Thornton Ross": [], "Tiny Kingsmore": ["\"7 ft. 10 1/2 in. of song\""], "Tish": [], "Titanic Kit Russell": ["\"Female Impersonator Extraordinary\"", "\"Tallest of the Show Boys\"", "\"Titanic, tallest of the showboys, is beheld over for a fourth week.\"", "\"handsomest and tallest of the New York showboys\"", "\"opened his ninth week as a headliner in the New Look Club's 'Gay Boy Revue.' Known as the 'tallest of the showboys,' Titanic is recognized as one fo the outstanding female impersonators. His delivery of songs is of the Mae West school and he has the same throaty voice.\"", "From Uniontown, PA", "Headliner: \"handsomest and tallest of the New York showboys\""], "Toby Waddell": ["Name corroborated by Lansing State Journal, July 20, 1936, 14"], "Tod Allen": [], "Tom Hose": ["MC"], "Tom Martelle": ["\"World-Famous Impersonator!\""], "Tommy Lester": [], "Tommy Mann": ["he's the one behind the College Flirt sketch.. one of the few that we have documented!", "whoever is tallest, is referred to in the review as having done a female impersonation. I am guessing it is Tommy Mann based on \"Los Angeles: Orpheum,\" Variety 92, no. 7, August 29, 1928, 62."], "Tommy Williams": [], "Toni Midnite": ["\"World's Most Beautifully Gowned Boy\"", "Male Hedy Lamarr"], "Tony & Eddie": ["A lot of their work is in drag, and they create comedy moods with their costuming. Eddie Gruber \"worked from a wheelchair, because of a physical disability . . .\""], "Tony Collins": ["\"'Fairy Dance' promoter' getting ready for his last 'Drag Ball' . . . will he have a mob at Elk's hall next week?\""], "Tony Karol": [], "Tony St.Cyr": [], "Toots": [], "Trosky": [], "Unnamed fan dancer in Philadelphia": ["\"Music blared, a fan dancer swished her fans. Two hundred patrons of a night club were watching the show. Suddenly a score of policement rushed into the club and arrested the dancer and the proprietor. The officers found the fan dancer was a female impersonator.\""], "Unnamed girl impersonator": [], "Unnamed impersonator at Torch Club": ["\"Enjoy the Oriental Fantasy. Thrill to Beautiful Songs. They Will Positively Slay You.\""], "Unnamed male fan dancer at Oasis": [], "Unnamed male stripper 1": [], "Unnamed male stripper 2": [], "Unnamed male stripper at Tobacco Road 1": [], "Unnamed male stripper at Tobacco Road 2": [], "Unnamed male stripper at Tobacco Road 3": [], "Unnamed member of Mercer Brothers": [], "Unnamed member of chorus at King's Terrace 1": [], "Unnamed member of chorus at King's Terrace 2": [], "Unnamed member of chorus at King's Terrace 3": [], "Unnamed member of chorus at King's Terrace 4": [], "Unnamed member of chorus at King's Terrace 5": [], "Unnamed member of chorus at King's Terrace 6": [], "Unnamed member of chorus at King's Terrace 7": [], "Unnamed member of chorus at King's Terrace 8": [], "Unnamed member of the Ladell Trio": [], "Unnamed member of the West, Lake, and Hane trio": [], "Unnamed performer 1 from The Mimic Men": [], "Unnamed performer af Frank White's 11": [], "Unnamed performer at 9 Mile House 1": [], "Unnamed performer at 9 Mile House 10": [], "Unnamed performer at 9 Mile House 11": [], "Unnamed performer at 9 Mile House 12": [], "Unnamed performer at 9 Mile House 13": [], "Unnamed performer at 9 Mile House 14": [], "Unnamed performer at 9 Mile House 15": [], "Unnamed performer at 9 Mile House 2": [], "Unnamed performer at 9 Mile House 3": [], "Unnamed performer at 9 Mile House 4": [], "Unnamed performer at 9 Mile House 5": [], "Unnamed performer at 9 Mile House 6": [], "Unnamed performer at 9 Mile House 7": [], "Unnamed performer at 9 Mile House 8": [], "Unnamed performer at 9 Mile House 9": [], "Unnamed performer at Anchor Nite Club 1": [], "Unnamed performer at Anchor Nite Club 10": [], "Unnamed performer at Anchor Nite Club 11": [], "Unnamed performer at Anchor Nite Club 12": [], "Unnamed performer at Anchor Nite Club 13": [], "Unnamed performer at Anchor Nite Club 2": [], "Unnamed performer at Anchor Nite Club 3": [], "Unnamed performer at Anchor Nite Club 4": [], "Unnamed performer at Anchor Nite Club 5": [], "Unnamed performer at Anchor Nite Club 6": [], "Unnamed performer at Anchor Nite Club 7": [], "Unnamed performer at Anchor Nite Club 8": [], "Unnamed performer at Anchor Nite Club 9": [], "Unnamed performer at B.B.B.'s cellar 1": [], "Unnamed performer at B.B.B.'s cellar 10": [], "Unnamed performer at B.B.B.'s cellar 2": [], "Unnamed performer at B.B.B.'s cellar 3": [], "Unnamed performer at B.B.B.'s cellar 4": [], "Unnamed performer at B.B.B.'s cellar 5": [], "Unnamed performer at B.B.B.'s cellar 6": [], "Unnamed performer at B.B.B.'s cellar 7": [], "Unnamed performer at B.B.B.'s cellar 8": [], "Unnamed performer at B.B.B.'s cellar 9": [], "Unnamed performer at BBB's": [], "Unnamed performer at Band Box 1": [], "Unnamed performer at Band Box 10": [], "Unnamed performer at Band Box 2": [], "Unnamed performer at Band Box 3": [], "Unnamed performer at Band Box 4": [], "Unnamed performer at Band Box 5": [], "Unnamed performer at Band Box 6": [], "Unnamed performer at Band Box 7": [], "Unnamed performer at Band Box 8": [], "Unnamed performer at Band Box 9": [], "Unnamed performer at Bird's Cage 3": ["Name inferred from Times Union, July 23, 1935, 15"], "Unnamed performer at Bird's Cage 4": ["Name inferred from Times Union, July 23, 1935, 15"], "Unnamed performer at Bird's Cage 5": ["Name inferred from Times Union, July 23, 1935, 15"], "Unnamed performer at Bird's Cage 7": ["Name inferred from Times Union, July 23, 1935, 15"], "Unnamed performer at Bird's Cage 8": [], "Unnamed performer at Blue Danube 1": [], "Unnamed performer at Blue Danube 2": [], "Unnamed performer at Blue Danube 3": [], "Unnamed performer at Blue Danube 4": [], "Unnamed performer at Blue Danube 5": [], "Unnamed performer at Cabin Inn 1": [], "Unnamed performer at Cabin Inn 2": [], "Unnamed performer at Cabin Inn 3": [], "Unnamed performer at Cabin Inn 4": [], "Unnamed performer at Chi Chi Club": [], "Unnamed performer at Club Ambassador 1": [], "Unnamed performer at Club Ambassador 10": [], "Unnamed performer at Club Ambassador 11": [], "Unnamed performer at Club Ambassador 12": [], "Unnamed performer at Club Ambassador 13": [], "Unnamed performer at Club Ambassador 14": [], "Unnamed performer at Club Ambassador 2": [], "Unnamed performer at Club Ambassador 3": [], "Unnamed performer at Club Ambassador 4": [], "Unnamed performer at Club Ambassador 5": [], "Unnamed performer at Club Ambassador 6": [], "Unnamed performer at Club Ambassador 7": [], "Unnamed performer at Club Ambassador 8": [], "Unnamed performer at Club Ambassador 9": [], "Unnamed performer at Club Chateau 1": [], "Unnamed performer at Club Chateau 2": [], "Unnamed performer at Club Chateau 3": [], "Unnamed performer at Club Chateau 4": [], "Unnamed performer at Club Chateau 5": [], "Unnamed performer at Club Chateau 6": [], "Unnamed performer at Club Frontenac 1": [], "Unnamed performer at Club Frontenac 10": [], "Unnamed performer at Club Frontenac 2": [], "Unnamed performer at Club Frontenac 3": [], "Unnamed performer at Club Frontenac 4": [], "Unnamed performer at Club Frontenac 5": [], "Unnamed performer at Club Frontenac 6": [], "Unnamed performer at Club Frontenac 7": [], "Unnamed performer at Club Frontenac 8": [], "Unnamed performer at Club Frontenac 9": [], "Unnamed performer at Dante's Inferno 1": ["\"Starring\""], "Unnamed performer at Dante's Inferno 2": ["\"Starring\""], "Unnamed performer at Dante's Inferno 3": [], "Unnamed performer at Dixie Grove 1": [], "Unnamed performer at Dixie Grove 10": [], "Unnamed performer at Dixie Grove 11": [], "Unnamed performer at Dixie Grove 12": [], "Unnamed performer at Dixie Grove 13": [], "Unnamed performer at Dixie Grove 14": [], "Unnamed performer at Dixie Grove 15": [], "Unnamed performer at Dixie Grove 2": [], "Unnamed performer at Dixie Grove 3": [], "Unnamed performer at Dixie Grove 4": [], "Unnamed performer at Dixie Grove 5": [], "Unnamed performer at Dixie Grove 6": [], "Unnamed performer at Dixie Grove 7": [], "Unnamed performer at Dixie Grove 8": [], "Unnamed performer at Dixie Grove 9": [], "Unnamed performer at Durr's Tavern 1": [], "Unnamed performer at Durr's Tavern 2": [], "Unnamed performer at Durr's Tavern 3": [], "Unnamed performer at Durr's Tavern 4": [], "Unnamed performer at Durr's Tavern 5": [], "Unnamed performer at Durr's Tavern 6": [], "Unnamed performer at Durr's Tavern 7": [], "Unnamed performer at Durr's Tavern 8": [], "Unnamed performer at Durr's Tavern 9": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 1": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 10": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 11": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 12": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 2": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 3": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 4": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 5": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 6": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 7": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 8": [], "Unnamed performer at Dwan's Recreation Gardens in 1936 9": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 1": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 10": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 11": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 12": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 2": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 3": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 4": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 5": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 6": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 7": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 8": [], "Unnamed performer at Dwan's Recreation Gardens in 1937 9": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 1": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 10": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 11": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 12": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 13": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 14": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 2": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 3": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 4": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 5": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 6": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 7": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 8": [], "Unnamed performer at Dwan's Recreation Gardens in July 1936 9": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 1": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 10": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 11": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 12": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 13": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 2": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 3": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 4": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 5": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 6": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 7": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 8": [], "Unnamed performer at Dwan's Recreation Gardens in September 1936 9": [], "Unnamed performer at Elm Lodge 1": ["MC; \"Hot-Cha Singer\""], "Unnamed performer at Elm Lodge 10": [], "Unnamed performer at Elm Lodge 11": [], "Unnamed performer at Elm Lodge 12": [], "Unnamed performer at Elm Lodge 13": [], "Unnamed performer at Elm Lodge 14": [], "Unnamed performer at Elm Lodge 15": [], "Unnamed performer at Elm Lodge 2": ["MC; \"Hot-Cha Singer\""], "Unnamed performer at Elm Lodge 3": ["MC; \"Hot-Cha Singer\""], "Unnamed performer at Elm Lodge 4": ["MC; \"Hot-Cha Singer\""], "Unnamed performer at Elm Lodge 5": ["MC; \"Hot-Cha Singer\""], "Unnamed performer at Elm Lodge 6": ["MC; \"Hot-Cha Singer\""], "Unnamed performer at Elm Lodge 7": ["MC; \"Hot-Cha Singer\""], "Unnamed performer at Elm Lodge 8": ["MC; \"Hot-Cha Singer\""], "Unnamed performer at Elm Lodge 9": [], "Unnamed performer at Fox's Savoy": [], "Unnamed performer at Frank White's 1": [], "Unnamed performer at Frank White's 10": [], "Unnamed performer at Frank White's 12": [], "Unnamed performer at Frank White's 2": [], "Unnamed performer at Frank White's 3": [], "Unnamed performer at Frank White's 4": [], "Unnamed performer at Frank White's 5": [], "Unnamed performer at Frank White's 6": [], "Unnamed performer at Frank White's 7": [], "Unnamed performer at Frank White's 8": [], "Unnamed performer at Frank White's 9": [], "Unnamed performer at Garden of Allah 1": ["\"The five, some with wigs and others with naturally curly hair, were herded into the jail Tuesday night by deputy sheriffs who said they learned some bubble and strip tease dances were being staged at the night club. They all pleaded not guilty to charges of outraging public decency when arraigned before Charles W. Conner, common pleas judge. W. J. Stander, manager of the club also pleaded not guilty to the charge and was placed in jail in lieu of $1,000 bond. The other five charged are Frances Lee, 206 South Robinson avenue, Joe LaMar, Cincinnati, Ohio; Gene Marlee, Cincinnati; Jackie Dayton, Detroit, Mich., and Paul Gilvre, Terre Haute, Ind.\""], "Unnamed performer at Garden of Allah 2": ["\"The five, some with wigs and others with naturally curly hair, were herded into the jail Tuesday night by deputy sheriffs who said they learned some bubble and strip tease dances were being staged at the night club. They all pleaded not guilty to charges of outraging public decency when arraigned before Charles W. Conner, common pleas judge. W. J. Stander, manager of the club also pleaded not guilty to the charge and was placed in jail in lieu of $1,000 bond. The other five charged are Frances Lee, 206 South Robinson avenue, Joe LaMar, Cincinnati, Ohio; Gene Marlee, Cincinnati; Jackie Dayton, Detroit, Mich., and Paul Gilvre, Terre Haute, Ind.\""], "Unnamed performer at Garden of Allah 3": ["\"The five, some with wigs and others with naturally curly hair, were herded into the jail Tuesday night by deputy sheriffs who said they learned some bubble and strip tease dances were being staged at the night club. They all pleaded not guilty to charges of outraging public decency when arraigned before Charles W. Conner, common pleas judge. W. J. Stander, manager of the club also pleaded not guilty to the charge and was placed in jail in lieu of $1,000 bond. The other five charged are Frances Lee, 206 South Robinson avenue, Joe LaMar, Cincinnati, Ohio; Gene Marlee, Cincinnati; Jackie Dayton, Detroit, Mich., and Paul Gilvre, Terre Haute, Ind.\""], "Unnamed performer at Grand View Cabaret 1": [], "Unnamed performer at Grand View Cabaret 2": [], "Unnamed performer at Grand View Cabaret 3": [], "Unnamed performer at Grand View Cabaret 4": [], "Unnamed performer at Grand View Cabaret 5": [], "Unnamed performer at Grand View Cabaret 6": [], "Unnamed performer at Knoll's Inn 1": [], "Unnamed performer at Knoll's Inn 2": [], "Unnamed performer at Knoll's Inn 3": [], "Unnamed performer at Knoll's Inn 4": [], "Unnamed performer at Knoll's Inn 5": [], "Unnamed performer at Knoll's Inn 6": [], "Unnamed performer at Knoll's Inn 7": [], "Unnamed performer at La Villa 1": [], "Unnamed performer at La Villa 2": [], "Unnamed performer at La Villa 3": [], "Unnamed performer at La Villa 4": [], "Unnamed performer at La Villa 5": [], "Unnamed performer at La Villa 6": [], "Unnamed performer at La Villa 7": [], "Unnamed performer at La Villa 8": [], "Unnamed performer at Palace Theatre": [], "Unnamed performer at Palais Royal 1": [], "Unnamed performer at Palais Royal 10": [], "Unnamed performer at Palais Royal 11": [], "Unnamed performer at Palais Royal 12": [], "Unnamed performer at Palais Royal 13": [], "Unnamed performer at Palais Royal 14": [], "Unnamed performer at Palais Royal 2": [], "Unnamed performer at Palais Royal 3": [], "Unnamed performer at Palais Royal 4": [], "Unnamed performer at Palais Royal 5": [], "Unnamed performer at Palais Royal 6": [], "Unnamed performer at Palais Royal 7": [], "Unnamed performer at Palais Royal 8": [], "Unnamed performer at Palais Royal 9": [], "Unnamed performer at Plaza Cafe 1": [], "Unnamed performer at Plaza Cafe 2": [], "Unnamed performer at Plaza Cafe 3": [], "Unnamed performer at Plaza Cafe 4": [], "Unnamed performer at Plaza Cafe 5": [], "Unnamed performer at Plaza Cafe 6": [], "Unnamed performer at Plaza Cafe 7": [], "Unnamed performer at Plaza Cafe 8": [], "Unnamed performer at President Cafe 1": [], "Unnamed performer at President Cafe 2": [], "Unnamed performer at President Cafe 3": [], "Unnamed performer at President Cafe 4": [], "Unnamed performer at President Cafe 5": [], "Unnamed performer at President Cafe 6": [], "Unnamed performer at President Cafe 7": [], "Unnamed performer at President Cafe 8": [], "Unnamed performer at Rockland Palace": [], "Unnamed performer at The Broadway 1": [], "Unnamed performer at The Broadway 10": [], "Unnamed performer at The Broadway 11": [], "Unnamed performer at The Broadway 2": [], "Unnamed performer at The Broadway 3": [], "Unnamed performer at The Broadway 4": [], "Unnamed performer at The Broadway 5": [], "Unnamed performer at The Broadway 6": [], "Unnamed performer at The Broadway 7": [], "Unnamed performer at The Broadway 8": [], "Unnamed performer at The Broadway 9": [], "Unnamed performer at The Jefferson Theatre": [], "Unnamed performer at The Paddock 1": [], "Unnamed performer at The Paddock 10": [], "Unnamed performer at The Paddock 11": [], "Unnamed performer at The Paddock 12": [], "Unnamed performer at The Paddock 13": [], "Unnamed performer at The Paddock 14": [], "Unnamed performer at The Paddock 2": [], "Unnamed performer at The Paddock 3": [], "Unnamed performer at The Paddock 4": [], "Unnamed performer at The Paddock 5": [], "Unnamed performer at The Paddock 6": [], "Unnamed performer at The Paddock 7": [], "Unnamed performer at The Paddock 8": [], "Unnamed performer at The Paddock 9": [], "Unnamed performer at The Stables 1": [], "Unnamed performer at The Stables 2": [], "Unnamed performer at The Stables 3": [], "Unnamed performer at The Stables 4": [], "Unnamed performer at Valle's Inn 1": [], "Unnamed performer at Valle's Inn 2": [], "Unnamed performer at Valle's Inn 3": [], "Unnamed performer at Valle's Inn 4": [], "Unnamed performer at Valle's Inn 5": [], "Unnamed performer at Wagon Wheel 1": [], "Unnamed performer at Wagon Wheel 10": [], "Unnamed performer at Wagon Wheel 11": [], "Unnamed performer at Wagon Wheel 12": [], "Unnamed performer at Wagon Wheel 13": [], "Unnamed performer at Wagon Wheel 14": [], "Unnamed performer at Wagon Wheel 2": [], "Unnamed performer at Wagon Wheel 3": [], "Unnamed performer at Wagon Wheel 4": [], "Unnamed performer at Wagon Wheel 5": [], "Unnamed performer at Wagon Wheel 6": [], "Unnamed performer at Wagon Wheel 7": [], "Unnamed performer at Wagon Wheel 8": [], "Unnamed performer at Wagon Wheel 9": [], "Unnamed performer at Willis Theatre": [], "Unnamed performer at Wonder Bar 1": ["\"Six female impersonators were arrested and charged with being fugitives from justice from Chicago and with disturbing the peace, following a police raid on the Wonder Bar, Monday (17). The were in the floor show.\""], "Unnamed performer at Wonder Bar 2": [], "Unnamed performer at Wonder Bar 3": [], "Unnamed performer at Wonder Bar 4": [], "Unnamed performer at Wonder Bar 5": [], "Unnamed performer at Wonder Bar 6": [], "Unnamed performer at the Olympia Theatre": ["\"There is a female impersonator—something we ordinarily detest. But this one is a dancer—a vivid and tremedously hard-working chap, with a sort of joy of living that's fun to watch.\""], "Unnamed performer at the Regal Theatre": [], "Unnamed performer from Bob Copfer Four": [], "Unnamed performer from Earle": [], "Unnamed performer from The Mimic Men 2": [], "Unnamed performer from Winslow Four": [], "Unnamed performer hissed off stage": ["\"a female impersonator was hissed off the stage\""], "Unnamed performer in The Seven Collegians": [], "Unnamed tall, black performer": ["\"Visiting celebrities supply most of the entertainment, supplemented by a four-piece band and a tall, coal-black Negro who is one of those erotic phenomena called 'queens'—female impersonators. This one has assumed the name of a famous white movie star, wears a wig and an evening gown, and sings alto.\""], "Val Rai": ["\"headlined as a foremost female impersonator\"", "\"in his novelty feminine impersonation, also gives an interpretative dance\"", "female impersonator, still has the patrons guessing. What do you think?"], "Val Turek": ["\"Chinese Temple Dance\", \"Mae West\""], "Val Varr": ["\"Songstress\" unclear if in drag"], "Valda Gray": ["\"Emceeing the show\"", "\"Sunday night concluded a long term stand for Valda Grays' [sic] Show which for the past number of years has been produced by the very capable Valda Gray, the Valda Gray show will open at the quite popular Ritz Lounge\"", "\"Valda Gray, once more excels in the masterful presentation of 'her' latest floor show 'Swingin' at the Cabin Inn' which features those famous impersonators.\"", "\"[Francis Dee =] that classy female impersonator . . . formerly a feature with Valda Grey's Cabin Inn revue.\"", "\"female impersonator and producer of the show\"", "\"has a flare of finales at the Cabin Inn\"", "\"show is produced by\"", "She used as gender pronoun (and no indication of her being a female impersonator...?).", "described here as one of \"leading impersonators\" of the city."], "Vera Mazzie": [], "Vera Walters": [], "Verida Pearson": ["\"veteran female impersonator will also perform as well as several other promising young artists in musical rendition.\""], "Verne Valdez": ["\"Comedy Singer and Dancer\"", "\"Current show includes\"", "\"Vern Valdez signs out of the Blackstone . . . and goes into Club Blase, that city\"", "\"after 10 weeks at Wagon Wheel . . . has moved to Finrcchio's [sic] . . . for indefinite run.\"", "\"after 58 weeks at Frolic Inn, Hollywood, now current at Washington Club, East Liverpool, O.\"", "\"after six months at Club Piccadilly . . . now current at Club Blackstone\"", "\"appearing at the Wagon Wheel, Houston, after an eight-week run in Cleveland.\"", "\"appearing at the Wagon Wheel, Houston, after an eight-week run in Cleveland.\" (Last stop in Cleveland was at Club Blase, according to Club Talent, The Billboard, January 22, 1938, 6)", "\"billed as the 'Male Fanny Brice,' is in his sixth week at the Ballyhoo, Columbus, O.", "\"black-faced . . . blues singer, in his Aunt Jemina specialty, furnishes some Tucker style vocalizing.\"", "\"closed a six-week engagement at Finocchio's . . and located at Club Tivoli there\"", "\"has spent half a year here [at Club Piccadilly]\"", "\"is now completing his second month at the Wagon Wheel\"", "Eighth month at the venue"], "Vernon Fountain": [], "Vernon Hoff": ["\"'Acme of perfection for your night club entertainment!' AGVA Singer and Dancer.\"", "\"'America's Most Beautiful Male In Female Attire'—State Critics Unanimously\"", "\"'America's Most Beautiful Male in Female Attire'—state critics unanimously", "\"'America's most beautiful female impersonator' state critics unanimously; AGVA; photographs free.\"", "\"'America's most beautiful female impersonator' state critics; at liberty in January.\"", "\"'America's most beautiful male in female attire!' state critics. Unanimously. Free picture to anyone. Singer, exotic strip tease dancer.\"", "\"'Bombshell of Rhythm!' Popular singer. Booking currently.\"", "\"'Dayton's favorite boy strip tease dancer/\" Held over! Third week!\"", "\"'Fascinating Creature of California's Night Spots,' AGVA. A free picture to anyone.\"", "\"'Former Finocchio Star!' Popular singer. Strip-tease dancer. AGVA member.\"", "\"'Houston's newest beauty sensation!' Second thrilling week at Club Circus. Straight, singer. Exotic strip tease dancer. Free picture to anyone.\"; \"First week\"", "\"'Nature Boy At HIs Best!'\"", "\"'Pulchritudinous exemplified! Perpetual vivacious personality of night club life!' Free picture to anyone.\"", "\"'Rhythm Singer of Today's Popular Songs!' Free picture to anyone.\"", "\"'Single, sobert, reliable. AGVA member.\"", "\"'Still today's top singing and dancing star in female attire!'\"", "\"'Successful exponent of singing and dancing!'\"", "\"'Sweetest thing since 7 Up!' Frisque singer. Strip tease dancer. Free picture to anyone.\"; \"First revealing week.\"", "\"'The Answer to Gorgeous George!'\"", "\"'The Duke of Chicago,' Singer, Dancer, M.C.\"", "\"'The Jules [sic] Eltinge of this Century' say fellow thespians.\"; \"'America's most beautiful male in female attire,' state critics unanimously.\"", "\"'The Utterly Unbelievable Body Beautiful'! Still the 'Sweetest Thing Since 7-Up'! AGVA.\"", "\"'You will stop, look and listen when you see this novel AGVA act!'\"", "\"'You'll enjoy the gay, lovable, exciting personality of Mr. Vernon Hoff!' AGVA.\"", "\"1948's Sweetheart of Detroit! AGVA. Booking currently.\"", "\"AGVA member; performed Howdy Club, City Dump, George's Corners, N. Y. C.; photographs free.\"", "\"AGVA television bookings accepted; available April. 'America's most beautiful male in female attire,' state critics unanimously. Photographs free.\"", "\"AGVA television bookings accepted; available March; formerly with Club Finnochios, 181 Club, Moraccan [sic] Village, Club My-O-My; photographs free.\"", "\"AGVA television bookings accepted; available March; the answer to Gorgeous George; photographs free.\"", "\"AGVA, formerly with Earl Carroll's Theater Restaurant, Tirza's Wine Bath Revue; photographs free.\"", "\"AGVA, formerly with Joseph J. Kirkwood Shows; 'different, unusual'; critic; photographs free.\"", "\"All Hollywood is agog over the outstanding performance of Mr. Vernon Hoff\"", "\"America's Most Beautiful Female Impersonator\"", "\"America's most Beautiful Male in Female Attire\"", "\"An act of distinction! Sensation of sophisticated entertainers! Singer. Dancer. Free picture to anyone.\"; \"Third exciting week!\"", "\"Beautiful Beulah of America's best night clubs! Singer, dancer.\"", "\"Dear friends, I am currently writing my biography. It is entitled: 'Fortune Smiled Once!' Singer, dancer, available January.\"", "\"Exotic strip tease dancer. Singer. Lodi, California's gift to America. Free picture to anyone.\"; \"Seventh captivating week.\"", "\"Exotic strip tease dancer. Singer. Lodi, California's gift to America. Free picture to anyone.\"; \"Sixth captivating week.\"", "\"Fellow workers love popular 'Dreamy.' Single, sober, reliable. AGVA member.\"", "\"Fire destroyed a portion of Vernon Hoff's wardrobe recently and Cleo Gordon Stafford is designing new costumes for him.\"", "\"GVA [sic] television bookings accepted; available April; the sweetest thing since 7-Up; photographs free.\"", "\"Held over! Sixth successful week! Frisque singer and pose-style strip tease dancer. AGVA.\"", "\"Indomitable popular singer and dancer! AGVA. At liberty in January.\"", "\"M.C.., singer, dancer; formerly with MCA; available television May; photographs free.\"", "\"My Sex Is Male\"", "\"Now performing his daring strip, Dance of Banging the Bongo!' Frisque singer. AGVA. Free picture to anyone.\"; \"Eighth and final week.\"", "\"Performed 1949 season with Levy's Lawrence Greater Shows; Elgin, LaSalle; AGVA; photographs free.\"", "\"Possesses the grace and action that makes his act so popular! Free picture.\"", "\"Queen of the Amazons, Sensational act, Dance of the Flying Disc.\"", "\"Season's 'blow-off' sensation. Single-O with talker. Wardrobe by Diane.\"", "\"Stage, screen, radio, vodvill, fairs; currently booking overseas; AGVA; photograph free.\"", "\"Stage, screen, radio, vodvill, fairs; currently booking overseas; available television, June; photograph free.\"", "\"Star of Stars. 'Wonderful,' Frances Renault. 'My favorite,' Leon LeVerde.\"", "\"Symphony in curves, sex appeal personified! Frisque singer. Hot strip tease dancer. Free picture to anyone.\"; \"Third scintillating week.\"", "\"Toast of New York\"", "\"Triumphant return with the 'New Look' exclusively! 'Perrenial [sic] coast to coast singing and dancing favorite!' AGVA.\"", "\"Vernon Hoff cards from Houston that he suffered the loss of considerable cash and some expensive furs, stolen from his hotel room, while playing a night club in Houston. Hoff is now in New Orleans.\"", "\"Vernon Hoff has left the Gay New Yorker Revue on the J. J. Kirkwood Shows to appear at the Ring Cafe, Dayton, O., as the featured strip.\"", "\"Vernon Hoff switched to the Blue Turban, Long Beach, Calif., where he opened June 15 as singer and featured strip.\"", "\"as a 'frisque' singer and stripper.\"", "\"attended University of Southern California, Los Angeles City College; AGVA; photographs free.\"", "\"closed Tuesday (14) at the Carga Club . . . He visited Jan Morag and Rickey Paige at the Pullman Club, Danville, Ill.\"", "\"closed at the Varga Club, Newport, Ky., last week.\"", "\"crowned 'Queen of Greenwich Village,' voted 'Swish America of 1947.'\"", "\"entire wardrobe completely brand new; m.c., singer, dancer; photographs free.\"", "\"is known for singing his infamous version of 'Chiquita Banana,' the 'Banana Song.'\"", "\"opened July 12 . . . as singer and stripper.\"", "\"opened July 12.\"", "\"opened Wednesday (22 [sic] at the Kitten Lounge . . . as singing and dancing emsee.\"", "\"opened at Club Viking, Cleveland, August 9\"", "\"opened on June 1\"", "\"original parody: 'Chiquita Banana, the fruit song, show stopper!'—critic; photographs free.\"", "\"performed Flamingo Club, Greenwich Village Inn, Hollywood; Zombie Club, Cleveland; photographs free.\"", "\"recently on the sick list, has recovered and is playing the Varga club . . .\"", "\"signed for six months at the Flamingo Club, Hollywood, starting June 1\"", "\"slated to open at the Sweetheart Bar, Detroit, August 30.\"", "\"still recuperating in his home at 850 Cuyahoga Street, Akron\"", "\"the male 'Forever Amber' of night life, including singer and white fox furs!' Frisque singer, strip-tease dancer. Free picture to anyone.\"; \"Second unforgettable week!\"", "\"writes . . . that he has recovered from his recent illness, and will begin his tour of niteries soon.\"", "\"young, versatile sweet singing and dancing arist [sic]. Incomparable! AGVA. Hailed by critics.\"", "Selling pin-up images"], "Vicki": [], "Vincent McFarland": [], "Vincent Reid": [], "Viola Layne": ["she's a \"fem impressionist\" i.e. a female-female drag queen"], "Violet Ceravola": [], "Violet Clements": [], "Wallace Reed": ["\"Female Impersonator Deluxe\""], "Wallie Groff": [], "Wally Brennan": [], "Wally Thompson": [], "Walter Davis": ["MC"], "Walter Hart": ["\"The Male Sophie Tucker\"", "\"in his third year at that San Francisco spot\""], "Walter McDonald": ["Impressions of Helen Morgan"], "Walter Morgan": [], "Walter Munde": [], "Walter Thomas": [], "Wanda Bean": [], "Weldon Short": [], "Wesley Davis": ["\"Mae West of Nite-Life\"", "\"Singer–Strip\""], "Whitey Harris": [], "Wilkie Mason": ["\"Prima Donna\"", "\"comic\"", "Not sure whether they were part of the Gay Boy Revue?"], "William Green": [], "William Harris": [], "William Johnson": [], "William Lee Becker": [], "Willie Duices": ["Died in November"], "Woody Wilson": ["Not sure whether they were part of the Gay Boy Revue?"], "Yonder Thompson": ["Hot Dancer from Harlem - unclear if in drag"], "Yvonne —": [], "Zalman": [], "Zorina La Cross": [], "[Harold Shinn]": [], "— Alexandria": [], "— Allworth": [], "— Brennan": [], "— Burns": [], "— Diana": [], "— Diaz": [], "— Dion": [], "— Dunn": [], "— Enesco": [], "— Gresham": [], "— Kay": [], "— King": [], "— Knox": ["both white female impersonators; \"fooled everybody as to sex, but as far as art went, didn't FOOL anyone. Sartorially and artistically the boys were there. The playing of a violin and their dancing evoked undoubted approbation.\""], "— La Mar": [], "— Lacy": [], "— Leslie": [], "— Lewis": [], "— Mack": ["both white female impersonators; \"fooled everybody as to sex, but as far as art went, didn't FOOL anyone. Sartorially and artistically the boys were there. The playing of a violin and their dancing evoked undoubted approbation.\""], "— Marion": [], "— Marshall": [], "— Mitchell": [], "— Morton": [], "— Ryck": [], "— Satch": [], "— Satchell": [], "— Williams": ["\"Mr. Williams as a female impersonator is 'peaches.' He not only looks the part, but he is graceful and makes quite a nice looking girl. Of course the laugh is a little heavy, but what do we care when we know it is not a real live woman with a laugh like that . . .\""], "— Yvonne": []}