{"": 11070, "\"A ban on female impersonation, or vice versa, is sought in a bill introduced by Assemblyman Bernard Austin (D., Brooklyn) which would make it a misdemeanor to wear the habiliment, or any part thereof, of a person of the opposite sex in public places.\"": 1, "\"Chairman Mary Driscool of the Boston Licensing Commission outlaw female impersonators in night clubs and cafes because 'normal men and women like their men manly and the women feminine.' 'They want to see pretty girls in women's parts and rugged men in masculine roles.' [sic] she said. 'Performances by female impersonators are in bad taste.'\"": 1, "\"Chariman [sic] Mary Driscool of the Boston Licensing Commission outlaw female impersonators in night clubs and cafes because 'normal men and women like their men manly and the women feminine.' 'They want to see pretty girls in women's parts and rugged men in masculine roles.' [sic] she said. 'Performances by female impersonators are in bad taste.'\"": 1, "\"Licensed liquor establishments in Rhode Island are all affected by a ruling which prohibits employment of male and female impersonators. Several months ago Pawtucket police put a ban on such entertainers in floor shows and now the ruling becomes State wide.\"": 1, "\"Minneapolis gendarmes cracking own on female impersonator shows.\"": 1, "\"With opening of Val Rai at the Spinning Wheel, the city completed its female impersonator-consciousness . . .\"": 1, "A man attacks women here. \"Since the scares began the police have induced female impersonators to walk the streets in the hope that they would be attacked.\"": 1, "Corroborated by Marriott's information: https://modules.marriott.com/resourcefiles/bosdm-courtyard-boston-downtown-weddings-main/17667-hotel-with-history.pdf": 1, "Corroborated by http://cinematreasures.org/theaters/31920": 1, "Despite being banned by the Mayor, Billboard writes that \"city police apparently have no objection to impersonators appearing in female garb on the streets during Mardi Gras to advertise one of the spots which employs them. The 'impersonators' were parading the streets handing out circulars advertising a spot in Jefferson Parish and coyly inviting men to 'come up and see them some time.'\"": 1, "Police raids, so many...": 1, "Unclear if Club Alabama was in Los Angeles, CA?": 1, "Unclear if it was Baltimore?": 2, "Unclear if this is Baltimore?": 1, "Unclear if this is Chicago?": 1, "Unclear if this venue is in Baltimore?": 4, "Unclear if this was in Baltimore": 3, "Unclear if this was the Baltimore theatre?": 1, "Unclear whether this was in New York City?": 1, "Venue city is corroborated by Brink v. Kennedy, 1941, https://casetext.com/case/brink-v-kennedy?__cf_chl_jschl_tk__=30b9081aab9b6a30795afba701cc56be78cf5d4c-1622516129-0-AdtRLo1vrcvNhx6ZS7U99tsYBVw7W5-VZxmqVMPuXUmmSKt-kY7zvfB9lBCUGMUfZkx8RoIstGGNqMpzlxzVlhpHbat2u1_04LKwtCfCTAHXkB7r2aSH0zWR4dFhJebaQ1IN-BNdBf02mUkfnM8QHMiWVpRa5z3FIqNYLHCi2byHU7fPwK_8SCYcG3jULYecN-lpuqvVgHy_SP5d7qsX4-ZFhdcFhWj2QoacDX92qTXUZwITq23sX7uLh_5P-RDSK-lPxA_hpcphRajFYofRypBk5NnlDdczoQuZ2rR86YrB6YvPVKja7fOta3voyJQBPybbBvNrMf5Q2yo-fMOwfI6pIJiLnAUPxOxncT5GEMWIt0XhLaQjAL3zAp-yGOl8S0RN9m29Z-KnGlb1DetuIO9mTikSNxEzC9x4yKOPx8Kc413nN9An3w-glSw7aCY8UQtpd2-oLw8DqM8TXic26EUzzK3_rrF6WQba59vIqySI": 3, "following a \"series of front-page articles in Miami Herald 'exposing' conditions among cafes here featuring femme impersonator shows, strippers and 'B' girls, Miami city commission will take up the issue tomorrow (Wed.) with expected restrictive ordinances.\"": 1}