{"": 10815, "\"'We're expecting a rush, hiring more barmaids and waitresses' [due to repeal]\"": 1, "\"(Female Impersonators)\"; \"Direct from an extensive tour. Something radically different\"": 3, "\". . . the Liquor Bard sustained the Permit Division's refusal to renew the corporation's night club license. A stage show known as 'The Gay Boy Revue' featuring male impersonators of women, has had a long run at the night club. Informed of the police testimony, Abe Maius, Band Box manager, remarked, 'That's odd. The show has been running for 23 weeks. If it is indecent, then it seems police were negligent in their duty.'\"": 1, "\"10 Big Acts\"": 1, "\"10—Big Acts\"": 1, "\"3 Complete Floor Shows Nightly\"": 7, "\"A Novel and Unique Nite Club\"": 32, "\"Alleging indecency of 'The Gay Boy Revue, featuring male impersonators of women, was the Liquor Board's reason for taking away the Band Box's licenses. Although twarted so far in its attempt to prevent the night club from selling liquor, the board's action sounded the death knell of 'The Gay Boy Revue,' which was discontinued by the Band Box last Saturday. No other entertainers were hired to take the place of the male impersonators.\"": 1, "\"Always offering the newest and most interesting in Nite Club entertainment. . . . . No Cover Charge Ever!\"": 4, "\"Among members . . . are several young men who were featured in this branch of college theatricals, says Matt Berger, Chicago impresario, who brought the act from Hollywood. . . . The Impersonators offer singing, dancing, and comedy. Special parties will be given Wednesday and Thursday nights, the eve and aftermath of the football games.\"": 1, "\"Bringing Them Back Alive! The Shows Like as You Like 'Em! World's Greatest Female Impersonators From the Leading Night Clubs of America\"": 1, "\"Cafe, operated by Bernie Hyman, formerly of BBB's Cellar, is a class spot for Hollywood. Located in the Christie hotel, it is only a block away from the Chinese and El Capitan. Decorations in black and silver, done by Jack Schultz are a good flash.\"": 1, "\"Central New York's Leading Show Place\"": 1, "\"Claiming appearance of female impersonators in a revue at The Gables was indecent, Sheriff Malley declared war against the establishment two weeks ago. On Aug. 29 the sheriff closed the place in serving executions on two civil judgments. He removed the padlocks when the judgments were satisfied but refused to return the beer and liquor licenses, sending it instead to the State Liquor Authority.\" + more": 1, "\"Club Congo, Crystal Caverns, later the Bohemian Caverns\" (https://m.facebook.com/preservingdclgbtsites/photos/a.159048077627962/648532068679558/?type=3).": 2, "\"Current pansy clubs in town\"": 5, "\"Danny Brown's all-male revue jumped to the Harmony Club, Jackson, Mich. from Johnstown, Pa.\"": 2, "\"Despite the fact that Cabin inn will change its locality within a few weeks, the management of this 'oddest nite club in Chicago,' continues to give its patrons an effervescent floorshow.\"": 4, "\"Direct from a Chicago Success\"": 1, "\"District Attorney Martin W. Littleton early yesterday led a raid on the Bird's Cage, a resort on Merrick Road, Valley Stream, Nassau, and arrested the reputed proprietor . . . and seven other men, on charges of violation of Section 1140-A of the penal law, promoting an indecent performance, and also on charges of violation of Section 1530 of the penal law, maintaining a public nuisance. The man arrested as the owner of the place described himself as Frank Schwartz, 32 . . . Another man arrested was described as Max Lengel, 38, of 250 West 94th St.,Manhattan, master of ceremonies for a show which included six 'female impersonators.'\"": 1, "\"Fashion Parade with Male Models!\"; \"Revue—and What a Wow It Is! Football Party Tonight—Rah! Rah!\"": 1, "\"Feets Edson will reopen Long Island's Show Place, and will feature Jackie Maye just to prove to the waiting hordes that there is still a market for female impersonators (flatterer! Ed.)\" Formerly known as the Silver Slipper, see The Brooklyn Daily Eagle, January 26, 1932, p. 19. In March 14, 1933, The Post-Star, 4: \"Jackie Maye is no longer F. Edson's 'girl'—a new group own him now.\"": 1, "\"Fire caused extensive damage this morning to the second and third floors of the Folies Bergere, formerly the Club Richman . . . A caretaker discovered smoke and a small blaze on the second floor at 5:30 a'clock and turned in an alarm. When firemen arrived they found the fire had mushroomed on the second and third floors. The blaze was brought under control in about three-quarters of an hour, with damage to a large quantity of scenery and costumes.\" They remained closed for the rest of the year and when they opened again, they were looking for a new name (Richlou was thrown around, as a combination of Richman and Lou Schwartz) but reopened as Club RIchman with radio contests about its future name. Jean Malin, at that point, had left for the West coast and opened his own club. A year later, a column in the Daily News (1933-02-01), wrote that \"The Richman, which was staggering along, has become overnight one of the best spots in town.\"": 1, "\"Floor show for Jean Malin's spot . . . is set with Julanne Johnston, Rockey Twins, Mona Ray, Eddie Adams, Dooley Twins and the Three Ambassadors supporting Malin.\"": 1, "\"For its next traveling road burlesque show, the Gayety will offer 'The Tempters,' with a star-studded cast, . .  .\"": 1, "\"For novelty as well as cleverness in the line of work done, Jack Mason's floor show is a treat. It's called 'Playboys' and is made up entirely of female impersonators, some of whom, with their Fifth avenue coiffures, gowns and costume jeelry, fool at a distance of two feet.\"; \"About a dozen boys, dolled to the ears, form a chorus, opening and closing in routines along the lines of the French can-can. The show by the boys (as girls) is preceded by a number in which the colored waitresses of the place take part. First show is at midnight, with two following that. Orchestra is made up of girls—real ones.\"": 9, "\"Frank Schwartz, manager of The Bird Cage, nitery on Merrick road, Long Island, arrested with eight female impersonators. Raid personally conducted by Martin Littleton, local D.A. Schwartz had discontinued using skirties after warning several months ago, but says he was obliged to resume when business fell off.\"": 1, "\"Hollywood panic direct from Chi. Breaking records—try to get in!\"": 1, "\"Hollywood's sensation knocked blase Chicago for a 'Loop'\"": 2, "\"It's Here! And 'The Town's Gone Wild'\"; \"It's the Show of the Century\"": 10, "\"Maier and his plain-clothes men watched the floor show in Oscar's Cafe . . . until they said they found the performance of two female impersonators 'lewd and indecent.' They let the 'singing waiters' warble, then sent the customers home at midnight and took the impersonators to the station, along with the proprietor, Oscar Gensler, 37, of Memphis st. near Berks, and the bartender, John Lenker, 33, of Huntingdon st. near Front . . . the impersonators, Anthony DiMeo, 27, of 11th st. near Ontario, and Martin Wynne, 33, of Wallace st. near 16th, charged with disorderly conduct.\"": 2, "\"Malin . . . truthfully could have claimed to be a Belasco product, though not a Belasco star. For it was in Belasco's production of 'Mima,' in 1938, starring Lenore Ulric, that Malin first hit Broadway. In that show, if you will recall, there was a scene laid in Hell. There were six 'working devils' and six 'dancing devils.' The dancing devils included Malin, the female impersonator.\"": 1, "\"Malley seeks to have the state take away the Sea Breeze resort's license because of appearance of female impersonators in a revue there.\"": 1, "\"Most consistent money maker of the smaller night spots, BBB has been featuring a pansy revue in his cellar for the past seven months.Revue has changed only slightly during its run, and credit for the profit should be given to the m. c. himself, whose off-stage cracks about his floor show are 90% of the entertainment. Spot sells nothing but laughs, with no attempt made to draw class patronage. However, it's a great drop-in spot for picture names, who come for a load of BBB. Tap is light, with minimum check set at 50 cents.\"; \"was having a tough time a while back, but Al Rosen, picture agent, stepped in with some fresh money. Female impersonation stuff caught on, and it has been clear sailing since.\"; \"Everything thrown in, BBB's about the best after-theatre spot for the money in town.\"": 5, "\"New edition of the Jean Malin floor show is better than the opening bill, but it looks as if the Hollywood mob is beginning to crave something new. Business has slipped considerably, despite the class of entertainment.\"": 1, "\"OPENING THURSDAY, OCT. 7\"": 1, "\"Only 2 More Nights—Ends Fri.\"; \"They'll Pack 'em In Tonight\"; \"Hollywood's Latest Craze\"; \"Revue and Fashion Parade de Luxe\"": 1, "\"Pansies and Pansies! That was the atmosphere at the Ritz theatre Monday night when 'Sisters of the Chorus' opened.\" ": 1, "\"Presenting Floor Shows That Are Daringly Different\"": 6, "\"Rocking M Dude Ranch,\" according to \"San Antone Nitery Ops Gang Up Vs. Opposish From 'Slots,' Army Soirees,\" Variety, June 7, 1950, 50.": 1, "\"SUCCESS and failure often can be measured in lines . . . Take, for instance, the case of Lou Schwartz, owner of Club Richman . . . A few years ago the Richman was one of the snootiest places in town . . . it was jammed all the time, and Broadway, which loves to be trampled upon, would stand patiently in the foyer waiting for tabled . . . With lines in the lobby, Schwartz didn't have a line in his face . . . Then the tide turned . . . Lou tried one idea after another to no avail . . . But I'll concede one thing, he had plenty of heart . . . Weeks wore on into months, and Schwartz, who didn't have a line in his face, developed wrinkles. . . . Now the tide has tured again . . . The Richman is again the hottest spot in town . . . I saw Lou the other night . . . His face is as bland as a Chinaman's . . . The lines disappeared from his face as soon as the lines reappeared in the lobby.\" Jackie Osterman is generally acknowledged in the papers as being responsible for the come-back of the club. Osterman's fame came from a \"Harlem version\" of \"Buddy Can You Spare a Dime?\" - see The Brooklyn Daily Eagle, February 13, 1933, 20 (59986358) In March 1933, Osterman and his \"Club Richman Revue\" appeared at the Roxy Theatre before (?) the movies. See Daily News, 1933-03-05, p. ???? (414670114)": 1, "\"Schwartz announces that he plans to reopen the Club Richman under another name, using girls in every department—orchestra, floorshow, and all . . . he wants 50 or more\" Followed up with 1933-06-18 Daily News, p. 62 (415210446): \"There are plans afoot to reopen the closed Club Richman as a black and white supper club in which all service departments will be conducted by girls, including the orchestra, the entertainers, the barmaids, the hostesses—'in short,' the prospectus reads, 'a club where fifty white and colored beauties will make beer-drinking an esthetic as well as a bibulous pleasure.' And probably the Mayor will throw out the first highball.\" Richman's date was set for June 27, see 1933-06-23 The Brooklyn Daily Eagle, p. 26 (59993739). And on July 10, they were 'packing 'em in,\" see 1933-07-10 Daily News, p. 68 (415207641); 1933-07-17 Daily News, p. 29 (416525644).": 1, "\"Special entertainment is added each week to the Jack Mason's Playboy Revue . . . it was announced today by Aaron Schwartz.\"": 1, "\"That famous Atlantic City institution of the show world, known originally as the 'Pansy Club' but which has recently been renamed 'Purple Derby' with a 'Gay '90s' chorus\"": 1, "\"The '31' Club at 31st st. and Girard, recently badly damaged by fire, is reopening tomorrow.\"": 6, "\"The Cabin Inn is distinctive as a night club, aside from its novel form of entertainment, in the respect that the patrons are allowed to have no inhibitions. Their motto is, 'Be Yourself,' with no limitations.\"": 9, "\"The Club Richman . . . New York's oldest and most celebrated night club is experiencing renewed vogue with its new 'Playboy Revue,' an all-boy floor show staged by Jack Mason. Many of the bigger Broadway names have been attracted to this niterie because of the novelty of its entertainment offering.\"": 1, "\"The Club Richman erroneously reported as collapsing—didn't and is planning for a beer garden in the near future. The Richman merely unloaded its overhead—by letting out ten dancers, and others, and the girls who were released naturally thought the place was closing.\" Still, as 1933-04-13 The Morning Call, p. 3 (553322452) reports, there was a chorus of at least 25 people... So why did the club have to let go of dancers in the Spring of 1933? 1933-04-28 The Brooklyn Daily Eagle, p. 24 (59997348) writes that \"with the beer garden novelty worn off, the Club Richman has taken a sudden dive in popularity.\" In May, reported to have been up for closing: 1933-05-12 The Brooklyn Daily Eagle, p. 24 (58265694). Later the same month, reports of Belle Livingstone (\"Texas Guinan's rival in the good old days\") was going to open the Belle Livingstone Club at the former Club Richman, see 1933-05-23 The Brooklyn Daily Eagle, p. 9 (59843313). Competing reports detail that Belle Livingstone was rather starring at Club Richman: 1933-05-23 Wisconsin State Journal, p. 3 (404739296).": 1, "\"The Club Richman is now the Folies Bergere and the Schwartz boys are trying to treat Broadway to a new thrill by presenting a colored and white revue. It is a good show and Jean Malin is the chief attraction for the naughtic clan.\" \"But the best show of all on the opening night was put on by one of the spectators, a young lady who wandered into the men's room.\"": 1, "\"The Club Richman will better the Gigolo attraction at rival spots by featuring Gigolettes. Not dance-hall hostesses, mind you, but Continental types and some debs for lonely males, who have clean collars—and, one presumes, money... One of them is an Arabian gal, whose ancestry dates further back than those burlesque show black-outs...\"": 1, "\"The Divorcee's Haven\"": 1, "\"The Oasis is presenting an entertaining all-star male revue of six people, featuring Lyle Mack. This is the greatest novelty act ever presented at the Oasis and promises to stay for a long run.\"": 1, "\"The Venetian Causeway boite has been refurbished completely for the opening tonight.\"": 1, "\"The all-male Collegiate Revue now in its fourth week at the Club Frontenac is headed by Lyle Mack. All members of the cast are college graduates, and have appeared the country over in their impersonations.\"": 1, "\"The entertainment in this rathskeller may suffer a bit, but the prices rival any in New Amsterdam.\"": 1, "\"The first unpleasantness occurred about a month ago at a 'drag' scheduled at Rockland Casino, situated alongside the Polo Grounds and preferred to any other dance hall in the city, as its locality is unfrequented at night and the queerly dressed men attract little attention.\"": 1, "\"The impersonators end their engagement Friday night\"": 2, "\"The new Ship Cafe in Venice, at the pier outside of Los Angeles, has engaged Jean Malin to head the new floor show starting this week.\"": 1, "\"The new show at the Club Frontenac offers an all-male collegiate revue, including several impersonators.\"": 1, "\"They Deceive Even the Sexperts!\"": 1, "\"They [women graduating from the Bartenders and Barmaid's School] are symbolic of the feminist conquest of Broadway night life. The Club Richman, for example, features an all-girl revue, girl waitresses, girl barmaids, girl bartenders and girl musicians. Other places are catching onto the idea.\"": 1, "\"They deny it, but the rumor around the Club Richman's new whoops-m'dear revue the other day, had it that Jean Malin's widow and one of the cast took out a marriage permit. What! Again?\"": 1, "\"This show is made up in more than 20 scenes, contains humor, pretty girls, comedians and snappy song and dance numbers.\"": 1, "\"This week's floor show . . . features, for the first time since the club opened, an all-male revue.\"": 1, "\"Three pioneering homophile groups — Mattachine Society, Daughters of Bilitis, and East Coast Homophile Organizations — also utilized the Barbizon-Plaza Hotel for conferences and events that attracted leaders of the homophile movement from across the nation in the late 1950s and mid-1960s.\" (https://www.nyclgbtsites.org/site/barbizon-plaza-hotel)": 2, "\"To the tune of incriminating words, the female impersonator dispute at The Gables . . . reached the State Liquor authority yesterday. Chief Deputy Frank E. Hayden used some very mannish words to describe what he considered unmannish antics of the impersonators at a hearing before Commissioner Joseph Ryan at the county ABC Board's offices in Central Trust Building.\"": 1, "\"Unable to pay fines of $100 each, seven men, dancers and entertainers—allegedly female impersonators at the Bird Cage, a night club on Merrick rd. at Emerson pl.—were sentenced to 30 days each in Nassau County jail by Police Justice Louis A. Hicks last night All pleaded guilty to charges of public nuisance.\" ... and more": 8, "\"We fully expect our license on Monday. Out premises were inspected and approved on Saturday. We are just waiting.\"": 1, "\"When the cops ordered the pansies' names to be taken out of the Torch Club electric sign, Francis Dunn soliloquized: 'Yesterday I had a job, tonight a fuse blows out and I'm a bum again'\"": 1, "\"With all of its shocking pacemakers, the famous Cotton Club never permitted a female impersonator to grace its boards until Joe Smothers, a blonde-haired Baltimore lad, did a pansy routine in the twenty-sixth annual edition just this year.\"": 1, "\"after 38 weeks in Baltimore [at the Earle Club, corroborated by my data] now at Jungle Inn . . . Same show\"": 8, "\"after a 38-week run at the Frontenac\" the revue \"moved to the Club Lido, Youngstown, O.\"": 6, "\"at Terrace Gardens . . . after finishing 12 weeks in Detroit for the Pete Iodice office\"": 1, "\"comedian\"": 1, "\"dance team [with Gene LeMonte]\"": 1, "\"dance team [with Jose Del Rio]\"": 1, "\"direct from Detroit\"": 2, "\"explosive native dances and Spanish-English songs of Billy Herrero. Herrero, with his colorful Latin costumes, was signed by Norman for the Detroit unit of his male shows, after a trip made to Santiago, Chile, for that specific purpose.\"": 1, "\"folded for the summer months\"; \"closing was made necessary by the adjudging of Barnett Hyman, its operator, a bankrupt. . . . Among the liabilities are $450 owed Jean Malin and $175 due the Rocky Twins for professional services.\"": 1, "\"in the former John Murray Anderson School\"; Venue is mentioned in New York Daily News, 30 Oct 1930, 13 (413530824): \"My new place is cayenne to the jaded mental tongue . . . Come and see the savage, uncensored dances of the African jungles; the titillating, tintinabulating secret excitations of the Congo, and the flesh-shuddering, goose-creeping, delicious horrors of the Grand Guignol!\"": 2, "\"long the spot where female impersonators danced and pranced has installed a new policy and new show with Joe Ziggy Johnson as producer and emcee\"": 1, "\"nationally famous female impersonator is one big reason why the Britwood cafe is one of Harlem's hottest spots.": 1, "\"night club audiences must be of a strangely tolerant temperament. Frankly, we've never seen but one audience cold-shoulder a moment of filth. That was at the Villa Venice, in reply to a crack made by one of the female impersonators. We didn't get it—so that doesn't count—though some of the audience must have. But it remained perfectly silent, and we were no end pleased with it. These eyes . . . have been seeing so much tolerande lately that they're not quick to be amazed.\"": 1, "\"non-couvert dine and dance spot\"": 1, "\"packed them in during the Summer season\"": 3, "\"ran Torch Club in Miami, is starting another one with the same name Wednesday\"": 2, "\"rendezvous protected by the fact that his 'protector' was a big shot—a well-known underworld figure. All went well until his 'boy friend' had a fit of jealousy—a tantrum of violence during which he practically wrecked the joint. After that, all protection ceased. The police began raiding the place, but even that novelty began to wear thin, and soon it was no longer the same pleasure spot it had been before.\"": 1, "\"still holding his own at the Club Ballyhoo, O., after 30 weeks.\"": 1, "\"the Rhythm Club, the town's [Pittsburgh's] most notorious resort\" \"The club had prospered [during the depression], but after several months its shows became so shocking to the authorities that, after a raid, certain numbers had to be modified.\"": 1, "\"will begin a week's stay\", following the \"World's Fair Nudists\" engagement at the same venue.": 1, "(Charles T. Mancuso, proprietor), \"has been the scene of a raid on a 'pretty boy' show in which a group of female impersonators staged a song-and-dance act.\"": 1, "Added here because the revue contains a \"Dietrich number\" where \"all the gals look more mannish than Jack Osterman, who leads the number.\"": 1, "Address according to http://www.ilovelbny.com/americanhouse.html": 1, "Address corroborated by The Brooklyn Daily Eagle, May 13, 1930, 27": 1, "Address corroborated by http://cinematreasures.org/theaters/7501": 6, "After a strangely both celebratory and demeaning couple of paragraphs about Jean Malin, Ed Sullivan (the author) writes about the recent changes at Club Richman, which used to be \"jammed with figures of society and Broadway\" and with a \"crush . . . so great that the headwaiter had the ropes up in the lobby, holding back supplicants for tables.\" Today, his point is, everything is terrible: \"I saw colored and white waitresses serving beer at twenty-five cents a flagon. A white girls' band alternated with a colored girls' band. The barmaids were white and colored. At intervals, the barmaids and the waitresses went to the dancing floor and entertained with songs, dances and witty sayings, standing almost of the very spot where in the past Abe Lyman, Morton Downey, Irene Bordoni, Frances Williams and [Harry] Richman entertained New York's smarter set.\"": 1, "At the Christie Hotel": 1, "At the Christie Hotel; Club folded for the summer": 1, "Attempt at injunction against raids": 1, "Celebrity place: Billie Holiday, Al Benson, Bill Moore, June June, Leon McClintock, Chotsie Clark were all spotted there recently": 1, "Club Dante's, \"LEADS AGAIN Bringing Back the Shows You Like\"": 3, "Club Richman's name change to Folies Bergere": 1, "Club Richman, \"once the swankist and most successful night spot in all New York, is now the 'Folies Bergere,' and offers black-and-tan entertainment!\"": 1, "El Paso Shriners' sidewalk circus": 1, "Formerly Park Club": 4, "Formerly Park Club, \"You Must Come Over . . . Under New Management\" \"Second Showing of An Array of the Most Beautiful Female Impersonators from Broadway\"": 5, "Formerly Shalain Park, according to The Pantagraph, August 25, 1937, 10": 6, "Formerly known as \"Parody Cafe\"": 1, "From 9 Mile; 15 people\n": 1, "Had female impersonators.": 1, "Has female impersonator shows": 1, "Has female impersonators": 2, "Has female impersonators\n": 1, "Idlewild: \"an idyllic oasis in northwestern Michigan called Idlewild, once known by some as the Martha's Vineyard of the Midwest, but for well-to-do black folk.\" https://www.chicagotribune.com/news/ct-xpm-2012-10-01-ct-met-trice-idlewild-1001-20121001-story.html": 3, "In reality, they were performing in Club Richman's \"Tap Room\" which opened at noon, and had entertainment with Jack Mason's Play Boy Revue from 9.30 until closing. No cover charge!": 1, "Later became Lennox Theatre, see http://places.baltimoreheritage.org/timelines/lenox-theatre/": 1, "Miami's newest and gayest night club": 1, "More about venue: https://detroitgayhistory.blogspot.com/2009/09/sweetheart-bar-detroit-michigan-gay-bar.html": 5, "Name of venue corroborated by Variety, Jul 11, 1933, 47": 1, "No more drag after too many raids": 1, "Owner Al Ehrlich": 1, "Planned to open in Fall 1935": 1, "Raided due to \"no certificate of occupancy\"": 1, "Riviera was raided, \"a roadhouse near Stower . . . arrested one man as manager and two bartenders. . . . Three hundred patrons were questioned by the raiding squad and names, addresses and ages taken. None was permitted to leave the place until this ceremony was completed. . . . Piper [liquor control agent] said the liquor board also would seek an opinion this week, from Attorney General Margiotti, on whether to bring charges on operation of an indecent show against Theodore Lewis, named by Piper as the owner of the place. Piper said the show consisted of female impersonators.\"": 1, "Stanley Jabin had just taken over the club, see \"Chatter: Miami\" in Variety, December 18, 1934, 60.": 1, "Unclear whether this is the Knolls Inn?? \"After entertaining a record attendance of revellers on New Year's eve, Charles T. Mancuso, proprietor of The Knolls, swanky South road tavern has closed the doors of the spacious structure—the scene of a murder and suicide last spring. . . . The roadhouse has been the scene of a raid on a 'pretty boy' show in which a group of female impersonators staged a song-and-dance act. Recently state police seized a one-ball machine there. . . .\"": 1, "Unsure whether this is actually THAT Everglades Club? See https://en.wikipedia.org/wiki/Everglades_Club": 1, "Venue corroborated by Pennsylvania Liquor Control Board, Retail liquor licenses. District no. 2, https://archive.org/details/retailliquorlice00unse": 1, "Venue here is \"Albert Bouche's club\" which is corroborated to Villa Venice by http://undereverytombstone.blogspot.com/2020/12/the-villa-venice-albert-papa-bouche.html": 1, "Venue is here corroborated by an article (and accompanying advertisement) from the previous year, that notes that Bouche had started theatrical revues in his venue, see \"Patrons Compliment Bouche for Revues,\" The Miami Herald (Miami, Florida) 12 Mar 1932, Sat Page 8 (617527565)": 1, "abbreviated run . . . There was a squawk.": 1, "closed down the venue, \"the show itself was unobjectionable, as far as off-color material is concerned, but 'there have been complaints about some undesirable people frequenting the night club since the show opened.\"": 1, "destroyed because \"the Hollywood city fathers decided to lay out some new streets . . . right through Ray's main room!\"": 1, "formerly Martin's Corner": 1, "likely old Hollywood Barn Cafe": 1, "raided \"based on the holding of a performance without a license.\"": 1, "reopening soon, after \"revamp[ing] the type of entertainment, scuttling the femme impersonator policy, which formerly comprised the bulk of the floorshow, for more conventional type.\"": 1, "singer": 2, "venue famous for \"femme impersonator shows\" but was shut down \"of circumstances beyond our control.\"": 1}