{"": 10020, "\"Alice Roosevelt Longworth refers to some of the spinster ladies, friends of her cousin, Eleanor Roosevelt, as 'The Female Impersonators.'\"": 1, "\"American acts predominate over here [in Australia]. At Melbourne week of Nov. 21 were . . . Jean Barrios . . .\"": 1, "\"BALTIMORE'S FAVORITE Starting Tomorrow\"": 1, "\"Beginning Tomorrow THE CONTINENTAL SENSATION BILLY HERRERO — THE SPANISH HOT TAMALE\"": 1, "\"But one say something happened—something that changed the situation entirely and from one of respect and appreciation to that of hatred and almost dejection. It was just upon return from half-day's tour of pleasure and sightseeing through lovely Venice and after many praises had been given the diminutive Jarahal by the man of the rich white family for his Italian fluency and all-around execution of foreign court manners. Turning to Jarahal, Mr. said, \"Indeed, sir, you are so intelligent, so gentlemanly—you are making our vacation one of pleasure and are honored by your company. From what country do you hail?\" With that pride of birth which beats in everyone's breast and especially the American's—Jarahal spoke out: \"I was born in Georgia.\" From that moment the prejudiced spark of American ignorance beamed in the cracker gentleman's eyes—he had been deceived—he turned blue. The Georgia Negroe's culture had fooled him—he believed him a foreigner. When the truth came he couldn't stand it. Jarahal was ever invited to dinner any more. The white American went one further by cancelling the dance contract which Jarahad held for teaching his daughter to tango and fox trot. From that day on Jarahal was given the time of day only. As is their custom in foreign lands, the Americans asked that Jarahal be put out of the hotel. But the proprietor refused. Jarahal, who returned to the states last spring, was heading his seven-piece orchestra at Ches [sic] Vous by night, and in the afternoon he conducted dance school for the elite.\"": 1, "\"Emile Morlet, owner of the 'Wonder Bar,' French Quarter night spot, filed a petition to restrain police from arresting Morlet's male entertainers who impersonate carious persons of the theatrical world.\"; \"The petition was denied.\"": 2, "\"JEAN BARRIOS left for San Francisco last week to vacation with his family. He opens for the Orpheum Circuit on the West Coast in August.\"": 1, "\"JEAN BARRIOS opened this week at the Bushwick Theatre in Brooklyn, James Devlin represents him.\"": 1, "\"Jack Norman and Jack LaMarr, female impersonators, two of the young men who recently became entangled with Onondaga County authorities when a raid on a night club was stage, [sic] spent several hours in the Troop D barracks Thursday night until a relative of Miss Bernice Hollenbeck, 212 Bryant av., appeared and paid a $5 fine which had been assessed by Justice William M. Swayze at Wampsville for failing to have an operators license while driving the youths to Utica to open an engagement. The three young people were halted near Wampsville by Trooper Raymond E. Forgarty. Miss Hollenbeck was unable to produce a license and Fogarty took her before the justice. The trio did not have the money to pay the fine and Miss Hollenbeck and the female impersonators were detained until a relative of the girl could come from Syracuse with the money. Nomran and LaMarr not at all worried by their enforced stay, entertained the troopers with several sections in the recreation room of the barracks.\"": 3, "\"Mr. Jean Barrios, our front cover, who is appearing this week at B. F. Keith's Bushwick Theatre in Brooklyn, is one of the few delineators of feminine characterizations who possesses a double voice. This appearance marks his New York debut. He recently concluded a tour of the Orpheum Circuit, his third in as many seasons. The press on the other side of the ROckies was generous in its praise of Mr. Barrios for his impersonations of the gentler sex. The Chicago correspondent of one of the profession's leading weeklies said of him when he appeared at the Palace, Chicago: \"Mr. Barrios is probably the best looking female impersonator in America and has an abundance of genuine talent. In the opinion of a representative of The Vaudeville News, Mr. Barrios is the most convincing female impersonator it has been his privilege to see. His startling and rich looking stage wardrobe will furnish the female contingent of theatre patrons with a thrill, and that is only one of the redeeming features of his act.\"": 1, "\"New York has attained the unenviable reputation of being the 'drag center' of the world! As was reported, Jack Mason is managing a drag at Madison Square Garden for Saturday night, May 17th, and now another is announced for the same date at the Central Opera House, 205 East 67th street, by Ramon Strobeck, Frank E. Carroll, Georgie Burns, and Maxie Lengel.\"": 5, "\"PIANO PLAYER for vaudeville act. Apply JEAN BARRIOS, Care of N. V. A. Club, New York City\"": 1, "\"Spanish dancer and singer, is featured in the floor show at the New Torch K-9 club, which is now under new management.\"": 1, "\"Steps are being taken to outlaw 'drag balls,' the brazen parade of female impersonators.": 1, "\"The Season's Treat Starting Tomorrow\"": 1, "\"The bill swings along nicely. Opens with the Collegians' band of nine pieces doing a singing-instrumental combo in lively tempo with a burlesque femme impersonation to help out. All okay, but nothing wow.\"": 1, "\"The female impersonator . . . represent[s] a type of humor and entertainment which has marred the work of the movie and stage producers for some time. But they didn't have to be told this. They have been trying to see how much they could get away with. Now they know.\"": 1, "\"The novelty of seeing men in women's clothes has worn off\" \"Once shunted to their secret rendezvous and hiding places where they held their orgies far from the peering eyes of a critical world the death knell of prohibition let down the bars against them and they were permitted out in the open and an amusement-starved world accepted them with open arms and thrilled at their smutty songs and quaint expressions, which were once confined to their own mystic circles.\"": 1, "\"The stand on Seventh avenue where Jarahal had conducted his dance and foreign language studio got too small for the noted Jarahal whose singing of operatic selections in Europe and on Broadway won him good following. So the little wonder-voiced fellow packed up his duds—typewriter and bedding—and folded his tent, with his language books under his arms and moved to 113 W. 136th street, a private house. Here he will conduct his business in ample space and will have room for \"Hot Shot\" Burwell's palace for dining, as the house contains 16 rooms. Miss Burwell, you remember, assistant choir director of the \"Green Pastures\" choir at the Mansfield [?]. She and Miss Vincent had a part of Jarahal's former place for a dining room for theatrical trade.\"": 1, "\"The writer, for once, believes the AFRO is harmful in giving undue prominence to the perversion of the female impersonation type.\" \"Featuring the female impersonator in special illustrated articles is a deteriorating factor in the education of our on coming adolescent youth.\" \"Let the female impersonators stay in the undeground night clubs, if the customers like them there, but keep the lurid of their back stage life and their disgusting pictures out of the press.\"": 1, "\"Things I'd give my all to know: . . . What is responsible for males becoming female impersonators?\"": 1, "\"Thomas Allmond, special detective, Atlantic City, informed your Rober that it was not a question of interracial mingling which caused the officers to ban that 'masked ball' in that seashore resort, but a written law of Atlantic City which absolutely prohibits the appearance of female impersonators, or the hiring of them in any of the public places. This, said Mr. Allmond, New Jersey expects soon to become a state law. Efforts are being made to put it through in Trenton.\"": 1, "\"celeb party [Sunday] proceeds to be turned over to Billy Herrero who lost his home and all possessions in a recent fire . . . Carlyle says it's time acts in need should receive help from such benefits, and that's a fine sentiment.\"": 1, "\"puts in a deserved claim to a first rate [vaudeville] with Francis Renault, the iimpersonator and demonstrator of female fashions, headlining.\"; \"Francis Renault mingles masculine comedy with his female impersonating as he gracefully displays thousands of dollars worth of gorgeous wardrobe.\"": 1, "10 weeks": 1, "13 weeks": 1, "3 and Out": 1, "600 $10-and-Up Angels of $25, 000 'Mask and Gown'": 1, "??": 1, "A all new burlesque whirl of girls titled 'Hotsy Totsy,' opens at the Garrick Theater at St. Louis this Saturday fr one week. . . . Rae Bourbon, clever female impersonator from the Club Auby Laggon at Miami will also appear. A very clever chap.": 2, "AGVA Protests Proposed Reno Law Barring Femme Impersonator Shows": 1, "About long hair": 1, "About male impersonator Lillian Brown": 1, "Ad from program for Harlequin's Installation Revel October 16, 1932; Masquers Club had as members \"every name actor of the 1930s and 40s,\" created in in May 1925 by 8 men who \"got together to form Hollywood's first actors club, one, like the Lambs in New York, which would be a 'social sanctuary for actors and the theatrically inclined.' For a fleeting moment the men were calling themselves the Jesters,\" see bigorangelandmarks.blogspot.com/2009/03/no-226-site-of-masquers-club-building.html": 2, "Address corroborated by Chico Record, October 3, 1937, 3": 2, "Advertisement": 8, "Advertisement for leg pads": 1, "Advertisement: \"I know that life begins at forty but still Glamorously Gay\"": 1, "After Dark Blond Bebe Shines as Comedienne": 1, "After Dark British Crooner Starred": 1, "After Dark Burl Ives Entertains at S.&C.": 1, "After Dark Carnival To Feature Turzy Trio": 1, "After Dark Carol Daye Starring at Sid's": 1, "After Dark Club Alamo Stars Rose Murphy": 1, "After Dark Club Alamo Stars Singer Amby Hughes": 1, "After Dark Colorful Amru Sani Sings at the Statler": 1, "After Dark Comedian's Moniker Is Monica": 1, "After Dark Comics Teamed at Sid's": 1, "After Dark Commodore Returns Pee Wee": 1, "After Dark Elmwood Calls Back Ted Lewis": 1, "After Dark Flame Show Bar Adds New Cole": 1, "After Dark Four Dukes Come Home To Falcon": 1, "After Dark Four Dukes To Star Sugar Ray": 1, "After Dark Frank Rapp Continues Emcee Job": 1, "After Dark Gay Haven Books New Voice Star": 1, "After Dark Gay Haven Books Tony Bennett": 1, "After Dark Hibbler Returns To Flame": 1, "After Dark Hildegarde Is Coming to Statler": 1, "After Dark Iverson Trio Stars At Yeamans": 1, "After Dark Lil Green Starred at Flame": 1, "After Dark Lullette Stays On At Flame": 1, "After Dark Mel Torme Coming Monday": 1, "After Dark New Singer Headlines at Statles": 1, "After Dark S and C Stars Herb Jeffries": 1, "After Dark S and C Supper Club Putting Show on Ice": 1, "After Dark S&C Has New Buddy---Lester": 1, "After Dark Sheraton Brings In Coleman": 1, "After Dark Song Pair to See New Yeamans'": 1, "After Dark Statler Presents New Band": 1, "After Dark Statler Returns Tabbert": 1, "After Dark Statler Signs Miss Trauble": 1, "After Dark Statler Will Go Spanish": 1, "After Dark THose Kids From Spain To Return": 1, "After Dark TV Comic Performs at Elmwood": 1, "After Dark Triple-Threat": 1, "After Dark Williams Four Comes Fourth": 1, "After Dark Yeamans' To Return Nelsons": 1, "After Dark- Club Alamo to Present Pianist": 1, "Article is about the found body of George/Mitzy Manis—on June 15, 1934.": 1, "Article refers back to 1933": 1, "Article speculates about Senorita appearing at a different club.": 1, "As a result of a fight in Club Paree on Wethersfield Avenue early Wednesday morning, . . . Antonio Auriemma of Providence, R. I., a female impersonator using the stage name of Francis Renault, $10 and costs, drunkenness, and judgment suspended, breach of the peace.": 1, "Assuming this is San Antonio Light as it is the only other newspaper from the QMH's scans from San Antonio": 1, "August 1933 corroborated from http://sfbaytimes.com/jean-malin-broadways-queen-of-queens-2/": 1, "Barbette, female impersonator and sensation of the Texas Centennial, is another of her proteges. She got him out of a Texas cotton patch and trained him in her own back yard on Capitol Hill": 1, "Ben Schneider, Night Club Notes": 9, "Ben Schneider, Nights [sic] Club Notes": 1, "Bert Smith's Girly-Go-Round revue, \"featuring Karyl Norman, is the stage fare. It's strong on girls, a total of 11 being in the show—or, one might say, 12 until Karyl sheds his wig. . . . Norman, who makes the audience believe he's a woman, until he discards some trappings to show it's not so.\"": 1, "Bob Murphy, 'Private Lives' Is Next Offering at Edyth Bush": 1, "C M. Litteljohn, \"Night Club Reviews: Spinning Wheel, Seattle\"": 6, "CONCESSIONS DEFY EXPO": 1, "Chatter: Miami Beach Solloway": 1, "Chatter: Minneapolis": 2, "Chatter: Wildwood-by-Sea": 4, "Circuses: DRESSING ROOM GOSSIP - Kansas City Shrine": 2, "Circuses: Dressing Room Gossip - Dailey Bros.": 1, "Cleve. Niteries Seek Names to Lure Expo Biz": 1, "Cleveland Lets Down Bars to Femme Imps": 8, "Club Chatter": 31, "Club Richman Charged With Objectionable Show": 1, "Club Talent": 15, "Collier Returning to America": 1, "Community' Niteries Where The Game Is Not in the Name But in Family B.O": 1, "Customers Want In On Act in Latino Vaude; Felix Wardrobe a Hit": 1, "DOUBLE? Or two different people?": 2, "Date corroborated by QMH": 2, "Date corroborated by The San Francisco Examiner, 25 Feb 1950, 9": 2, "Date corroborated from 1949_postcard_Francis_Renault (BAM Archives)": 2, "Date corroborated from The Miami Herald, January 11, 1942, 12A; The Miami Herald, January 15, 1942, 5C; The Miami Herald, January 17, 1942, 5A; The Miami Herald, January 20, 1942, 6B": 1, "Date corroborated from letter's minimum 2.5 years prior to August 1946": 2, "Date is corroborated from Pittsburgh Press, September 29, 1950, 32 ": 1, "Date is corroborated from Uniontown PA Morning Herald, November 24, 1950, page unknown [lee-harvey-11-24-50]": 1, "Date is corroborated from appearance of Boys Will Be Girls 3rd Edition at Yacht Club in 1948": 1, "Date is not revealing when Malin was at Richman. In fact, the article reveals that Malin had been engaged at Club New Yorker in Los Angeles, but the article draws on Malin's fame at the Club Richman.": 1, "Date was opening date": 1, "Death of mother": 10, "Death of mother; not actually placed in theatre": 1, "End of engagement": 1, "Entertainment Guide": 2, "Evening edition": 1, "Extra Added: Philadelphia": 1, "Fay Norman's Gay Boy Revue": 42, "Fem Impersonations a Nice Surprise": 1, "Fem Mimics for Camden": 2, "Femme Impersonator Rapped With $150 Fine": 1, "Femme Imps Jam Up Milwaykee Nut House": 1, "Femme Imps Sloughed In Rensselaer, N.Y.": 2, "Film House Reviews: WARFIELD. FRISCO": 1, "Forbidden' A Boxoffice Hit Off-Broadway; Technically, the appearance was approximately in 1978.": 1, "Francis' on Floor": 1, "Gender pronouns. Fear of long hair.": 1, "General News: Chicago Chat": 1, "Gilbert Swan, \"In New York\"": 2, "Gilbert Swan, \"In New York\", 267095876": 1, "Gilbert Swan, \"In New York\", 287814763": 1, "Gilbert Swan, \"In New York\", 352595871": 1, "Gilbert Swan, \"In New York\", 449876950": 1, "Gilbert Swan, \"In New York\", 500330179": 1, "Gilbert Swan, \"In New York\", 507720901": 1, "Gilbert Swan, \"In New York\", 570056313": 1, "Gilbert Swan, \"In New York\", 584841378": 1, "Gilbert Swan, \"In New York\", 627083000": 1, "Gilbert Swan, \"In New York\", 628448677": 1, "Girl' Show's Injunction Vs. Troy Stop Order": 1, "Good ad here — Leg pads, rubber garments, wigs, eyelashes, face lifters, leotards, artificial finger nails — \"striptease and female impersonator outfits\" for sale = artisanal bodies.": 1, "HOLLYWOOD ADDS 2 NEW NIGHTERY SPOT": 14, "Halloween a Mop Up for Seattle": 3, "Has image but not in drag. ": 2, "Hopeful about vaudeville returning!": 1, "House Review: Renault's Fans Stray Into Commy Confab, Crack: 'Red's So Unbecoming'": 1, "I don't believe Hi-Boy Revue is a drag revue (March 2021)": 1, "Illustration.": 1, "Image of Jack Mason in a suit": 1, "Imprecise date but because of syndicated column, first date listed": 1, "In New York": 1, "In the Brooklyn edition": 1, "Indecent exposure charge": 1, "International Varieties canceled": 1, "Is this the Met gala????": 1, "Ivan Paul, Around Town": 2, "Jam in Brownsville Court Following Raid on Stag": 1, "James Aswell, “My New York\"": 1, "James. F. Wilson, Bulldaggers": 1, "Jean Feek, In the Lighter Tones": 2, "Kali. \"Picketing Dosn't Mar Apollo's OK 'Jewel Box Revue'\"; picketed with signs like \"Keep homosexuals out of Harlem\" etc - but box office says it just led to more business": 7, "LOS ANGELES": 1, "LOS ANGELES: Orpheum": 1, "Last Half Reviews: Fox's Savoy, Brooklyn": 1, "Last Half Reviews: Proctor's 86th St.": 1, "Last day of engagement": 1, "Last performance (?)": 1, "Last-Half Reviews: Loew's National, N. Y.": 1, "Legit Bits": 1, "Legitimate: Critic Pans the Ad": 2, "Legitimate: Legit Chatter In The Wings": 1, "Legitimate: NEW HOPE, PA.": 1, "Legitimate: Oh, My Dear, Here's Mae West's New Show--Get a Load of It and Weep": 4, "Legitimate: Road Up; Mnni 72½G, L.A.; 'Lady' Hits $64, 900, Chi; T. C. Jones 13½G": 1, "Legitimate: T. C. JONES SRO AGAIN, BUT NO BARN TAKERS": 1, "Leon \"Nazie\" Mirabeau, \"The Pansy Bugle\"": 12, "Lestra La Mont": 1, "Los Angeles: Orpheum": 1, "M. Oakley Christoph, \"Informing You\"": 1, "M.C.": 1, "May 1933 corroborated from http://sfbaytimes.com/jean-malin-broadways-queen-of-queens-2/": 1, "Mentions Club Renault Revue": 1, "Mere Male Blossoms Out in Garb of Milady at Big Hamilton Lodge Ball": 3, "Miami May Kayo Off-Color Shows Rapped by Daily": 5, "Mormon Town Going for Panze Roadhouse Show": 1, "Mpls. Cops Padlock Switch Show After 2 Parade in 'Drag'": 1, "Mpls.' Male Stripper": 1, "Murf., Film review: The Tiger Makes Out": 1, "Music Records: Bailey SRO 17G, N.Y": 2, "Music-Night Clubs: Bobby Stevens Recovered": 1, "N.Y. Police Make Night Club Raids": 2, "NIGHT CLUB REVIEWS: Showboat, Jacksonville, Fla.": 1, "NUT CLUB, N. Y.": 1, "New Acts - TONY & EDDIE": 1, "New Acts This Week: ALEXANDRIA and OLSEN and Gang (3) Fred.": 1, "New Acts This Week: ORIENTAL REVUE (10). Fred.": 2, "New Acts: BOBBIE ROWLAND (2) Edba.; contains some comments on female impersonation generally at this time; vaudeville is overrun with it": 1, "New Acts: Bob and Gale Sherwood": 1, "New Acts: CHRISTOPHER BRIDGEMAN Kirk.": 1, "New Acts: MADAME POMPADOUR": 1, "New Acts: MERCER BROS. (2) Jose.": 1, "New Acts: MIMIC MEN (3) Jose.": 2, "New Acts: RAY SHANNON and CO. Char.": 1, "New Acts: Village Grove NUT CLUB, With BUDDY WALKER (21) Mark.": 1, "New York At Night": 2, "Night Club Notes": 6, "Night Club Reviews - Chateau Club, Cleveland": 1, "Night Club Reviews - Colosimo's, Chicago": 1, "Night Club Reviews - Hotel Chase. St. L Sahu.": 1, "Night Club Reviews: Blue Angel, N. Y Jess.": 2, "Night Club Reviews: Blue Angel, N. Y. Chan.": 1, "Night Club Reviews: Bon Soir, N. Y Pit.": 1, "Night Club Reviews: Chi Chi, S.F. Sanf.": 1, "Night Club Reviews: Flamingo. Las Vegas Duke.": 1, "Night Club Reviews: Gardenia, L.A. Kirk.": 1, "Night Club Reviews: Harrah's Tahoe Shie.": 1, "Night Club Reviews: Interlude. I. A Kafa.": 1, "Night Club Reviews: Interlude. L. A. Daku.": 2, "Night Club Reviews: Latin Quarter, Miami Bill.": 1, "Night Club Reviews: Le Cupidon, N. Y. Jose.": 1, "Night Club Reviews: Little Hippodrome, N.Y. Jose.": 1, "Night Club Reviews: Living Room, N. Y. Bill.": 1, "Night Club Reviews: New Acts - BOB COPFER FOUR Jose.": 1, "Night Club Reviews: New Acts - DOUGLAS BYNG Jose.": 1, "Night Club Reviews: Riviera, Las Vegas Jose.": 1, "Night Club Reviews: TORCH CLUB Pullen.": 4, "Night Club Reviews: Tara Club, Downingtown, Pa. Hari.": 5, "Night Club-Vaude Reviews: Carnival, Pittsburgh": 2, "Night Spots-Orchestra-Music: Female Imps Back in Philly": 3, "Night clubs-vaudeville: Battle Creek Club Spends": 1, "Nitery's Impersonators Cause Near Closing": 1, "Norman A. King": 1, "Nut Club, Wildwood Math.": 1, "OBITUARIES": 3, "OBITUARY": 2, "OFF-B'WAY REVIEW - The Ladv In Question Humm.": 1, "OMG also probably the first time \"boylesque\" is mentioned in my archival material!!!!": 1, "Ohio Jurist's Critique: 'Fine' Show by Fem-Male But 'Improper Dress'": 1, "On The Upbeat: Pittsburgh": 1, "On and Off the Record": 1, "One-Man Show: Charles Pierce: Not A Well Woman CART.": 1, "One-Man Show: Lynne Carter, Sege.": 1, "Opener for women's wrestling match!": 1, "Pansy Club' Now With Racket Getting Bolder": 2, "Pansy' Places on Broadway": 1, "Parks-Pools: Hill Heads Luna Circus": 1, "Paul Harrison, \"In New York\"": 1, "Paul Harrison, \"In New York\",": 1, "Paul Harrison, \"In New York\", 14243789": 1, "Paul Harrison, \"In New York\", 170606297": 1, "Paul Harrison, \"In New York\", 286616630": 1, "Paul Harrison, \"In New York\", 48256440": 1, "Paul Harrison, \"In New York\", 53726485": 1, "Paul Harrison, \"In New York\", 56317438": 1, "Paul Harrison, \"In New York\", 607309394": 1, "Paul Harrison, \"In New York\", 627840200": 1, "Paul Harrison, \"In New York\", 959498": 1, "Paul Harrison, \"In New York\", 96790176": 1, "Peaches Browning's Bally Protest Shrivels Receipts": 1, "Personals": 2, "Philly-Area Strawhats Bucking Bally Dimout in Local Press Strike": 1, "Pinky Lee for T&C": 1, "Play Reviews: Kilpatrick's Minstrels Edba.": 1, "Possibilities": 1, "Producer, International Varieties": 1, "REVERSED 'PANSY' CO. BY IMPERSONATORS": 5, "RKO ad": 1, "Reno's Riverside Hotel Drops Femme Impersonator Show in Face of Ban": 1, "Reviews of Units: Sollie Child's Parisian Follies Unit Case": 1, "Reviews: Apollo. N. Y Jose.": 8, "Reviews: DOWNTOWN, L. A. Call.": 1, "Reviews: KEDZIE, CHICAGO": 1, "Reviews: Lads-in-Drag & 1 Mustachioed Girl, Or Limp-Wrist Time ca Broadway": 5, "Room At Bottom, N. Y. Bill.": 1, "Rosenberg Minus Pansies, But Gets Beer Permit": 1, "Rough Frisco Cops Send Pinched Boys To Women's Court": 7, "Round the Tables": 3, "Route Department": 14, "Route Department; Page numbers refer to entire section of issue rather than the page where the artist appears": 37, "Safe Refuge": 1, "See http://outhistory.org/exhibits/show/queer-bronzeville/part-2/female-impersonators. TODO: Fix imprecise date. OutHistory references \"At Joe's,” The Chicago Defender (National Edition), December 9, 1939, 20; “Here and There by Bob Hayes,” The Chicago Defender (National Edition), July 27, 1940, 20.": 4, "Sergeants' Raises Curtain On Lyceum Theater Season": 1, "Shannon and Company": 1, "Show Out of Town - New Faces of 1956 Guy.": 1, "Show Reviews: KEITH'S PHILADELPHIA": 1, "Source corroborated by https://www.nytimes.com/1975/02/10/archives/bob-sylvester-68-columnist-dead-his-dream-street-ran-in-the-news.html": 4, "Starring in Revue at Cogan's": 1, "Strange 'Third' Sex Flooding Nation": 1, "Strictly Confidential": 1, "Sus. Sentences for Femme Imps, in Troy, N.Y., Pinch": 4, "TODO: A longer article about his strip acts.": 1, "TODO: Fix imprecise date. See The Miami Herald, March 11, 1948,  15; The Miami Herald, March 12, 1948, 25 +  The Miami Herald, January 16, 1949, 101 (?) + January 17, 1949, 39": 1, "TODO: Look closer at the detailed description of the Gypsy routine here!": 1, "TODO: Look closer at the detailed description of the Hedy Lamarr routine here!": 1, "TODO: verify date": 1, "TRUE": 2, "The article mentions nightly performances between Fri 7th until arrest on 13th": 35, "The date comes from IBDB, see https://www.ibdb.com/broadway-production/mima-10800#OpeningNightCast.": 3, "The date is unclear here due to poor scan.": 1, "The expression to \"do a Francis Renault\"": 1, "Theatrical Notes": 1, "Times Square: CHATTER Loop": 1, "Transplanted": 1, "Two Convicted of Holding Indecent Show": 1, "Unit Reviews: GIRLY-GO-ROUND. Barn.": 1, "Unit Reviews: KING'S VARIETIES Pete.": 1, "Unit Reviews: Latin Quarter Revue Will.": 1, "Units Shape Up As Season's Bet": 2, "Uno": 12, "VAUDEVILLE REVIEWS - Capitol, New York": 1, "VAUDEVILLE REVIEWS FROM COAST TO COAST: Keith's Franklin, N. Y.": 2, "VAUDEVILLE REVIEWS: Loew's State, New York": 1, "Variety Bills": 299, "Variety House Review: HIPP, BALTIMORE Bert.": 1, "Variety House Reviews: NATIONAL, HAVANA Rene.": 2, "Variety House Reviews: PARAMOUNT, L. A. Edwa.": 1, "Variety House Reviews: Variety Bills": 11, "Vaude House Reviews: 86TH ST. Bige.": 1, "Vaude House Reviews: DOWNTOWN. L. A.": 1, "Vaude-Night-Clubs: 15 YEARS AGO": 1, "Vaude-Night-Clubs: Karyl Norman, Who Once Meant Big B.O. in Cleve., Brought Back by Jabin": 2, "Vaude-Nite Clubs: Minstrel Revival May Hold Mclntyre-Heath, Tinney; Swor Staging": 1, "Vaudeville Notes": 3, "Vaudeville Reviews: Earle, Philadelphia": 1, "Vaudeville Reviews: Loew's Orpheum, N. Y.": 1, "Vaudeville Reviews: Loew's State, New York": 2, "Vaudeville Reviews: Loop-End, Chicago": 1, "Vaudeville Reviews: Oriental, Chicago": 1, "Vaudeville Reviews: The Palace, New York": 1, "Vaudeville: Det. Raid Jails Acts, Cafe Show 'Postponed'": 1, "Vaudeville: Femme Impersonator Unit Set for Pitt Summer Run": 2, "Vaudeville: Five Shot in Greenwich Village Nitery Stickup": 2, "Vaudeville: Gambling Ban Seen Aiding Miami Cafes As Bonifaces Predict Lush Season Solloway, Lary.": 2, "Vaudeville: Harlem Trying Limp-Wrist Twist In Last-Ditch Pitch for Biz Cohen, Joe.": 1, "Vaudeville: Hub Spots Reopen": 1, "Vaudeville: Jean Parker Tops Show At Greenwich Village Inn": 1, "Vaudeville: Minneapolis Cracks Down on Femme Impersonator Spots": 3, "Vaudeville: N.Y. Drag Joint Draws Rum OK Revocation": 1, "Vaudeville: Night Club Reviws - Kitty Davis', Miami Lary.": 1, "Vaudeville: Renault Reprise A Scream SRO Jose.": 2, "Vaudeville: Renault's Carnegie Date": 1, "Vaudeville: Variety Bills": 7, "Walter Winchell, \"On Broadway\"": 1, "Walter Winchell, \"On Broadway\", 182429363": 1, "Walter Winchell, \"On Broadway\", 182673015": 1, "Walter Winchell, \"On Broadway\", 333476248": 1, "Walter Winchell, \"On Broadway\", 333512555": 1, "Walter Winchell, \"On Broadway\", 391938170": 1, "Walter Winchell, \"On Broadway\", 397099262": 1, "Walter Winchell, \"On Broadway\", 475691321": 1, "Walter Winchell, \"On Broadway\", 47724722": 1, "Walter Winchell, \"On Broadway\", 480157301": 1, "Walter Winchell, \"On Broadway\", 48256083": 1, "Walter Winchell, \"On Broadway\", 49416340": 1, "Walter Winchell, \"On Broadway\", 49480691": 1, "Walter Winchell, \"On Broadway\", 586848237": 1, "Walter Winchell, \"On Broadway\", 615435304": 1, "Whole Gang of Femme Impersonators Too Much for Moss; Banned in N.Y.": 4, "ZIEGFELD FOLLIES Baral, Robert.": 1, "agency": 1, "automobile club": 1, "booking ad": 1, "bookings": 1, "clipping in UALR archives": 4, "death of wife???": 3, "disgusted author writes about how her experience seeing \"women . . . slobbering over and feeling women\" was worse than seeing the perfect illusion of a \"fairy ball,\" where \"gorgeous looking creatures . . . acting affectionately toward real males.\"": 1, "family": 1, "female impersonation in the southwest pacific during the war with both Australians and white and black Americans": 1, "first date": 1, "four weeks": 1, "free lunch with the show....": 1, "gendered \"he\" in the reporting; appearing quite male-presenting in the picture": 1, "gown insurance": 1, "help": 1, "imitation": 1, "incredibly transphobic reporting": 1, "last date of booking": 1, "mother is dead": 1, "nostalgia": 1, "old-fashioned": 1, "radio drag": 1, "robbed": 2, "robbed in Atlantic City": 4, "stopped": 1, "stores...": 1, "suit to Enjoin Cops From Being Meanies": 1, "theft": 1, "tough conditions": 1, "trial for nudity": 1, "“Female Impersonator Halted in Fan Dance”": 1}